[
  {
    "file_name": "9.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/9.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 이산자료분석(Discrete Data Analysis) 개설학년 3, 4학년 전공능력 전공능력 대표성 이 과목은 관심변수가 이산형 변수인 경우의 분석방법을 다루는 것을 목적으로 한다. 로그선형(Log-Linear)모형에서 모형의 선택방법, 적합도검정, 분할표(contingency table)에서 각 셀(cell)의 기대도수의 추정방법, 최우추정값의 계산방법 등을 다룬다. 또 한 로짓(logit)모형, 선형로지스틱회귀모형(linear logistic regression model)등을 소개 한다. 통계적모형화 대표 전공능력 수리 연관 전공능력 프로그래밍 통계윤리 협업 문제해결 자료처리 자료분석 글로벌 수업목표 주 수업내용 1 범주형 자료란? 비율에 대한 추론 강의 교재 1장 2 이차원 분할표 - 분할표의 구조 - 두 집단의 비율비교 강의 교재 2장 3 이차원 분할표 - 독립성에 대한 검정 - 오즈비 강의 교재 2장 레포트 1 4 이차원 분할표에 대한 분석 - 순서범주형 자료에 대한 독립성 검정 - 소표본에 대한 exact test 강의 교재 2장 레포트 2 5 삼차원 분할표에 대한 분석 강의 교재 3장 레포트 3 6 4장 일반화선형모형 일반화 선형모형이란? 강의 교재 4장 7 4장 일반화선형모형 - 이항자료에 대한 GLM - 분할표의 로그선형모형 part1 강의 교재 4장 레포트 4 8 4장 일반화선형모형 - 계수 자료에 대한 GLM part 2 중간고사 교재 4장 9 4장 일반화선형모형 계수자료에 대한 GLP part 3 5장 로지스틱 회귀모형 part 1 강의 교재 4장 교재 5장 레포트 5 10 5장 로지스틱 회귀분석 part2 강의 11 5장 로지스틱 회귀분석 part3 강의 레포트 6 12 보강주간 13 6장 분할표의 로그선형모형 part1 강의 14 6장 분할표의 로그선형모형 part2 (고차원) 강의 레포트 7 15 7장 로짓모형과 로그선형모형의 관계 - 로짓과 로그선형모형의 구축 - 순서형 자료에 대한 로그선형모형 강의 레포트 8 16 기말고사"
  },
  {
    "file_name": "8.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/8.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 기초확률론(Probability Theory) 개설학년 2학년 전공능력 전공능력 대표성 이 과목은 확률이론에 관한 기초적인 내용을 다루는 것을 목적으로 한다. 확률의 공리 적 정의를 기초로 확률적 독립의 조건부 확률, 그리고 여러 가지 확률의 법칙을 학습한 다. 확률변수를 설명하고, 확률밀도함수, 확률분포, 기대 값, 분산, 적률생성함수 등을 설명한다. 그리고 확률이론에서 널리 쓰이는 이항분포, 포아송 분포등 이산형 분포와 정규분포, 감마분포등 연속형 분포를 소개하고 이들 분포들의 성질을 학습한다. 마지 막으로 일정한 조건에서 표본의 크기가 커질 때 임의의 분포가 정규분포로 수렴해 가는 중심극한 정리를 소개한다. 통계적모형화 연관 전공능력 수리 대표 전공능력 프로그래밍 통계윤리 협업 문제해결 자료처리 자료분석 글로벌 수업목표 주 수업내용 1 용어의 정의 등확률모형 경우의수 확률의 성질 2 조건부확률 표본공간의분할 조건부확률의성질 사건의독립성 독립시행 3 확률의정의 확률의연속성 극한사건 4 확률모형과분포 유한표본공간에서의 확률모형 유한표본공간에서 극한을 취하여 얻어지는 확률모형 5 무한회의 베르누이 독립반복시행에서 얻어지는 모형 확률분포의 분류 다차원확률분포 6 measure theory의필요성 균등분포와 non-measurable set 확률의 재정의 probability triples The extension theorem 7 균등분포의 구성 Extension theorem의 확장 동전던지기와 다른 측도(measure) 8 복습 및 중간고사 9 확률변수 독립성 확률의연속성 극한사건 Tail Fields 10 simple random variables 일반적인 비음(non-negative) 확률변수 임의의 확률변수 적분과의 관계 11 확률부등식 확률변수의 수렴 대수의 법칙 적률조건의 완화 12 보강주간 13 확률변수의 분포 변수변환이론 분포의 예 14 확률과정과 도박게임 A first existence theorem 15 파산문제 Gambing policies 16 복습 및 기말고사"
  },
  {
    "file_name": "16.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/16.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 다변량통계학(Multivariate Statistics) 개설학년 3, 4학년 전공능력 전공능력 대표성 다변량통계학은 여러 개 관심변수 간의 관계를 규명하는 통계분석기법이다. 다변량 확 률변수 개념을 바탕으로 다변량 통계 개념, 다변량 분포, 특히 다변량 정규분포, 모집단 평균벡터에 대한 추론, 다변량 분산분석을 다룬다. 또한 주성분 분석, 인자 분석, 정준 상관분석, 판변분석과 분류, 군집분석, 그리고 구조방정식모형을 학습한다. 이론적인 학습과 함께 SAS, R과 같은 통계 패키지를 이용한 데이터 분석을 병행하여 데이터 다루 는 능력을 향상시킨다. 기초통계학 과목과 함께 다변량 데이터는 행렬로 표현되므로 행 렬대수 과목을 선수과목으로 권장한다. 통계적모형화 대표 전공능력 자료분석 연관 전공능력 프로그래밍 수리 통계윤리 협업 문제해결 자료처리 글로벌"
  },
  {
    "file_name": "17.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/17.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 회귀분석II(Regression Analysis II) 개설학년 3, 4학년 전공능력 전공능력 대표성 회귀분석은 하나의 관심변수와 여러 개의 설명변수 간의 관계를 회귀모형을 통하여 규 명하는 통계분석기법이다. 이 과목에서는 선형회귀분석에서 학습한 회귀분석 기본 이 론을 기초로 비선형모형으로 확장된 회귀분석 이론을 학습한다. 회귀함수가 비선형 함 수인 비선형회귀분석, 시계열 자료를 다루는 시계열 회귀분석, 관심변수가 이항자료인 경우에 사용하는 로지스틱회귀분석, 그리고 이산형 관심변수에 적용가능한 일반화 회 귀분석 등을 다룬다. 회귀분석의 이론적인 내용 학습과 함께 SAS, R과 같은 통계패키 지를 이용한 데이터 분석을 병행함으로써 실제 데이터 분석 능력을 기른다. 통계적모형화 대표 전공능력 자료분석 연관 전공능력 프로그래밍 수리 통계윤리 협업 문제해결 자료처리 글로벌"
  },
  {
    "file_name": "29.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/29.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 베이지안통계학(Bayesian Statistic) 개설학년 3, 4학년 전공능력 전공능력 대표성 이 과목은 통계학의 주요 접근법중 하나인 베이지안 접근법을 소개한다. 사전 및 사후 분포 등의 기초 개념과 추정 및 가설 검정, 그리고 자료분석을 위한 몬테칼로 방법을 주 요 내용으로 다루어 관련 개념 및 응용 방법들을 습득하는 것을 목적으로 한다. 통계적모형화 대표 전공능력 자료분석 연관 전공능력 프로그래밍 수리 통계윤리 협업 문제해결 자료처리 글로벌 수업목표 주 수업내용 주 수업내용 15 12장. 베이지안 회귀분석 1) 선형회귀모형 2) 최소제곱추정치 3) 회귀모형의 베이지안 추론 강의 과제 10 16 기말고사 7-12장에 대한 지필고사"
  },
  {
    "file_name": "15.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/15.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 언어처리및학습(Language Processing and Learning) 개설학년 3, 4학년 전공능력 전공능력 대표성 본 과목은 언어처리와 관련한 제반 이론과 기계 학습에 연관한 이론을 학습하여, 다양 한 자연어 처리 응용 시스템에 대한 적용을 해볼 수 있는 능력을 함양하는 목적을 가진 다. 구체적인 학습 내용은 텍스트 처리, 언어모델링, 문서 분류 및 분석, 신경 언어모델, 논리표현식, 자연어 처리 최신 응용 등을 포함한다. 관련 이론의 강의 위주의 수업을 진 행하며 필요할 경우 실용적인 접근법에 대한 경험을 위해 실습과 과제가 포함될 수 있 다. 통계적모형화 대표 전공능력 자료처리 연관 전공능력 프로그래밍 수리 통계윤리 협업 문제해결 자료분석 글로벌 수업목표 주 수업내용 1 강의 소개 2 자연어 처리 소개 3 텍스트 처리 4 텍스트 분류 5 언어 모델 6 신경망 기반 언어 모델 7 시맨틱스 8 중간고사 9 단어 표현 10 어텐션 및 트랜스포머 11 트랜스포머 기반 언어 모델 12 보강주간 13 언어 처리 응용 14 언어 처리 응용 15 언어처리 응용 16 기말고사"
  },
  {
    "file_name": "14.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/14.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 데이터베이스(Database) 개설학년 3, 4학년 전공능력 전공능력 대표성 데이터베이스 과목은 데이터 모델, 질의 언어, 데이터베이스 디자인, 트랜잭션 처리, 질 의 처리, 동시성 제어, 회복, 데이터베이스 관리 시스템 등 데이터베이스의 이론을 포함 한 실용적 지식을 포함한다. 데이터베이스를 활용한 데이터 관리 시스템을 관리하거나 데이터베이스를 활용하는 프로그램 개발에 필요한 능력을 배양하는데 본 과목의 목적 이 있다. 빅데이터의 저장 및 처리에 관한 개념을 학습하기 위해서 데이터베이스의 이 론이 필요하며, 이를 습득하고 연계하는 능력을 통해 빅데이터 전공에서 필요한 기초 지식을 확보할 수 있다. 자료분석 대표 전공능력 프로그래밍 연관 전공능력 통계적모형화 수리 통계윤리 협업 문제해결 자료처리 글로벌 수업목표 주 수업내용 1 강의소개 데이터베이스 개요 2 데이터베이스 개요 관계형 데이터 모델 3 관계형 데이터 모델 4 개체 관계 모델 및 데이터베이스 설계 5 SQL 기초 6 SQL 활용 7 정규화 8 중간고사 9 트랜잭션 10 동시성 및 회복 11 인덱싱 12 보강주간 13 데이터베이스 관리 시스템 14 데이터베이스 응용 15 데이터베이스 응용 16 기말고사"
  },
  {
    "file_name": "28.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/28.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 행렬과대수 II(Matrix Algebra II) 개설학년 2학년 전공능력 전공능력 대표성 이 과목은 행렬과대수Ⅰ에 이어 행렬대수의 기법을 소개하는 것을 목적으로 한다. 고유 치, 행렬의 분해와 계산, 통계량과의 관련성을 다룬다. 수리 대표 전공능력 프로그래밍 통계적모형화 통계윤리 협업 문제해결 자료처리 자료분석 글로벌 수업목표 주 수업내용 주 수업내용 15 볼록최적화 필기 통계학을위한 행렬대수학 안수한 이용희 역서 자유아카데미 16 기말고사 필기 통계학을위한 행렬대수학 안수한 이용희 역서 자유아카데미"
  },
  {
    "file_name": "10.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/10.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 수리통계학 II(Mathematical Statistics II) 개설학년 3, 4학년 전공능력 전공능력 대표성 이 과목은 수리통계학Ⅰ에 이어 Neyman-Pearson 보조정리에 의한 최량검정, 우도비 검정 등이 소개되고 이들의 응용이 다루어지는 것을 목적으로 한다. 또한 비모수적 방 법에 의한 추정 및 검정이 소개되고, 간단한 다원배치의 실험계획법이 소개된다. 통계적모형화 대표 전공능력 수리 연관 전공능력 프로그래밍 통계윤리 협업 문제해결 자료처리 자료분석 글로벌 수업목표 주 수업내용 1 Distribution derived from the Normal distribution Order Statistics Lecture Mathematical Statistics and Data Science Ch.6 2 Limit Theorems Delta-Methods Lecture Mathematical Statistics and Data Science Ch.5 3 Sufficiency -Measures of Quality of Estimators -A sufficient Statistics for a parameter -Properties of a sufficient statistic -Completeness and Uniqueness Lecture Introduction to Mathematical Statistics Ch.7 Homework #1 (tentative) 4 Sufficiency -The exponential class of distributions -Functions of Parameters -The case of several parameters -Minimal sufficiency and ancilliary statistics Sufficiency, completeness, and independence Lecture Introduction to Mathematical Statistics Ch.7 5 Optimal Tests of Hypothesis -Most powerful tests -Uniformly most powerful tests -Likelihood ratio tests Lecture Introduction to Mathematical Statistics Ch.8 Homework #2 (tentative) 6 Optimal Tests of Hypothesis -The sequential probability ratio test -Minimax and classification procedures Lecture Introduction to Mathematical Statistics Ch.8 7 Practice of problems over the covered topics Lecture Homework #3 (tentative) 8 Midterm Midterm 9 Inferences About Normal Linear Models -One-way Anova -Noncentral Chi-sqare distribution and F-distribution -Multiple comparision -Two-way Anova Lecture Introduction to Mathematical Statistics Ch.9 10 Inferences About Normal Linear Models -Regression Problems -Test of Independence -Distribution of certain quadratic forms Lecture Introduction to Mathematical Statistics Ch.9 Homework #4 (tentative) 11 Nonparametric and Robust Statistics -Sample Median and the Sign Test -Signed-Rank Wilcoxon Lecture Introduction to Mathematical Statistics Ch.10 12 보강주간 13 Nonparametric and Robust Statistics -Signed-Rank Wilcoxon (continued) -Mann-Whitney-Wilocoxon procedure -Robust concepts Lecture Introduction to Mathematical Statistics Ch.11 Homework #5 (tentative) 14 Survey Sampling -Simple random sampling -Stratified random sampling Lecture Mathematical Statistics and Data Science Ch.7 15 Practice of problems over the covered topics. Lecture 16 Final Final Exam"
  },
  {
    "file_name": "11.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/11.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 통계조사론(Survey Sampling) 개설학년 3, 4학년 전공능력 전공능력 대표성 이 과목은 통계자료를 생성하는 여러 가지 기법을 학습하는 것을 목적으로 한다. 통계 자료를 생성할 때 발생하는 오차의 개념을 다루고 통계적 처리방법을 학습한다. 통계조 사 방법으로서 층화, 집락화, 그리고 다단계 추출 방법을 소개하며 각각의 장단점을 설 명한다. 또한 통계조사 자료에 근거한 추정량의 신뢰도를 나타내는 방법으로 분산추정 을 하며, 분산추정의 여러 가지 방법을 소개한다. 통계적모형화 대표 전공능력 수리 연관 전공능력 자료분석 연관 전공능력 프로그래밍 통계윤리 협업 문제해결 자료처리 글로벌"
  },
  {
    "file_name": "13.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/13.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 금융통계(Statistical Finance) 개설학년 3, 4학년 전공능력 전공능력 대표성 이 과목은 금융의 기본적인 용어 및 이론을 소개하고, 이러한 이론을 금융자료에 적용 하기 위한 통계적 방법론을 소개하는 것을 목적으로 한다. 금융이론은 최근에 비약적인 발전을 이루었으며, 현대적 투자론의 근간을 이루었고, 이론이해 및 실무적용 능력에 대한 사회적 수요가 더해가고 있기 때문이다. 통계적모형화 대표 전공능력 협업 연관 전공능력 프로그래밍 수리 통계윤리 문제해결 자료처리 자료분석 글로벌 수업목표 주 수업내용 1 수익률, 임의보행과정 모형 강의 2 효율적 시장가설 강의 3 포트폴리오 이론: 평균-분산 모형 강의 4 포트폴리오 이론: 평균-분산 모형 강의 5 자본자산 결정모형 (CAPM) 강의 6 자본자산 결정모형 (CAPM) 강의 7 · 실물자산의 수익률자료로부터, 최적의 포트폴리오를 구성할 수 있도록 한다. · 코스피에 상장되어 있는 종목 중 몇 개를 선택하여, 기대수익률, 수익률의 분산, 공분산을 추정하고, 이를 이용하여, 최적포트폴리오를 구성해보고, 이를 발표한다. · 적절한 수의 팀으로 나누어, 팀당 20분 발표 5분 토론의 형식으로 진행한다. 발표 8 중간고사 시험 9 변동성 모형 강의 10 변동성모형 강의 11 위험값의 추정: 모수적 방법 강의 12 보강주간 13 위험값의 추정: 비모수적 방법, 몬테카를로 방법 강의 14 위험값의 추정 방법 검정 강의 15 · 실물자산 및 옵션으로 이루어진 포트폴리오의 최적투자방법 및 VaR 을 추정하는 내용의 팀별 발표를 한다. · 적절한 수의 팀으로 나누어, 팀당 20분 발표 5분 토론의 형식으로 진행한다. 발표 16 기말고사 시험"
  },
  {
    "file_name": "12.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/12.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 통계수학(Statistical Mathematics) 개설학년 2학년 전공능력 전공능력 대표성 이 과목은 통계를 다루는데 필요한 수학적 개념을 소개하고, 무한급수, 적분, 미분방정 식 등을 다루는 것을 목적으로 한다. 적분이나 미분방정식을 이용하여 실제 현상들을 수학적으로 다루고 해석하는 능력을 습득한다. 수리 대표 전공능력 프로그래밍 통계적모형화 통계윤리 협업 문제해결 자료처리 자료분석 글로벌 수업목표 주 수업내용 1 2 3 4 5 6 7 8 9 10 11 12 보강주간 13 14 15 16"
  },
  {
    "file_name": "23.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/23.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 통계자료처리및실습(Statistical Data Processing and Lab) 개설학년 2학년 전공능력 전공능력 대표성 이 과목은 통계패키지인 SAS와 R을 이용한 자료의 입출력과 변환 등의 자료 처리 기법, 기초 통계 분석, SQL을 이용한 데이터베이스와의 연동, 그리고 기초적인`프로그래밍 의 기법을 소개하는 것을 목적으로 한다. 자료처리 연관 전공능력 프로그래밍 대표 전공능력 통계적모형화 수리 통계윤리 협업 문제해결 자료분석 글로벌 수업목표 주 수업내용 1 객체 2 연산자와 내장 함수 3 데이터 관리 4 For 문 5 While 문 6 If 문 7 Apply 문 8 중간고사 9 사용자 정의 함수 10 사용자 정의 함수 11 기술통계량 12 보강주간 13 모평균에 대한 추론 14 모비율에 대한 추론 15 회귀 분석 16 기말고사"
  },
  {
    "file_name": "22.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/22.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 의학통계학(Biostatistics) 개설학년 3, 4학년 전공능력 전공능력 대표성 이 과목은 생명과학과 관련된 통계적 문제와 자주 사용되는 통계분석기법을 학습하는 것을 목적으로 한다. 주요 분석기법으로 추정과 검정, 분할표, 로짓 및 로그선형분석, 공분산분석, 반복측정 자료분석, 생존분석 등을 소개한다. 통계적모형화 대표 전공능력 프로그래밍 수리 통계윤리 협업 문제해결 자료처리 자료분석 글로벌 수업목표 주 수업내용 1 의학통계학 소개/변수의 종류 2 집단의 비교(모수적 방법) 3 집단의 비교(비모수적 방법) 4 연관성의 검정 - 분할표 분석 5 연관성의 검정 -검정 및 평가 6 로짓분석 7 로지스틱 회귀분석1 8 중간시험 9 로지스틱 회귀분석2 10 공분산분석1 11 공분산분석2 12 보강주간 13 생존분석2 14 생존분석3 15 임상시험연구의 개념 및 설계/대상자수의 결정 16 기말시험"
  },
  {
    "file_name": "20.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/20.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 고급통계프로그래밍(Advanced statistical Programming) 개설학년 2학년 전공능력 전공능력 대표성 본 교과목은 통계프로그래밍및실습에서 학습한 기초적인 프로그래밍 원리에 대하여 더욱 심화 학습한다. 데이터과학에서 사용되는 주요 프로그래밍 언어중 하나인 Python (혹은 Java)를 이용하여 프로그램 설계와 구현에 대한 심화된 개념들을 소개한다. 또한 데이터 처리와 데이터 요약 및 시각화 등 데이터 탐색 기법을 포함한 현실의 통계적 프 로그래밍을 위한 토픽들을 다룬다. 자료처리 연관 전공능력 프로그래밍 대표 전공능력 통계적모형화 수리 통계윤리 협업 문제해결 자료분석 글로벌 수업목표 주 수업내용 1 Course Orientation and Basics 강의 및 실습 Lecture Note 2 Grammar : If, For, While 강의 및 실습 Lecture Note 3 Data Type : List, Tuple, Set, Dictionary, String 강의 및 실습 Lecture Note 4 Function: Parameter and return, Local and global variable 강의 및 실습 Lecture Note HW1 Release 5 Numpy data, Image data 강의 및 실습 Lecture Note 6 Text data, CSV data 강의 및 실습 Lecture Note 7 Object-Oriented Programming: Class, Method, Attribute 강의 및 실습 Lecture Note HW2 Release 8 Midterm Exam 지필고사 9 Linked List (1) - Single Node, Stack, Queue 강의 및 실습 Lecture Note 10 Linked List (2) - Recursion and Dynamic Programming 강의 및 실습 Lecture Note HW3 Release 11 Decision Tree 강의 및 실습 Lecture Note 12 보강주간 13 Algorithm Analysis 강의 및 실습 Lecture Note HW4 Release 14 Sorting Algorithm 강의 및 실습 Lecture Note 15 Introduction to Pytorch 강의 및 실습 Lecture Note 16 Final Exam 지필고사"
  },
  {
    "file_name": "21.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/21.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 보험통계학Ⅱ (Insurance StatisticsⅡ) 개설학년 3, 4학년 전공능력 전공능력 대표성 이 과목은 보험통계학Ⅰ과 연계된 과정으로서 손해보험, 건강보험을 비롯한 좀 더 일반 적인 보험의 분석 및 위험관리, 설계관한 기본적인 방법론을 다루는 것을 목적으로 한 다. 문제해결 연관 전공능력 협업 대표 전공능력 프로그래밍 통계적모형화 수리 통계윤리 자료처리 자료분석 글로벌 수업목표 주 수업내용 1 생명분포: 생존함수와 생존시간, 사력과 평균여명 강의 2 손해분포: 손해빈도모형, 손해심도모형 강의 3 손해분포: 손해 총합모형, 포아송과정, 위험이론 강의 4 개별위험모형: 개별손해 확률변수에 대한 모형, 독립확률변수의 합 강의 5 개별위험모형: 합의 분포에 대한 근사,보험에 응용 강의 6 집단위험모형: 총손해액분포, 기본적인 분포의 선택 강의 7 집단위험모형: 특정한 복합분포의 성질, 총손해액의 근사 강의 8 중간고사 시험 9 완전신뢰도 강의 10 부분신뢰도 강의 11 뷸만 신뢰도 강의 12 보강주간 13 뷸만-스트라웁 신뢰도 강의 14 베이지안 신뢰도 강의 15 시물레이션 방법 강의 16 기말고사. 시험"
  },
  {
    "file_name": "25.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/25.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 프로그래밍언어및실습(Programming Language and Experiments) 개설학년 1학년 전공능력 전공능력 대표성 일반적으로 통계학 분야에서 사용되는 프로그래밍은 주로 패키지를 이용한다. 이 과목 은 통계패키지를 이용하지 않은 C언어 등의 프로그래밍 언어를 학습하고, 실습을 통해 Programming Skill을 높이는 능력을 키우는 것을 목적으로 한다. 자료처리 연관 전공능력 프로그래밍 대표 전공능력 통계적모형화 수리 통계윤리 협업 문제해결 자료분석 글로벌 수업목표 주 수업내용 1 Course Orientation and Introduction to Python 2 Variable and Operator 3 Data Type: List, Tuple, Set, Dictionary 4 Conditions and Loops 5 Module and Exception Handling 6 Function 7 Object-Oriented Programming 8 Midterm Exams 9 Data Analysis with Numpy 10 Data Analysis with Pandas 11 Data Visualization with Matplotlib 12 보강주간 13 Statistical Analysis with Numpy and Scipy 14 Probability Distribution with Numpy and Scipy 15 Regression Analysis with Scikit-learn 16 Final Exams"
  },
  {
    "file_name": "19.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/19.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 통계계산(Computational Statistics) 개설학년 3, 4학년 전공능력 전공능력 대표성 본 교과목에서는 통계 프로그래밍 언어인 R 또는 Python에 기반하여 기계학습 등 통계 학의 여러 분야에서 흔히 사용되는 계산 기법을 소개한다. 주요 토픽으로는 수치적분, 수치해법, 최적화 등을 포함하는 기초적인 수치 계산법, 행렬연산, 난수 발생, 몬테칼로 기법(Monte Carlo method), 기대화-최대화 알고리즘, 붓스트랩 등이 있다. 수리 대표 전공능력 프로그래밍 연관 전공능력 통계적모형화 통계윤리 협업 문제해결 자료처리 자료분석 글로벌 수업목표 주 수업내용 1 R 프로그래밍 강의 및 실습 참고자료 2 부동소수점과 오차 강의 강의노트 3 정확도 강의 참고자료 과제1 4 수치계산(2장) 강의 2장 5 수치계산(2장) 강의 및 실습 2장 과제2 6 행렬의 응용(3-5장) 강의 3-5장 7 행렬의 응용(3-5장) 강의 및 실습 3-5장 과제3 8 중간고사 9 확률변수의 발생과 그 응용(6-8장) 강의 6-8장 10 확률변수의 발생과 그 응용(6-8장) 강의 6-8장 11 확률변수의 발생과 그 응용(6-8장) 강의 및 실습 6-8장 과제4 12 보강주간 13 여러가지 모의실험 강의 및 실습 강의노트 과제5 14 붓스트랩 알고리즘 강의 및 실습 강의노트 15 EM 알고리즘 강의 및 실습 강의노트 과제6 16 기말고사"
  },
  {
    "file_name": "18.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/18.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 기계학습및실습(Machine Learning and Lab) 개설학년 3, 4학년 전공능력 전공능력 대표성 본 교과목에서는 R 또는 Python에 기반하여 여러 가지 학습문제에 많이 사용되는 방법 론을 소개한다. 주요 토픽으로는 의사결정나무, 신경망 등 여러 가지 지도학습 기법 및 평가 방법, 그리고 연관규칙, 군집, 차원축소 방법 등 자율학습 기법이 있다. 통계적모형화 대표 전공능력 자료분석 연관 전공능력 문제해결 연관 전공능력 프로그래밍 수리 통계윤리 협업 자료처리 글로벌 수업목표 주 수업내용 주 수업내용 15 15. 뉴럴네트워크 15-1. 뉴럴네트워크의 소개, 15-2. 뉴럴네트워크의 학습 15. Neural Networks 15-1. An Overview of Neural Networks, 15-2. Neural Network Learning Lecture Slides 16 기말고사 Final Exam"
  },
  {
    "file_name": "24.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/24.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 시계열분석및실습(Time Series Analysis and Lab) 개설학년 3, 4학년 전공능력 전공능력 대표성 이 과목은 시간이 연관되어 수집된 데이터는 시계열 데이터로 볼 수 있으며, 이 과목에 서는 이러한 시계열 데이터를 분석하는 방법을 학습하는 것을 목적으로 한다. 이동평균 법, 지수평활법, ARIMA모형에 의한 분석법등을 다룬다. 또한 실습을 통하여 시계열 자 료를 분석하는 통계패키지의 사용법을 학습하여 데이터를 다루는 능력 및 분석 능력을 배양한다. 통계적모형화 대표 전공능력 자료처리 연관 전공능력 자료분석 연관 전공능력 프로그래밍 수리 통계윤리 협업 문제해결 글로벌 수업목표 주 수업내용 1 시계열 자료분석 소개 2 추세분석 3 분해법 4 계절조정 5 확률과정 6 ARMA 모형1 7 ARMA 모형2 8 중간시험 24년10월22일 중간시험 9 ARIMA 모형1 10 ARIMA 모형2 11 ARIMA모형의 적합1 12 보강주간 13 ARIMA모형의 적합2 14 Prophet 모형 실습1 15 Prophet 모형 실습2 16 기말시험 23년12월17일 기말시험"
  },
  {
    "file_name": "26.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/26.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 응용확률론(Stochastic Process) 개설학년 2학년 전공능력 전공능력 대표성 이 과목은 확률의 기초이론을 바탕으로 시간의 흐름에 따라 발생하는 여러 확률과정의 이론 및 성질을 소개하는 것을 목적으로 한다. 대표적인 확률과정이론인 마코프 체인 (Markov chain), 포아송과정(Poissoin process), 생사과정(Birth and death process), 재생과정(Renewal process)등을 소개하고 이들의 응용을 다룬다. 마코프 체인과 이의 응용, 그리고 기초적인 Renewal 이론과 큐잉이론을 소개한다. 통계적모형화 대표 전공능력 수리 연관 전공능력 프로그래밍 통계윤리 협업 문제해결 자료처리 자료분석 글로벌 수업목표 주 수업내용 주 수업내용 13 마코프사슬 필기 강의노트 확률의개념및 응용 전종우,손건태 자유아카데미 14 포아송과정 필기 강의노트 확률의개념및 응용 전종우,손건태 자유아카데미 15 포아송과정 필기 강의노트 확률의개념및 응용 전종우,손건태 자유아카데미 16 기말고사 필기 강의노트 확률의개념및 응용 전종우,손건태 자유아카데미"
  },
  {
    "file_name": "27.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/27.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 수리통계학 I(Mathematical Statistics I) 개설학년 2학년 전공능력 전공능력 대표성 이 과목은 본 과목은 추리적인 측면을 중점적으로 다루며, 확률변수가 이루는 다양한 분포이론과 중심극한정리를 바탕으로 하는 정규이론 및 최대우도 추정법을 다루는 것 을 목적으로 한다. 그리고 통계학의 중심 분야인 가설검정문제를 정규모형 하에서 모평 균의 검정을 중심으로 다룬다. 통계적모형화 대표 전공능력 수리 연관 전공능력 프로그래밍 통계윤리 협업 문제해결 자료처리 자료분석 글로벌 수업목표 주 수업내용 1 2장 확률변수 및 그의 분포 part 1 - 확률밀도함수, 확률분포함수 - 결합분포 - 기대값 강의 2장 - 2.2, 2.3, 2.4 장 HW1 2 2장 확률변수 및 그의 분포 part 2 - 이산형 확률분포 - 연속형 확률분포 강의 2장 - 2.5,2.6장 HW2 3 2장 확률변수 및 그의 분포 part 3 - 확률변수의 함수 강의 2장 - 2.7장 HW3 4 2장 확률변수 및 그의 분포 part 4 - 적률생성함수 강의 2장 - 2.8 5 3. 표본분포 part1 - 모집단과 표본 - 중심극한정리 - 정규분포로부터 표본추출 강의 3장 - 3.1, 3.2장 6 3. 표본분포 part 2 - 정규분포로부터 표본추출 - t, F분포 강의 3장 - 3.2장 HW4 7 3. 표본분포 part 3 -순서통계량 4장. 추정이론 part 1 - 추정의 방법 : MM추정 강의 3장 - 3.3장, 4.1장 HW5 8 4장 추정이론 part 2 - 추정의 방법 - ML추정 중간고사 강의 / 중간고사 4장 - 4.1장 9 4장 추정이론 part 3 - 추정의 방법 - ML추정 계속 강의 4.2장 HW6 10 4장 추정이론 part 4 - 구간추정 part 1 - 구간추정 개념 - 추축변량 이용 강의 4.3장 11 4장 추정이론 part 5 - 구간추정 part 2 - 다양한 모수에 대한 구간추정 퀴즈 2 강의 4.3장 계속 HW7 12 보강주간 13 5장 가설검정 part 2 - 일반화 가능도비 검정 part1 강의 5.1장 HW8 14 5장 가설검정 part 3 - 일반화 가능도비 검정 part2 강의 5.4장 15 보강주간 16 질의 응답 및 기말고사 기말고사"
  },
  {
    "file_name": "6.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/6.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 통계학개론및실습(Introduction to Statistics and Lab) 개설학년 1학년 전공능력 전공능력 대표성 이 과목은 통계학의 기본 개념과 통계학의 여러 분야를 소개하는 것을 목적으로 한다. 기초적인 통계자료 수집 방법과 데이터 처리방법, 그리고 기초적인 데이터 분석 방법을 학습하게 되며, 통계패키지를 이용하여 데이터를 처리하고 분석하는 실습을 병행한 다. 통계적모형화 대표 전공능력 수리 연관 전공능력 프로그래밍 연관 전공능력 통계윤리 협업 문제해결 자료처리 자료분석 글로벌 수업목표 주 수업내용 1 강의소개: 1장 통계학과 빅데이터 강의 기초통계학과 데이터 사이언 스: R 활용(1장) 2 R 기초 강의 및 실습 Do it! 쉽게 배 우는 R 데이터 분석(3-5장) 3 2장. 정형 데이터 분포 측도와 시각화 강의 및 실습 기초통계학과 데이터 사이언 스: R 활용(2장) 과제 1 4 3장. 확률과 변수 강의 및 실습 기초통계학과 데이터 사이언 스: R 활용(3장) 5 3장. 확률과 변수(계속) 강의 및 실습 기초통계학과 데이터 사이언 스: R 활용(3장) 과제 2 6 4장. 모집단과 표본 강의 및 실습 기초통계학과 데이터 사이언 스: R 활용(4장) 7 4장. 모집단과 표본(계속) 강의 및 실습 기초통계학과 데이터 사이언 스: R 활용(4장) 과제 3 8 중간고사 9 5장. 추정 강의 및 실습 기초통계학과 데이터 사이언 스: R 활용(5장) 과제 4 10 6장. 가설검정 강의 및 실습 기초통계학과 데이터 사이언 스: R 활용(6장) 과제 5 11 7장. 두 모집단 비교와 두 변수 관계 강의 및 실습 기초통계학과 데이터 사이언 스: R 활용(7장) 과제 6 12 보강주간 13 8장. 회귀분석 강의 및 실습 기초통계학과 데이터 사이언 스: R 활용(8장) 14 8장. 회귀분석(계속) 강의 및 실습 기초통계학과 데이터 사이언 스: R 활용(8장) 과제 7 15 베이지안 통계학 소개 강의 및 실습 강의 자료 16 기말고사"
  },
  {
    "file_name": "7.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/7.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 행렬과대수 I(Matrix Algebra I) 개설학년 2학년 전공능력 전공능력 대표성 이 과목은 행렬대수의 개념과 기법을 소개하고 통계적 응용 방법을 소개하는 것을 목적 으로 한다. 통계 데이터는 대부분 행렬의 형태로 표현할 수 있고, 통계 계산 알고리즘은 행렬을 이용하여 이루어지기 때문이다. 벡터의 독립과 종속, 행렬식, 역행렬, 행렬의 차수 등을 다룬다. 수리 대표 전공능력 프로그래밍 통계적모형화 통계윤리 협업 문제해결 자료처리 자료분석 글로벌 수업목표 주 수업내용 주 수업내용 16 복습 및 기말고사 통계학을 위한 행렬대수학"
  },
  {
    "file_name": "5.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/5.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 데이터시각화(Data visualization) 개설학년 3, 4학년 전공능력 전공능력 대표성 본 교과목은 인공지능 분야에서 활용되는 데이터 정보의 축약 및 시각화 방법론을 배운 다. 테이블 (정형) 데이터, 이미지, 소리, 텍스트 데이터를 처리하고 데이터에 포함된 정 보를 추출하는 과정에 대한 이론 및 R/Python을 이용한 처리기술들을 학습한다. 주요 학습 내용은 1) 데이터가 가진 정보를 축약하는 방법으로는서 전통적인 방법인 기초통 계량의 생산, 2)고차원 구조를 가지는 이미지, 소리, 텍스트의 차원축소방법을 통한 요 약통계량을 계산하고, 결과를 시각화 3) 시각화 자료의 웹퍼블리싱 4) 민간 클라우드 (AWS)를 이용한 서비스 구현을 포함한다. 자료처리 대표 전공능력 자료분석 연관 전공능력 프로그래밍 통계적모형화 수리 통계윤리 협업 문제해결 글로벌 수업목표 주 수업내용 1 강의소개 데이터 시각화 개요 강의 2 파이쎤 리뷰 판다스 리뷰 데이터셋 소개 강의 3 시각화 기초 이론: Scale, Amount & Distributions 강의 4 시각화 기초 이론: Proportions & Nested proportions 시각화 라이브러리 활용: Matplotlib overview 강의 5 시각화 기초 이론: Associations 시각화 라이브러리 활용: Matplotlib component (Axes, Tick, Grid, Spline) 강의 6 시각화 기초 이론: Time series & Trends 시각화 라이브러리 활용: Matplotlib component (Text, Colors) 강의 7 시각화 기초 이론: 그래프 디자인의 기본 원칙 시각화 프로젝트: 데이터 시각화 프로젝트 개요 및 계획 강의 8 중간고사 시험 9 시각화 기초 이론: Geospatial data 시각화 라이브러리 활용: Matplotlib plotting (Line plot & Scatter plot) 강의 실습 10 시각화 기초 이론: Text data 시각화 라이브러리 활용: Matplotlib plotting (Bar plot, Histogram, Box plot & Pie plot) 강의 실습 11 시각화 라이브러리 활용: Seaborn overview 시각화 라이브러리 활용: Seaborn plotting with various themes 강의 실습 12 Supplimentary lecture 13 시각화 라이브러리 활용: Seaborn usecases 시각화 라이브러리 활용: Tableau overview 강의 실습 14 시각화 라이브러리 활용: Tableau usecases 강의 실습 15 프로젝트 발표 발표 16 프로젝트 발표 발표"
  },
  {
    "file_name": "4.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/4.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 실험계획(Design of experiments) 개설학년 3, 4학년 전공능력 전공능력 대표성 실험이나 연구에서 자료를 추출하는 경우 유효한 추론을 위하여 적용되는 실험계획의 기본 개념과 다양한 자료 수집 방법을 학습한다. 더 나아가 주어진 실험계획에 따라 얻 어진 자료를 합리적으로 분석할 수 있는 통계적 모형들의 구조와 추정 방법을 학습한 다. 주요 강의 내용은 임의화, 요인배치, 블록 등과 같은 전통적인 기본 개념들과 이에 따른 다원배치 계획법 등 기본적이고 전통적인 방법들을 먼저 다루고, 반응표면 분석과 같은 고급 계획법과 회귀모형 기반 분석법을 다룬다. 더 나아가 임상실험에서 사용되 는 주요 임상계획법과 다중비교 등 관련된 분석 방법을 학습한다. 통계적모형화 대표 전공능력 자료분석 연관 전공능력 프로그래밍 수리 통계윤리 협업 문제해결 자료처리 글로벌"
  },
  {
    "file_name": "1.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/1.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 데이터엔지니어링기초(Introduction to Data Engineering) 개설학년 2학년 전공능력 전공능력 대표성 본 과목은 데이터를 다루는 프로그래밍을 위한 기초 이론을 비롯한 응용 도구에 대해서 배우고, 통계학 분야에서 필요한 프로그래밍의 실용 능력을 증진하는데 목적이 있다. 구체적인 학습 내용은 프로그래밍 언어, 데이터 구조, 알고리즘, 소프트웨어 공학 등에 서 다루는 주요 이론을 포함한다. 관련 이론에 대한 강의 위주의 수업을 진행하며, 필요 할 경우 프로그래밍을 위한 실습과 과제가 포함될 수 있다. 자료분석 대표 전공능력 프로그래밍 연관 전공능력 통계적모형화 수리 통계윤리 협업 문제해결 자료처리 글로벌 수업목표 주 수업내용 1 강의 소개 데이터 엔지니어링 개요 2 알고리즘의 설계와 계산 복잡도 3 정렬 및 탐색 리눅스 기초 및 쉘 스크립트 4 배열 및 리스트 문서 편집기 (Vim, Colab) 5 배열 및 리스트 6 스택 및 큐 파이썬 리뷰 7 스택 및 큐 Git & Github 8 중간고사 9 트리 및 그래프 Docker 10 트리 및 그래프 해시 테이블 11 탐색 알고리즘 12 보강주간 13 탐색 알고리즘 14 재귀 및 분할 정복 15 동적 프로그래밍 16 기말고사"
  },
  {
    "file_name": "3.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/3.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 딥러닝(Deep Learning) 개설학년 3, 4학년 전공능력 전공능력 대표성 본 과목의 목표는 딥러닝과 관련된 제반 이론을 학습하고, 다양한 데이터를 가지고 Python 언어로 딥러닝 과정을 프로그래밍을 수행할 수 있는 실무 능력을 함양하는 것 이다. 구체적인 학습내용은 Python 문법 체계, 데이터 수집 및 가공 기법, 전반적인 기 계학습 이론, 전통적 인공신경망, Fully-connected Neural Network, Convolutional Neural Network, Recurrent Neural Network 등을 포함한다. 자료분석 대표 전공능력 문제해결 연관 전공능력 프로그래밍 통계적모형화 수리 통계윤리 협업 자료처리 글로벌 수업목표 주 수업내용 1 Course Orientation and Introduction to AI, ML, DL 2 Python basics and PyTorch 3 Linear Regression and Logistic Regression 4 Neural Networks and Backpropagation 5 Optimization and Regularization 6 Convolutional Neural Networks 7 Recurrent Neural Networks and Long-Short Term Memories 8 Midterm Exam 9 Special Topics on CNN (1) - Adversarial Attack and Adversarial Training 10 Special Topics for CNN (2) - Object Detection and Semantic Segmentation 11 Special Topics on RNN - Seq2Seq, Attention and Transformer 12 보강주간 13 Semi-Supervised Learning 14 Self-Supervised Learning 15 Recent Issues in Deep Learning 16 Final Report Submission"
  },
  {
    "file_name": "2.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_통계학과/2.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 회귀분석I(Regression Analysis I) 개설학년 3, 4학년 전공능력 전공능력 대표성 회귀분석은 하나의 관심변수와 여러 개 설명변수 간의 관계를 회귀모형을 통하여 규명 하는 통계분석기법이다. 이 과목에서는 선형관계를 규명하는 방법을 학습한다. 설명변 수가 하나인 단순회귀분석과 설명변수가 여러 개인 중회귀분석으로 구분하여 각각에 대하여 최소제곱법과 분산분석법을 학습한다. 회귀모형에 부여된 모형 가정이 적절한 지 검증하는 방법을 학습하고 데이터 분석을 통하여 이를 판단하는 방법을 배운다. 또 한 중회귀분석에서 회귀모형에 적합한 설명변수를 선택하는 모형선택법을 학습한다. 본 교과목은 이론 강의와 더불어 SAS, R과 같은 통계패키지를 이용한 데이터 분석을 병 행한다. 중회귀분석은 행렬대수 이론이 필수적이므로 행렬대수 이론의 선행 이수를 권 장한다. 통계적모형화 대표 전공능력 자료분석 연관 전공능력 프로그래밍 수리 통계윤리 협업 문제해결 자료처리 글로벌 수업목표 주 수업내용 1 강의소개 강의 및 토론 2 단순회귀분석 강의 및 토론 주교재3장 3 단순회귀분석 강의 및 토론 주교재3장 4 단순회귀분석에 관한 추론 강의 및 토론 주교재4장 5 단순회귀분석에 관한 추론 강의 및 토론 주교재4장 6 회귀분석 기타논제 강의 및 토론 주교재5장 7 행렬의 기초이론 강의 및 토론 주교재1장 8 중간시험 9 기초적 중회귀분석 강의 및 토론 주교재6장 10 추정과 가설검정 I 강의 및 토론 주교재7장 11 추정과 가설검정 II 강의 및 토론 주교재8장 12 보강주간 13 다항회귀 강의 및 토론 주교재9장 14 회귀진단 강의 및 토론 주교재10장 15 변수의 선택 강의 및 토론 주교재11장 16 기말시험"
  },
  {
    "file_name": "9.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/9.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 중국근세문학사 학과/학년 중어중문 3 수업목표 고대 중국의 문학은 시, 산문 등의 雅문학이 주류를 이루어왔으나 당·송시기에 최고봉의 수준에 도달한 이후 雅문학은 다시 그 번영을 회복할 수 없었다. 반면 희곡, 소설 등의 통속문학은 크게 발전하며 중국 문학사상 새로운 국면으로 전환되었다. 한 편, 시와 산문 창작 자체는 쇠퇴하였으 나, 문학 전반에 대한 비평과 이론은 오히려 발전하였으며 특히 청대에 크게 번성하였다. 본 강의는 이러한 중국 근세 문학사의 전반적인 큰 흐 름을 당시 시대적 배경, 사상적 배경의 맥락 하에서 이해하고, 이러한 기초 위에 시, 산문, 소설, 희곡, 문학 비평 등의 분야로 세분화 하여 각각 의 변천 과정을 상세히 알아가는 것을 목표로 한다. 또한 구체적인 대표작품을 접하고 감상하면서 작가, 작품 내용, 작품 특징을 구체적으로 파 악할 수 있도록 한다. 더 나아가 원·명·청 시기의 문학이 우리의 현 시대와 격리된 고대의 유물이 아니라 현재를 살아가는 우리에게도 중요한 시 사점을 주고 다양한 작품으로 재해석 및 재탄생되어 이 시대에도 생동하고 있는 문학임을 발견하는 것을 목표로 한다.DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 25% 25% 20% 15% 0% 15% 0% 0% 평가참고사항 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ 기타 : - 과제 √ 수업방식별시간 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 1주 오리엔테이션 강의 목표, 강의 방식, 강의 내용 등 강의 전반 소개. 과제 및 평가방식 소 개. 강의 2주 중국 고대, 중세, 근세 문학사의 전반 개괄 중국근세문학사를 학습하기에 앞서, 선 진시기로부터 진한, 위진남북조, 당, 송 시기의 문학 변천에 대하여 이해하 고 중국 문학의 전반적 특징을 이해한 다. 이를 통해 근세문학사를 더욱 깊이 이해할 수 있는 토대를 마련한다. 강의 3주 원대의 시대적 배경 및 원대 문학의 특징 원대의 시대적 배경이 문학에 어떻게 영향을 미쳤는지에 대해 이해한다. 전 체 문학사적 흐름 속에서 원대 문학의 독특한 위치와 의의를 이해한다. 원대 에 발전한 문학 체제와 문학 특징을 이 해한다. 강의 4주 원대 잡극, 산곡 원대의 잡극에 대하여 전반적으로 이해 한다. 원대 전기의 관한경, 왕실보 등 의 잡극을 감상하고 특징을 이해한다. 원대 후기의 잡극 변천 과정을 이해한 다. 원대 산곡의 전, 후기 특징을 비교 이해한다. 강의, 발표, 토론. 5주 명대의 시대적 배경, 사상적 배경 및 명대 문학의 특징 명대의 시대적 배경이 문학에 어떠한 영향을 미쳤는지를 이해한다. 명대의 사상적 배경이 문학에 어떠한 영향을 끼쳤는지를 이해한다. 전체 문학사적 흐름 안에서 명대 문학의 두드러진 특 징을 이해한다. 강의 6주 명대의 시문 창작 및 문학 사조 전후칠자의 복고주의, 공안파의 반복고 및 개성 제창, 공안파와 경릉파의 주 장 간 차이점, 명대 시단의 특징 등에 대해 이해한다. 강의, 발표, 토론. 7주 중간고사 중간고사 . 8주 명대의 소설 삼국연의, 수호전, 서유기, 금병매 등 으로 대표되는 장편 장회소설에 대해 이해한다. 삼언, 이박, 금고기관 등으 로 대표되는 단편 소설에 대해 이해한 다. 구체적 작품을 감상하고 내용과 특 징에 대해서 이해하며 나아가 오늘날의 우리에게 어떠한 시사점을 갖는지 사 고한다. 강의, 발표, 토론. 9주 명대의 희곡, 산곡, 민가 희곡의 변천 과정 및 지역적 특성의 영 향에 대해 이해한다. 전기의 특징에 대 해 이해한다. 곤곡의 특징에 대해 이해 한다. 비파기, 완사기, 환혼기 등 대표 적 작품을 감상하고 구체적 내용과 특 징에 대해 이해한다. 명대 산곡, 민가 의 특징을 이해한다. 강의, 발표, 토론. 10주 청대의 시대적 배경, 사상적 배경 및 청대 문학의 특징 청대의 시대적 배경이 문학에 어떠한 영향을 미쳤는지를 이해한다. 청대의 사상적 배경, 학술적 특징 등이 문학 전반에 어떠한 영향을 끼쳤는지를 이해 한다. 전체 문학사적 흐름 안에서 청대 문학의 두드러진 특징을 이해한다. 강의 11주 청대의 시문 이론 및 문학 사조 청대 시학의 주요 논쟁 중 하나인 종당 , 종송 주장의 구체적 내용을 살펴보고 주요 문인들에 대해 이해한다. 성령시 파 등 문단의 여러 시학 주장에 대해 이해한다. 동성파 등 고문 제창의 구체 적 주장을 살펴보고 특징을 이해한다. 청대의 사 창작에 대해 이해한다. 청대 의 문학 사조 및 주장이 오늘날의 문학 에 주는 시사점에 대해 사고한다. 강의, 발표, 토론. 12주 청대의 희극, 산곡, 민가 청대 희극 대표 작가 및 장생전, 도화 선 등의 대표 작품에 대해 이해하고 감 상한다. 경극의 발전 및 변천 과정에 대해 이해한다. 청대 산곡, 민가의 특 징을 이해한다. 강의, 발표, 토론. 13주 청대의 소설 문언 단편 소설, 통속 장편 소설 등 다 양한 청대 소설의 흥성과 발전에 대해 이해한다. 홍루몽, 유림외사, 아녀영웅 전 등 대표적 소설을 감상하고 구체적 내용과 특징을 이해하며 나아가 오늘날 의 우리에게 주는 시사점에 대해 사고 한다. 강의, 발표, 토론. 14주 강의 내용 전반에 대한 종합 정리 및 중국 근세문학사의 시사점 토론 중국근세문학사의 전반 특징 및 원대, 명대, 청대 각각의 특징에 대해 정리한 다. 한 학기 강의 내용에서 인상적이었 던 점, 오늘날의 우리가 가져야 할 문 제의식 및 더욱 깊이 사고해야 할 문제 등에 대해서 종합적으로 토론한다. 강의, 발표, 토론. 15주 기말고사 기말고사 ."
  },
  {
    "file_name": "8.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/8.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 고급중국어회화 학과/학년 중어중문 3 수업목표 本課程授課對象爲具有漢語中級水平以上的韓國學生。 爲增進學生多種技能（溝通協商、創意思考、實務實踐、道德實踐）的協調發展，本課程採取聽說倂重，分組討論的上課方式。 課程主要方向將放在： 1、激發學生創意性思考，培養群體協商能力、擴展深化對中國社會文化的認識。 2、改正學生漢語表達的常見問題點，如邏輯不淸楚、結構不合理、層次不分明、前後部照應、詞彙不準確等。 DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 35% 35% 10% 10% 0% 10% 0% 0% 평가참고사항 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ 기타 : - 과제 수업방식별시간 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 1주 •OT(오리엔테이션) 강의 소개 강의, 발표 병행 2주 • 중국인의 언어 습관을 설명할 수 있다. • 어떤 상황이나 환경에서의 주의점을 자신 의 경험에 근거해 말할 수 있다. 01 想听听我的忠告? 강의, 발표 병행 3주 • 자신의 운동습관과 방법을 소개할 수 있다 . • 중국인들의 여러 가지 야외활동에 대해 말 할 수 있따. 02 我想中功夫。 강의, 발표 병행간 수업 4주 • 중국 택시 기사의 직업적 특징을 말할 수 있다. • 중국과 우리나라의 택시 승차 문화를 비교 할 수 있다. 03 我喜和司机聊天。 강의, 발표 병행 5주 • 취업과 창업에 대한 생각을 말할 수 있다. • 중국과 우리나라의 식사 후 계산 문화를 비교하여 말할 수 있다. 04. 今天我客。 강의, 발표 병행 6주 • 자신의 관심분야 도서에 대해 말할 수 있 다. •자신이 가장 감명 깊게 읽은 도서를 소개할 수 있다. 05 是一享受。 강의, 발표 병행 7주 •축구장에 가 본 경험과 축구 경기를 해 본 경험을 말할 수 있다. 06 我小就喜看足球。 강의, 발표 병행 8주 •중간 시험 시험 시험 9주 •여가 시간을 활용하는 방법에 대해 말할 수 있다. 07 每人有每人的好。 강의, 발표 병행 과제 내주기(자유주 제로 600-1000자 이 내 작문) 10주 • 가장 즐겨 보는 프로그램을 소개할 수 있 다. • 다양한 채널 서비스의 장단점을 말할 수 있다. 08 再多,也只有一眼睛。 강의, 발표 병행 11주 • 동양인과 서양인의 식습관을 비교해서 말 할 수 있다. •식습관이 체중에 미치는 영향에 대해 말할 수 있다. 09 早吃好,午吃,吃少。 강의, 발표 병행 12주 • 장소에 맞는 의상 코디법에 대해 말할 수 있다. • 옷을 구매할 때 가장 중시하는 것은 무엇 인지 말할 수 있다. 10 穿上旗袍是挺漂亮的。 강의, 발표 병행 13주 • 자신의 연애관과 결혼관에 대해 말할 수 있다. 11 漂亮不漂亮不是最重要的。 강의, 발표 병행 14주 • 병의 증상에 대해 말할 수 있다. • 병원 이용과 관련된 여러 가지 표현을 말 할 수 있다. 我今天身体不舒服。 강의, 발표 병행 과제 제출 15주 •기말시험 시험 시험"
  },
  {
    "file_name": "16.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/16.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 중국어실용문 학과/학년 중어중문 4 수업목표 중국어 실용문이란, 일상생활에서 사용하는 일정한 격식을 갖춘 문장이다. 본 강의 목표는 다양한 상황에서 사용하는 문장의 격식을 익혀 실생 활에 적용할 수 있는 작문 실력 배양이다. 구체적 목표는 다음과 같다. 첫째, 각 상황에 맞는 격식의 문장의 특징과 각 문장의 특성 파악 둘째, 각 격식 문장의 모범 양식 문장 쓰기 셋째, 정확한 상용 구문과 서면어 구사DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 10% 20% 20% 20% 0% 20% 0% 10% 평가참고사항 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ √ 기타 : - 과제 √ 수업방식별시간 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 1주 오리엔테이션 강의 목표, 내용, 평가 방법 소개. 문 법 대강, 문장 부호, 원고 사용법 강의 자기 소개 2주 제1과 이력서 자신이 원하는 회사나 대학원 입학 원 서 쓰기 발표, 강의 과제 3주 제2과 구직서 자기소개서 발표, 강의 과제 4주 제3과 휴대전화 메시지 비즈니스, 알림, 안부, 축하, 약속 발표, 강의 과제 5주 제4과 메일 비즈니스 메일 쓰기 (업무 협약) 발표, 강의 과제 6주 제4과 메일 비즈니스 메일 쓰기 (상품 주문) 발표, 강의 과제 7주 제5과 메모 휴가서, 메모, 위탁서, 건의서 발표, 강의 과제 8주 중간고사 중간 평가 - - 9주 제6과 알림·통지 개업, 초빙, 감사, 유실물, 오류 정정 회의 통지, 특강 통지, 시험 통지 발표, 강의 과제 10주 제7과 초청문 박람회 초청장 사교 모임 초청장 기념행사 초청장 실용 중국어와 작문 발표, 강의 과제 11주 제8과 환영사 업무 협약 환영사 기념 모임 환영사 발표, 강의 과제 12주 제9과 환송사 업무 협약 환송사 폐막식 환송사 발표, 강의 과제 13주 제10과 축하문 승진 축하 창립 축하 졸업 축하 발표, 강의 과제 14주 제11과 감사문 제12과 사과문 협력업체 감사 편지 초청 연회 불참에 대한 사과문 예정한 공급 물량과 납기일 대한 사과 문 발표, 강의 과제 15주 기말고사 발표 - -"
  },
  {
    "file_name": "17.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/17.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 중국현대작품감상 학과/학년 중어중문 4 수업목표 중국현대작품감상 강좌은 중국현대문학사 가운데 가장 널리 알려진 작품들을 선정하여 이를 감상하고 이해하는 과목이다. 이를 통해 중국의 역 사와 문화, 오늘의 중국과 미래의 중국을 진단하는 주요한 첩경이 될 것이다. 소설과 시, 그리고 산문 가운데 비교적 대중적 호응를 받았던 작품 을 주제별로 다양성을 고려하여 작품을 선정하였다. 필요할 경우 번역서도 병행하여 이해의 폭을 넗이고자 한다. 오늘의 중국이 있기까지 중 국에는 어떤 문학과 사고와 삶들이 깃들어 있는지 본 강좌를 통해 정서적으로 다가서고자 한다. DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 20% 20% 20% 20% 0% 20% 0% 0% 평가참고사항 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ √ 기타 : - 과제 * 장애학생 교수학습지원 사항 - 평가 √ 기타 : 참고 사항 강의 파일, 자료 등 제공 좌석배치(지정좌석) 조정 과제 제출기한 연장 대안적 과제 제시 시험시간 연장 별도의 시험 장소 제공 평가방법 조정(대독, 구두응답, 도우미 대필 답안작성 등) ※ 위 지원사항 등을 포함한 강의, 과제, 시험 등 학습과정에서 장애로 인하여 추가 지원이 필요한 경우 개강전 담당강사 및 장애학습 지원센터를 통해 문의 바랍니다. 그 외(필요시 자유로이 추가 기술) : 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 1주 중국현대문학사의 전반적 흐름을 이해한다. 그 가운데 주요 작가와 작품이 어떤 것들이 있는지 시대적 흐름 속에서 살펴본다. 중국현대문학의 범주, 시기적 변화를 파악한다. 자료 탐독 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 2주 중국문학 속의 '사랑': 인간의 감정 중에서 가장 강렬한 감정은 아마도 사랑일 것이다. 따라서 사랑은 영원한 문학의 주제다. 중국 현대문학에서 불멸의 사랑 이야기를 알아보 자. (1) 종교적 정신으로 사랑을 묘사한 시 무룽의 애정시를 알아본다. 시무룽(席慕蓉)의 시 <一開花的樹> , <渡口>,<蓮的心事>을 감상한다. 몸골 족인 席慕蓉은 시인이자 유명한 화가이 기도 한다, 따라서 그의 시를 읽으면 한 폭의 그림을 보는 것과 같다. 시인 이 그려낸 사랑의 세계를 감상해본다. 자료 탐독 및 토론 3주 중국문학 속의 '사랑':(2) <사하라 이야기> 로 한국에서 알려진 수필작가 싼마오(三毛) 의 애정시를 알아본다. 시인이자 수필 작가인 싼마오(三毛) 의 대표작 <橄欖樹>,<夢田>,<如果有來生> 등 시를 감상하며 시인의 삻과 사랑 이 야기를 파악한다. 자료 탐독 및 토론 4주 중국문학 속의 '사랑': (3) <다시 캠브리지 를 떠나며>로 유명세를 타 현재가지 전세계 독자의 사랑을 받고 있는 시인 서지마(徐志 摩)의 시와 시인의 사랑 이야기를 알아본다. <再別康橋><偶然> 등 시인의 대표작을 통해 그가 주장한 시의 삼미-건축미, 음악미와 회화미를 이해한다. 도한 그 가 장유의,임휘인육소만 3여인의 사랑 이야기를 알아본다. 자료 탐독 및 토론 5주 중국문학 속의 '사랑': (4)중국 최초로 노벨 문학상 최종 후보자로 선전된 심종문(沈從文 )의 소설 속에 소녀 소소의 삷을 통해 그가 그려낸 '향토중국'의 의미를 알아본다. 심종문의 소설<蕭蕭>를 감상한다. 이들 작품에서 당시 묘족들의 생활 상과 도 시를 중심으로 형성하고 있는 현대도시 문화와 신여성 형상을 대비 구도로 보 여주고 있다. 자료 탐독 및 토론 6주 중국문학 속의 '사랑': (4)중국 최초로 노벨 문학상 최종 후보자로 선전된 심종문 소설 속에 소녀 소소의 삷을 통해 그가 그려낸 ' 향토중국'의 의미를 알아본다. 영상물을 통해 심종문의 '湘西世界'의 의미를 파악한다. 자료 탐독 및 토론 7주 중국문학 속의 '사랑': (5) 이안 감독이 장 애령의 동명 소설로 제작한 <색계>로 한국 에서 유명세를 탄 장애령(張愛玲)의 문학세 계를 알아본다. <색,계>는 20세기 40년대에 일본 앞잡 이를 암살하기 위해 몸을 기꺼이 내던 지는 한 여대생의 이야기를 묘사하고 있다. 작품에서 중국 현대사의 아픈 역 사와 작가 장애령의 슬픈 개인 애정스 토리를 빼곡하게 들어차 있었다. 세계 유명 감독인 이안에 의해 동명 영화로 전세계 사람의 주목 받기도 하였다. 자료 탐독 및 토론 8주 중간 시험 필기 시험 시험 9주 중국문학 작품 속의 '향수'(愁): 余光中의 시<郵票><愁四韻>, 席慕蓉 의 시 <愁>,洛夫의 <邊界望> 蕭乾 의 <棗核>을 통해 중국문인들이 고향에 대한 감정을 파악한다.또한 중국의 근 현대사의 주요 사건에 대해 알아본다. 자료 탐독 및 토론 10주 중국문학 작품 속의 '가족 사랑'-(1) 파금의 수필<소산을 그리워하며>와 주 자청의 <아버지의 뒷모습>을 감상하며 작가들의 가족 사랑을 알아본다. 자료 탐독 및 토론 11주 중국문학 작품 속의 '가족 사랑'-(2) 샤오사의 <웨량의 사랑>,<내 아들 한생 >을 감상하며 가족의 의미를 탐색한다. 자료 탐독 및 토론 12주 중국문학 작품 속의 ' 자아 각성': 해외 화 인 작가 옌거링의 작품 세계를 알아본다 북미 화인 문학의 대표작가인 嚴歌苓의 대표작 <少女小漁》를 감상한다. 90년 대 중국 개혁개방 후 중국의 젋은 사람 들이 이민 혹은 유학의 목적으로 해외 로 많이 나간다. 이 작품은 소녀 소어 는 자신과 남자 친구의 미국 거류 비자 를 얻기 위해 미국의 70대 노인과 가짜 결혼하는 이야기를 통해 인간의 복잡 한 심리를 여과없이 묘사한 다소 파격 적인 소설로 평가된다. 이를 통해 미국 에서 불법 신분으로 살아간 중국 청년 들의 고민을 들여다본다. 자료 탐독 및 토론 13주 중국문학작품 속의 '바다 문화':해양민족 다 우족 작가 샤만 란보안의 작품 세계를 알아 본다 샤만 란보안의 수필<바다 순례자>에서 묘사된 해양민족의 사유방식과 문화, 그리고 독특한 서사 기교를 파악한다. 자료 탐독 및 토론 14주 중국문학 작품 속의 '반성 의식' 루쉰의 <죽음을 슬퍼하며>(傷逝)을 통 해 중국의 여성문제의 일면을 알아본 다. 자료 탐독 및 토론 15주 발표 및 기말보고서 발표 보고서 제출"
  },
  {
    "file_name": "15.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/15.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 중국문화와예술 학과/학년 중어중문 4 수업목표 세계에서 중국의 위상은 긍정적이든 부정적이든 무시할 수 없는 위치에 있다. 한 나라의 문화와 예술에 관심을 기울이는 것은 그 나라의 언어를 빠르게 습득하는 데 매우 효과적이다. 중국은 오랫동안 국빈들에게 서예작품을 선물하여 자국문화의 우수성을 선전하거나, 서예작품에 담긴 내 용으로 외교적 의미를 전달하는 등 예술품으로 중국 문화의 우수성을 알려왔다. 이에 본 과목은 중국인들의 삶 속에 면면히 흐르는 중국인들의 문화와 예술에 대한 특성을 찾아가보고자 한다. DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 30% 30% 10% 10% 0% 10% 10% 0% 평가참고사항 과제물 점수는 상황에 따라 다른 평가로 대체될 수 있음. 발표/토론은 첫시간에 논의 후 개인발표 또는 그룹발표 여부를 정하기로 함. 기타 5점은 실기(체험)수업 점수임. 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ √ 기타 : - 과제 √ 수업방식별시간 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 1주 한 학기 동안 진행할 <중국문화와 예술>의 수업 방향과 목표에 대한 이해를 높인다. 과목의 성격 안내, 교재 및 참고자료 안내, 수업 방식 안내, 평가방법 안내. 발표수업의 형식 논의 대면수업 원칙. ppt 를 이용한 강의 및 발표 2주 차 한잔 하실까요? 중국어를 배울 때 가장 먼저 접하는 문 화는 중국의 '차'다. 중국인은 왜 차를 즐겨 마시게 되었는지, 차 종류에는 어떠한 것들이 있는지를 살펴본다. 대면수업 원칙. ppt 를 이용한 강의 및 발표 상황에 따라 종류별 차를 맛볼 수도 있 음. 3주 차와 다기(도자기) 중국 경덕진은 세계적으로 유명한 도자 기 생산지이다. 광활한 대지에서 생산 되는 다양한 도자기예술을 살펴본다. 대면수업 원칙. ppt 를 이용한 강의 및 발표 4주 차와 관련된 역사 문화 예술 차와 관련된 중국 역사 속 이야기와 회 화 작품, 서예작품에 담긴 차 문화를 살펴본다. 대면수업 원칙. ppt 를 이용한 강의 및 발표 5주 중국인과 중국 풍속에 대한 탐구1 - 중국과 민족 발표수업-중국인의 의복과 주거문화를 통한 중국인의 문화탐구 대면수업 원칙. ppt 를 이용한 강의 및 발표 6주 중국인과 중국 풍속에 대한 탐구2- 풍속 발표수업- 중국의 음식문화, 대면수업 원칙. ppt 를 이용한 강의 및 발표 7주 중국 현대 문화와 예술의 변환점 발표수업-1. 중화인민공화국의 건국 과 정, 2. 문화대혁명, 3. 등소평과 개혁 개방, 4. 천안문사건 등 위 네가지 사 건이 중국문화예술에 미친 영향 대면수업 원칙. ppt 를 이용한 강의 및 발표 8주 중간고사 중간고사 대면시험 9주 중국의 종교와 사상 종교와 사상은 문화와 예술을 관통하는 핵심 요소이다. 좀 더 깊이 있는 문화 예술의 단계로 들어가기에 앞서 중국의 종교와 사상에 대해 간략히 살펴본다. 대면수업 원칙. ppt 를 이용한 강의 및 발표 10주 유가, 불가, 도가의 예술정신 유가, 불가, 도가는 중국 예술을 이끄 는 중요 사상이다. 이들 사상이 주장하 는 예술 정신을 살펴본다. 대면수업 원칙. ppt 를 이용한 강의 및 발표 11주 중국의 회화 중국의 회화, 문인화는 중국인의 역사 와 사유세계를 확인할 수 있는 주요 예 술세계이다. 송, 원, 명, 청대 작품들 을 선별하여 감상하고, 때로는 그 작품 에 남겨진 시문도 살펴보기로 한다. 대면수업 원칙. ppt 를 이용한 강의 및 발표 12주 중국의 회화 중국의 회화, 문인화는 중국인의 역사 와 사유세계를 확인할 수 있는 주요 예 술세계이다. 송, 원, 명, 청대 작품들 을 선별하여 감상하고, 때로는 그 작품 에 남겨진 시문도 살펴보기로 한다. 대면수업 원칙. ppt 를 이용한 강의 및 발표 13주 중국의 서법(서예) 중국인들은 인문학의 정수를 서법문화 라고 여긴다. 왕희지, 안진경, 황정견, 조맹부 등 대표적인 서법가들의 작품 을 통해 서예문화를 이해해 본다. 대면수업 원칙. ppt 를 이용한 강의 및 발표 14주 붓으로 만나는 나만의 예술세계 제공하는 캘리그라피용 붓펜을 활용하 여, 나만의 작품을 꾸며 본다. 문구는 자유. 대면수업 원칙. ppt 를 이용한 강의 및 발표, 서예 체험 도구 제공 15주 기말고사 기말고사 대면시험"
  },
  {
    "file_name": "14.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/14.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 시경과초사감상 학과/학년 중어중문 4 수업목표 중국운문학사에서 북방 문학을 대표하는 시가총집인 시경과 남방 문학을 대표하는 초사에 대하여 작품의 종류, 내용, 형식 등 전반적인 특성을 살피고 대표적인 작품을 강독하고 감상한다.DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 35% 35% 10% 10% 0% 10% 0% 0% 평가참고사항 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ 기타 : - 과제 수업방식별시간 1주 수업 및 교재 소개, 수업 및 교재 소개, 강의, 발표 수업자료 배포 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 2주 시경과 초사의 발생 및 특징 시경과 초사의 발생 및 특징 강의, 발표 수업자료 배포 3주 시경과 초사의 판본 및 종류 시경과 초사의 판본 및 종류 강의, 발표 수업자료 배포 4주 주남 5편 강독 및 감상 주남 5편 강독 및 감상 강의, 발표 수업자료 배포 5주 주남 6편 강독 및 감상 주남 6편 강독 및 감상 강의, 발표 수업자료 배포 6주 소남 7편 강독 및 감상 소남 7편 강독 및 감상 강의, 발표 수업자료 배포 7주 소남 7편 강독 및 감상 소남 7편 강독 및 감상 강의, 발표 수업자료 배포 8주 중간고사 중간고사 시험 수업자료 배포 9주 패풍 강독 및 감상 패풍 강독 및 감상 강의, 발표 수업자료 배포 10주 용풍 강독 및 감상 용풍 강독 및 감상 강의, 발표 수업자료 배포 11주 위풍, 왕풍, 정풍 강독 및 감상 위풍, 왕풍, 정풍 강독 및 감상 강의, 발표 수업자료 배포 12주 제풍, 위풍, 당풍 강독 및 감상 제풍, 위풍, 당풍 강독 및 감상 강의, 발표 수업자료 배포 13주 진풍, 빈풍 강독 및 감상 진풍, 빈풍 강독 및 감상 강의, 발표 수업자료 배포 14주 초사 이소 강독 및 감상 초사 이소 강독 및 감상 강의, 발표 수업자료 배포 15주 기말고사 기말고사 시험"
  },
  {
    "file_name": "10.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/10.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 중국도시와인간 학과/학년 중어중문 3 수업목표 개혁개방 이후 중국은 ‘세계의 공장’, ‘세계의 시장’을 거쳐 ‘G2’로 성장하고 있다. 이 과정에서 중국의 ‘도시’는 중요한 성장 엔진의 역할을 했으 며, 최근 형성되고 있는 ‘도시군’은 21세기 중국의 국가전략적 거점 역할을 하고 있다. 현대 중국의 성장과 발전을 이해하는 데에 있어 ‘도시’는 빼놓을 수 없는 요소이다. 본 수업은 (본 학기의) 주제에 맞는 구체적인 중국 도시를 선정해, 그 도시의 역사적 발전, 자연지리 자원, 지정학적 특 성, 경제와 산업의 발전, 현재의 사회경제적 상황, 그리고 사람들 등 다양한 분야의 데이터를 수집함으로써 그 도시에 대한 큰 그림을 그리는 것 을 목표로 한다. DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 0% 30% 10% 0% 0% 50% 10% 0% 평가참고사항 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ √ 기타 : - 과제 수업방식별시간 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 1주 도시의 발전에 기반한 중국의 개혁개방에 대 해 이해하기 • 오리엔테이션(강의계획서 설명 및 질 의응답) 프롤로그 “도시로 보는 중국의 개혁개 방(1)” 강의 2주 도시의 발전에 기반한 중국의 개혁개방에 대 해 이해하기 프롤로그 “도시로 보는 중국의 개혁개 방(2)” 및 조별모임 강의 3주 도시의 발전에 기반한 중국의 개혁개방에 대 해 이해하기 “중국의 문화경제지리:동서, 남북, 중 심과 주변” 및 조별모임 강의 4주 중국의 주요 도시에 대해 이해하기_선전 1강 深 최초의 개방도시에서 제4차산 업혁명의 진지로 발표 및 토론 5주 중국의 주요 도시에 대해 이해하기_상하이 2강 上海 현대 중국 금융업의 메카 발표 및 토론 6주 중국의 주요 도시에 대해 이해하기_베이징 중관춘 3강 北京/中村 중국의 실리콘밸리 발표 및 토론 7주 중국의 주요 도시에 대해 이해하기_항저우 4강 杭州 역사 고도에서 정보지능의 기 지로 발표 및 토론 8주 중국의 주요 도시에 대해 이해하기_둥관 5강 莞 ‘세계의 공장’, 제조업 기 지 발표 및 토론 9주 중국의 주요 도시에 대해 이해하기_헤이룽장 7강 黑江 황무지에서 농업생산기지로 발표 및 토론 10주 중국의 주요 도시에 대해 이해하기_베이징 7 98 8강 北京/798 공업과 예술의 만남 발표 및 토론 11주 중국의 주요 도시에 대해 이해하기_진화 9강 金/店 문화산업의 생산기지 발표 및 토론 12주 중국의 주요 도시에 대해 이해하기_장시 징 더전 10강 江西/景德 전통 도자기산업 기 지 발표 및 토론 13주 중국의 주요 도시에 대해 이해하기_시안 11강 西/西安 역사고도에서 관광도시 로 발표 및 토론 14주 중국의 주요 도시에 대해 이해하기_이빈 12강 四川/宜 중국 문화의 저항과 부 활 발표 및 토론 15주 총정리 기말고사 강의 및 토론"
  },
  {
    "file_name": "11.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/11.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 중국어교육론 학과/학년 중어중문 3 수업목표 학생들은 ‘중국어교육연구방법론’ 과목을 수강한 후, 다음과 같은 내용을 이해할 수 있어야 한다. 주제1: [중국어의 개관]에 관련하여: 한국어 VS 중국어의 대비. 주제2: [언어 능력 교수법]과 관련하여: 읽기지도, 말하기지도, 듣기지도, 쓰기지도, 문화지도 주제3: [언어 기능 교수법]과 관련하여: 문법과 어휘 기능, 발음지도, 한자지도 주제4: [제2언어 교수법]과 관련하여: 제2언어교수법 이론 소개DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 10% 10% 20% 20% 0% 20% 0% 20% 평가참고사항 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ √ 기타 : - 과제 √ 수업방식별시간 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 1주 강의 소개 ♡주제 1)안녕하십니까? 2)강의계획서 강의 2주 중국어와 한국어 알기 중국어와 한국어 강의 3주 중국어와 한국어 알기 중국어와 한국어 강의, 발표, 수시시 험 4주 읽기지도 읽기지도 강의, 발표, 수시시 험 5주 말하기지도 말하기지도 강의, 발표, 수시시 험 6주 듣기지도 듣기지도 강의, 발표, 수시시 험 7주 쓰기지도 쓰기지도 강의, 발표, 수시시 험 8주 중간고사 중간고사 중간고사 9주 문법과 어휘지도 문법과 어휘지도 강의, 발표, 수시시 험 10주 문법과 어휘지도 문법과 어휘지도 강의, 발표, 수시시 험 11주 발음지도 발음지도 강의, 발표, 수시시 험 12주 한자지도 한자지도 강의, 발표, 수시시 험 13주 제2언어교수법 제2언어교수법 강의, 발표, 수시시 험 14주 제2언어교수법 제2언어교수법 강의, 발표, 수시시 험 15주 기말고사 기말고사 기말고사"
  },
  {
    "file_name": "13.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/13.pdf",
    "num_pages": 4,
    "content": "학점/시간 이수구분 선수 권장과목 강의반영 비율(%) 회계에 관한 지식 0 재무에 관한 지식 0 시장, 제품 및 소비자에 관한 지식 0 생산 정보 기술경영 0 조직 및 인적자원 관리에 관한 지식 0 글로벌 환경 및 국제경영에 관한 지식 0 의사소통 능력 0 외국어 능력 0 논리적 사고와 분석능력 0 사회에 관한 윤리적 책임 0 경영학 기초지식 0 1단계 2단계 3단계 사회과학 기초지식 0 학습영역에 대한 비율 설명학습 성과 기준 학습 영역 학습 성과 수업 반영 정도 교과목 단계 학습영역 비즈니스 영역 필수 중국어 학습영역에 대한 수준 설명 필수 전문적인 용어 직전 강의평가 반영사항 출결 및 취업 교과목의 개요 주교재 : 卓，尹亨斌, 동양북스, 2018 교재 2 / 4 반영비율 비고평가방법평가내용 ☞ 학기말에 수강 과목에 대한 학생 만족도 설문 실시 강의진행방법 및 활용매체 과제물 관련 지침 수강생 참고사항 15주출석 30 개인 20 개인 및 팀 30 개인 20 0 출석 중간고사 기말고사 report 안전교육 평가 지표 시험관련 세부지침 팀 발표 - 강의 √ 기타 : - 과제 √ * 장애학생 교수학습지원 사항 - 평가 √ √ 기타 : 참고 사항 강의 파일, 자료 등 제공 좌석배치(지정좌석) 조정 과제 제출기한 연장 대안적 과제 제시 시험시간 연장 별도의 시험 장소 제공 평가방법 조정(대독, 구두응답, 도우미 대필 답안작성 등) ※ 위 지원사항 등을 포함한 강의, 과제, 시험 등 학습과정에서 장애로 인하여 추가 지원이 필요한 경우 개강전 담당강사 및 장애학습 지원센터를 통해 문의 바랍니다. 그 외(필요시 자유로이 추가 기술) : 절대평가기준 상대/절대평가 구분 절대평가 상대평가 Ⅱ 비율 (A : A+B : C 이하) 0 : 0 : 0 총비율 (%) 0 수업운영방향 주별 주제 수업방식 각 주제별 시간 주별 강의내용 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 1주 程介 程介 3 2주 신용장 조회와 개설에 관한 내용을 익힌다. 3 3주 결제 방식과 원자재 가격 조율 과정을 배운다. 算 3 4주 비즈니스의 고지와 항의 방법을 배운다. 告知，抗 3 5주 클레임과 분쟁 상황 관련 표현을 익힌다. 索， 3 6주 추가 준문과 제품 출고 날짜 관련 표현을 익힌다. 追加 3 주별 주제 수업방식 각 주제별 시간 주별 강의내용 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 7주 라벨 표준 변경 요청 표현을 익힌다. 更 3 8주 중간시험 期中考 1 9주 새로운 거래 및 제품 구매 및 판매 관련 표현을 익힌다. 推函及回函 3 10주 오퍼 및 가격 협상 표현을 익힌다. 3 11주 매매계약 관련 표현을 익힌다. 合同 3 12주 대리점계약 관련 표현을 익힌다. 代理售合同 3 13주 결제조건에 관한 조율 및 협상 표현을 익힌다. 于品算方式 的判 3 14주 제품품질 문제 발생 관련 표현을 익힌다. 于品量的 判 3 15주 기말시험 期末考 1"
  },
  {
    "file_name": "12.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/12.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 중국현대소설과영화 학과/학년 중어중문 3 수업목표 중국현대소설과 영화에 대한 전반적인 흐름을 먼저 학습한다. 이후로 중국현대소설 가운데 소설을 영화화한 작품들을 중심으로 선별작업을 진 행하고, 이들 작품을 비교적 관점에서 학습한다. 아울러 소설과 영화는 그 시대를 반영하는 것이기에, 작품 감상과 분석을 함에 있어 시대적 배 경을 함께 학습한다. 이를 통해 중국현대사회 및 문화를 이해하고, 오늘의 중국을 진단하며 미래를 예측하는 과정으로 삼는다.DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 35% 35% 10% 10% 0% 10% 0% 0% 평가참고사항 강의 진행상황과 수강생 등의 요인에 따라 조율 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ 기타 : - 과제 수업방식별시간 1주 강의설명 및 설문(의견수렴)-강의계획서 재 공지 및 설명 중국현대소설과 영화에 대한 전체적인 흐름을 정리한다. 이를 위해 배경지식 에 해당하는 중국현대사에 대한 주요 흐름을 설명한다. 강의 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 2주 소설목록과 작품, 특징 중국현대소설의 대표적인 작품 및 작가 에 대한 설명을 한다. 이 가운데 이번 학기에 선택한 작품들에 대한 개괄적 특징과 이를 살펴보는 이유에 대해 설 명한다. 강의 3주 영화와 소설의 텍스트읽기 중국현대소설 가운데 영화로 만들어진 대표작들을 소개하고, 이에 대한 감상 관점 및 주요 배경에 대해 전체적 이해 의 시간을 갖는다. 강의 4주 동북작가와 샤오홍 <황금시대>라는 영화를 통해 동북작가 의 대표적 현대작가인 샤오홍의 일대기 를 그린 소설과 영화를 감상한다. 이를 통해 일제의 압제하에 있었던 역사적 현실과 가부장제적 사회의 잔재로 인해 신여성이 겪었던 상황 등을 고찰한다. 강의 및 감상 5주 <오일의 마중> 영화<오일의 마중>, 소설<나의 할아버 지가 탈옥한 이야기>를 감상하고, 비교 분석한다. 이는 문화대혁명을 배경으 로 한 영화이자 소설로 소개된다. 강의 및 감상 6주 문화대혁명과 문학 문화대혁명기의 대표적 작품(소설, 영 화) 를 감상하였기에, 이 즈음에 중국 의 역사가운데 가장 재앙적 사건이었던 문화대혁명의 역사적 동기 및 발단. 전개, 과정, 결론 등에 대해 이론적 학 습을 한다. 강의 및 감상 7주 위화소설과 영화<인생> 영화<인생>과 소설<살아간다는 것>을 감상하고 분석한다. 영화는 문화대혁명 기를 배경으로 삼기도 하지만, 그 이전 부터(중공성립 이전부터)를 배경으로 하는 것이기에, 이에 대한 학습도 병행 한다. 일본과의 불평등한 관계 및 그 청산을 그린 영화<색계>를 소설과 함께 감상한다. 강의 및 감상 8주 중간고사 시험 강의 및 감상 9주 영화 <송가황조> 영화: <송가황조>를 감상한다. 이는 소 설 원작은 없으나, '송씨 세자매'를 비 롯하여 손중산, 장개석 등 중간고사 이 후 시기에 해당되는 주요 역사적 배경 과 인물들이 대거 등장하는 영화이기에 영화감상 및 시대배경을 이해하기 위 해 감상하고 학습하는 시간을 갖는다. 강의 및 감상 10주 <붉은 수수밭>과 <집으로 가는 길> 장예모 감독의 <홍까오량>과 그 배경이 된 소설도 함께 감상한다. 아울러 장 예모 감독의 색다른 작품<집으로 가는 길>도 함께 감상한다. 강의 및 감상 11주 <패왕별희> 장예모 감독과 같은 세대 감독으로 중 국의 대표적 감독의 영화 <패왕별희>를 통해 중국현대사와 인생의 이야기를 감상한다. 아울러 아시아에서 노벨상을 수상한 중국의 모옌 등을 비롯한 대작 가들의 작품도 이해한다. 강의 및 감상 12주 문화대혁명시기 문화대혁명 시대 전후 배경과 배경영화 강의 및 감상 13주 개혁개방 이후 천안문 사건 개혁개방 정책을 시행한 뒤 중국 사회 에 발생한 다양한 모순과 이를 배경으 로 한 2차 천안문사건에 대해 학습한다 . 강의 및 감상 14주 영화 <책상서랍속의 동화> <북경 자전거> 영화 <책상서랍속의 동화>, <북경 자전 거>를 감상한다. 이는 개혁개방이후의 작품으로 중국이 서방에 문호를 열고 시골과 농촌의 빈부차가 극심해지고, 다양한 문화적 차이를 보이면서 생겨난 헤프닝을 그려낸 작품이다. 이 가운데 <책상서랍속의 동화>는 施祥生 作品 < 天上有？太？> 을 원작으로 하고 있으 며, 영화로는 <一？都不能少>라는 이름 으로 張藝謨 감독,1999 작품이다. 강의 및 감상 15주 기말고사 시험 강의 및 감상"
  },
  {
    "file_name": "6.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/6.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 중급중국어회화 학과/학년 중어중문 2 수업목표 本講座以具備初級漢語技能的學生爲對象, 敎學目標爲: 1.增强常用句型的活用能力. 2.擴大語彙量, 3.正確使用聯接詞. 4.理解語言上的文化差異 5.能根據主題說出自己的意見.DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 30% 30% 10% 10% 0% 0% 0% 20% 평가참고사항 기타(쪽지시험 과마다 실시할 예정이오니 참고바람.) 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ √ 기타 : - 과제 √ 수업방식별시간 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 1주 課程介紹 學生能力測定,分組 授 自我介 2주 越越/是......的/先......然后/一...... 一/一......也不/了 1.認識一下 授， 后 3주 又......又/一......就....../挺/得了/越... ...越....../有一点点 2.吃点什？ 授， 后 4주 是/原......怪不得....../什都// 不但......而且....../的是 3.在校園裏 授， 后 5주 才/偏偏/......也....../只//不是.... ../或者......或者....../再 4. 住的麻煩 授， 后 6주 差不多/比//要是/千万/因......所以.... ../再 5.麽去好？ 授， 后 7주 早/什//如果/其 6.做客 授， 后 8주 期中考 期中考 下考 9주 好/除了......以外......//...... ....../......又....../等 7.旅行計劃好 授， 后 10주 急着/......的/特是/稍微//多了/拿... ... 8.生活服務 授， 后 11주 要不/正好/多/听/不用/不如 9.北京的市場 授， 后 12주 ......都....../......都......// 一天比一天/然/万一/一......就...... 10.爲了健康 授， 后 13주 ......的/......是......不/最好/什的 /............/只要......就....../因此 11.購物 授， 后 14주 以/着/起/光/可不是/不定 12. 談論朋友 授， 后 15주 期末考試 期末考 下考"
  },
  {
    "file_name": "7.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/7.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 고급중국어 1 학과/학년 중어중문 3 수업목표 중급이상의 중국어 독해수준을 갖춘 학습자에게 고급 수준의 중국어를 청취력 및 표현력을 양성한다. 인터넷에서 제공된 영상물 및 영화, 드라마를 활용하여 중국 현대 사회, 문화, 정치 외교 등 다양한 정보(지식)을 접하고, 관련 내용을 이해하고 본인의 생각을 구어로 표현할 수 있도록 연습한다. DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 20% 30% 20% 15% 0% 15% 0% 0% 평가참고사항 비대면 강의 방식으로 진행되는 수업이므로 출석과 수업태도에 관한 평가비율을 높였으며, 수업중 발표와 과제물 제출에 대한 평가 비율도 상승 되었다. 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ 기타 : - 과제 수업방식별시간 1주 수업관련 OT 강의계획 안내, 주업 진행 방식 안내, 수업관련 질의응답 등 설명 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 2주 중국 식문화를 알고 한국 식문화와 비교할 수 있기 中 CCTV 拍的《舌尖上的中》 - 주식 이야기)를 관람하고 중국 주식 문화와 한국 주식 문화를 비교, 토론하 기 강의, 발표,토론 병 행 https://www.youtub e.com/watch?v=LDl0 Q-XmiSk 3주 중국 식문화를 알고 한국 식문화와 비교할 수 있기 中 CCTV 拍的《舌尖上的中》 - 시간의 맛)를 관람하고 중국 조리법 과 한국 조리법을 비교, 토론하기 강의, 발표,토론 병 행 https://www.youtub e.com/watch?v=LDl0 Q-XmiSk 4주 중국 식문화를 알고 한국 식문화와 비교할 수 있기 中 CCTV 拍的《舌尖上的中》 - 주방의 비밀)를 관람하고 중국 주방 문화와 한국 주방 문화를 비교, 토론하 기 강의, 발표,토론 병 행 https://www.youtub e.com/watch?v=LDl0 Q-XmiSk 5주 중국 식문화를 알고 한국 식문화와 비교할 수 있기 中 CCTV 拍的《舌尖上的中》 - 5미의 조화)를 관람하고 중국 식문화 와 한국 식문화를 비교, 토론하기 강의, 발표,토론 병 행 6주 중국 도시 젊은 사람의 삶을 알아보기 영화 <먼 훗날의 우리>를 통해 중국 도 시 젊은 사람의 사랑과 인생 꿈의 실현 등 이야기를 나눈다. 강의, 발표,토론 병 행 7주 중국 도시 젊은 사람의 삶을 알아보기 한국과 중국의 젊은 사람들의 삶에 대 한 나의 생각을 표현하기 강의, 발표,토론 병 행 8주 중간 고사 학습 내용 관련 평가를 진행한다. 중간고사 9주 미국 화인과 대만 본토 문화 차의 알아보기 <Two Cities Two girls>를 관람하고 문화 요소를 파악하여 토론하기 강의, 발표, 토론 병행 10주 미국 화인과 대만 본토 문화 차의 알아보기 <Two Cities Two girls>를 관람하고 문화 요소를 파악하여 토론하기, 강의, 발표,토론 병 행 11주 화인 사회 문화 콘텐츠 발전 양상을 알아보 기 <육교 위에 마술사> 관람하고 관련 문 화 콘텐츠의 발전 과정을 이해하고 토 론하기 강의, 발표,토론 병 행 12주 화인 사회 문화 콘텐츠 발전 양상을 알아보 기 <육교 위에 마술사> 관람하고 관련 문 화 콘텐츠의 발전 과정을 이해하고 토 론하기 강의, 발표,토론 병 행 13주 중국 관광 자원과 여행 상품 알아보기 한국에서 학한 중국 관광 상품 현황을 이해하고 창의 적인 관광 상품을 구상 하기 강의, 발표,토론 병 행 14주 중국 관광 자원과 여행 상품 알아보기 한국에서 학한 중국 관광 상품 현황을 이해하고 창의 적인 관광 상품을 구상 하기 강의, 발표,토론 병 행 15주 기말고사 학습 내용의 표현 능력 평가 기말고사"
  },
  {
    "file_name": "5.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/5.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 중급중국어 1 학과/학년 중어중문 2 수업목표 본 과목은 중국어 독해 중심과목으로써 이미 초급 및 생활 중국어를 학습한 경험이 있는 학생이 중국어로 쓰인 글을 통해 문장의 구성 및 표현 방법을 학습하며, 단어와 그 사용의 문법을 실제 문장 속에서 익히게 한다.(본 강좌는 중국어 학습 초중급에 해당하므로 중국인 학생들은 가급적 수강을 피해주시길 바랍니다. 本課程還是個初中級階段，中國同學請別選課。)DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 0% 0% 10% 20% 0% 10% 0% 60% 평가참고사항 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ √ 기타 : - 과제 √ 수업방식별시간 1주 오리엔테이션 및 문장구성성분 이해하기 오리엔테이션 및 문장구성성분 이해하 기 강의식 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 2주 현대중국어 접속사의 기능과 의미 이해하고 활용하기 小王의 앵무새 두 마리/ 딸의 잔머리에 제시된 문법과 어휘학습 강의식, 플립드러닝 3주 현대중국어 결과보어의 기능과 의미 이해하 고 활용하기 춘절의 풍속-세뱃돈 이야기에 제시된 문법과 어휘학습 강의식, 플립드러닝 4주 중국어 문장에서 현대중국어 양사의 기능과 의미 이해하고 활용하기 여행일기-제주도 여행일기에 제시된 문 법과 어휘학습 및 독해연습 강의식, 플립드러닝 5주 현대중국어 ‘把‘자문의 기능과 의미 이해 하고 활용하기 다이어트-다이어트 체험담/다이어트 광 고에 제시된 문법과 어휘학습 및 독해 연습 강의식, 플립드러닝 6주 현대중국어 유의어의 의미와 기능을 알고 구 분하기 사랑-신세대의 좋은남제에 제시된 문법 과 어휘학습 및 독해연습 강의식, 플립드러닝 7주 현대중국어 가능보어의 기능과 의미 이해하 고 활용하기 일기예보-정월대보름 일기예보에 제시 된 문법과 어휘학습 및 독해연습 강의식, 플립드러닝 8주 중간고사 중간고사 중간고사 9주 현대중국어 개사(전치사)의 기능과 의미 이 해하고 활용하기 스포츠 뉴스- 베이징올림픽에서 한국야 구팀이 금메달을 획득하다에 제시된 문 법과 어휘학습 및 독해연습 강의식, 플립드러닝 10주 현대중국어 '……也‘구문의 기능과 의미 이해하고 활용하기 중국가요-'적어도 당신이 있어요'에 제 시된 문법과 어휘학습 및 독해연습 강의식, 플립드러닝 11주 현대중국어 '被자문'의 기능과 의미 이해하 고 활용하기 편지-연애편지/연하장에 제시된 문법과 어휘학습 및 독해연습 강의식, 플립드러닝 12주 현대중국어 겸어문의 기능과 의미 이해하고 활용하기 성어고사부분에 제시된 문법과 어휘학 습 및 독해연습 강의식, 플립드러닝 13주 현대중국어 ‘一……一’의 기능과 의미 이해하고 활용하기 탕자의 비유에 제시된 문법과 어휘학습 및 독해연습 강의식, 플립드러닝 14주 문장을 통한 중국 문화 이해하기 잃어버린 양의 비유에 제시된 문법과 어휘학습 및 독해연습 강의식, 플립드러닝 15주 기말고사 기말고사 기말고사"
  },
  {
    "file_name": "4.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/4.pdf",
    "num_pages": 3,
    "content": "학점 분반 교과목 구분 교과목명 중국현대사회의이해 학과/학년 중어중문 2 수업목표 2024년 현재 우리 사회는 많은 변화와 도전에 직면해 있다. 2018년부터 본격화된 미중 무역전쟁은 G2시대 변수가 아닌 상수로 작용할 가능성 이 높다. 최근 심화된 한-일 갈등은 글로벌 가치사슬이 중대한 조정국면을 맞고 있음을 보여준다. 또 전세계 코로나 이후 디지털 대전환은 이제 선택이 아닌 생존이 되었다. 소규모 개방경제 국가인 한국은 이같은 글로벌 체제의 변화와 갈등에 민감한 영향을 받는다. 문제는 이 모든 변화의 시작점이라 할 수 있는 중국이란 ‘공간’에 대한 ‘바른 식견’의 부재이다. 중국에 관한 오독은 어디에서 오는가? 그것은 무엇보다 ‘차이’에 대한 인식의 부재에서 비롯한다. 전형적 ‘국민국가(Nation-state)’의 규모와 특 성과 사유를 갖고 있는 한국이 본질적으로 국민국가일 수 없는 중국을 이해하기란 쉬운 일이 아니다. 이 강좌의 주요 의제는 ‘중국이 과연 국가 인가?’라는 질문에서 시작한다. 우리와 다른 국가공간인 ‘중국’을 이해하기 위해 ‘차이’에 주목하는 비교사회문화학적 방법론이 동원될 것이다. 이 강의의 목표는 중국과 더욱 밀접한 삶을 영위할 수밖에 미래 세대의 중국에 대한 이해를 넓히고 축적하는 것이다. 최근 들어 격화되고 있는 민족주의의 골을 넘어 우리와 ‘다른’ 시스템과 발전 궤적을 가진 현대 중국을 체계적으로 이해하고 학습할 것이다.DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 20% 20% 20% 20% 0% 20% 0% 0% 평가참고사항 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 2 / 3 - 강의 √ √ 기타 : - 과제 수업방식별시간 1주 중국 현대사회의 이해에 대한 개요 • 오리엔테이션(강의 목표, 평가 방법, 교재 및 자료 소개) 1강 중국을 왜 이해해야 하는가? 강의/토론 2주 중국의 역사적 배경 알기 1. 중국의 고대 문명과 역사 소개( 황 하 문명과 중국 고대 왕조의 역사적 중 요성 탐구) 2. 당, 송, 원, 명, 청 왕조를 통한 중 국의 정치적, 문화적 발전 소개 3. 청말 시기의 중국과 서양 열강의 침 략 4. 토론: 청나라 말기 중국의 사회적, 정치적 변화가 현대 중국에 끼친 영향 강의/토론 3주 중화민국과 공산당의 성립 1. 중화민국 초기의 정치적 혼란과 개 혁 노력 2. 중국 공산당의 창립과 활동 3. 국민당과 공산당의 연합과 갈등 4. 토론: 중화민국 초기의 정치적 혼란 이 중국 공산당의 부상에 어떻게 영향 을 미쳤는가? 강의/토론 4주 중국 내전과 인민공화국의 설립 1. 국공내전의 배경과 전개. 2. 1949년 중화인민공화국의 설립과 초 기 정책 3. 중국 내전의 국제적 맥락과 영향 4. 신 중국의 건설과 초기 경제 정책 5. 토론: 중화인민공화국의 설립이 중 국과 세계에 끼친 영향 강의/토론 5주 마오쩌둥과 덩샤오핑 시대 1. 마오쩌둥 시대의 정치적, 사회적 변 화-대약진 운동과 문화대혁명. 2. 마오쩌둥 새대의 국제 관계와 냉전 맥락 3. 덩샤오핑의 개혁개방 정책과 중국의 경제적 급성장 강의/토론 6주 21세기 초의 중국-정치와 경제 1. 중국의 현대 정치 체제, 2. 중국의 경제 정책과 글로벌 영향 3. 토론: 중국의 정치적 변화가 글로벌 경제 및 정치에 미친 영향 강의/토론 7주 21세기 초의 중국-사회와 문화 1. 중국의 도시화와 사회적 변화 2. 현대 중국의 대중문화 3. 토론: 중국의 사회적, 문화적 변화 가 세계적인 맥락에서 어떻게 해석될 수 있는가? 강의/토론 8주 중간고사 중간고사 중간고사 9주 21세기 초의 중국-국제 정치 전략과 글로벌 영향력 1. 중국의 외교 정책과 글로벌 전략 2. 중국의 국제 경제 전략 3. 중국의 외교 및 경제 전략이 글로벌 정치 및 경제 질서에 미치는 영향 강의/토론 10주 21세기 초의 중국-디지털 경제와 기술 혁신 1. 중국의 디지털 경제 발전 2. 중국의 기술 혁신과 글로벌 영향 3. 중국의 기술 발전이 국제 경제 및 기술 경쟁에 미치는 영향 강의/토론 11주 21세기 초의 중국-사회적 도전과 미래 전망 1. 중국의 인구 정책과 사회적 영향 2. 중국의 사회 불평등과 미래 도전 3. 중국이 직면한 주요 사회적 도전들 과 그에 대한 해결 방안 강의/토론 12주 21세기 초의 중국-문화적 부흥과 글로벌 영 향 1. 중국의 문화적 부흥 2. 중국 문화의 글로벌 영향력 3. 중국 문화의 현대적 변화가 글로벌 문화에 미치는 영향 강의/토론 13주 21세기 초의 중국-현대 중국의 미래 전망 1. 중국의 현재 상황과 미래 도전 2. 중국의 글로벌 역할과 미래 영향 발표/토론 14주 21세기 초의 중국-현대 중국의 미래 전망 1. 중국의 현재 상황과 미래 도전 2. 중국의 글로벌 역할과 미래 방향 발표/토론 3 / 3 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 15주 기말고사 기말고사 기말고사"
  },
  {
    "file_name": "1.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/1.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 중국고대문학사 학과/학년 중어중문 2 수업목표 중국문학의 원류를 찾아 철학의 사상적 배경을 이해하고, 나아가 문학에서 다뤄지는 문학관을 섭렵하며 사상과 문학관의 통일 및 다른 점을 분 석하여 중국문학의 원형을 인식하며 문학의 수용 및 발전과 변화를 역사적인 흐름으로 살펴서 전체적인 특징을 학습한다.DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ √ √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 35% 35% 10% 0% 0% 20% 0% 0% 평가참고사항 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ 기타 : - 과제 수업방식별시간 1주 수업 방식 소개 (1) 강의 목표, 강의 내용, 평가 방법, 과제 소개 (2) 중국문학사와 문학의 정의 (3) 중국문학의 기원 소개 강의 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 2주 중국문학 통론 이해 중국역사, 중국 문학의 특징 소개 강의, 토론 3주 유가의 성립과 발전 알기 공자의 활약과 공헌, 주요 사상 및 후 대의 영향 강의,토론 4주 유가의 시경, 주역,등 유가 경서 소개 유가의 시경, 주역, 예기 등 강의,실생활에서 경 서의 발견 토론 5주 도가 산문 이해 노자, 장자의 사상 및 문학에 끼친 영 향 강의,자연사상의 견 해 토론 6주 산문의 이해 맹자, 순자, 역사서(춘추, 서경, 좌전, 국어 등)의 문장 알기 강의,도덕인성 토론 7주 한대 시가 및 문학 흐름 알기 시가의 계승과 발전, 새로운 쟝르의 출 현과 발전 강의 8주 정리 및 중간평가 필기시험 대면 평가 9주 초사, 악부 감상 초사, 악부 작품 감상 강의, 감상 10주 문학비평 형성 이해 유가정권의 성립과 문학 사상의 변화 강의, 철학과 문학 의 통일 논의 11주 위,진왕조 문학의 발전과 변화 알기 위,진의 역사와 시가 변화의 궤적 강의 12주 남북왕조의 문학 특징 송,제,양,진 및 북조의 문학 발전 강의, 문학과 시대 반영의 토론 13주 위진남북조 문학 민가와 소설 탄생 및 발전 강의 14주 문학비평의 전승과 영향 알기 문부, 문심조룡, 시품 등의 문체와 사 상 강의, 인품과 문학 표현 토론 15주 정리 및 기말평가 필기시험 대면 평가"
  },
  {
    "file_name": "3.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/3.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 중국어학의이해 학과/학년 중어중문 2 수업목표 '어학'이란 '회화' 그 자체를 말하는 것이 아니라, 의사전달에서 응용되어지는 언어요소를 연구하는 학문이다. '중국어학'은 '중국어회화'가 아니 라, 중국어를 사용해 의사를 전달할 때 필요로하는 언어의 요소를 연구하는 학문을 말한다. '언어전달의 매개체'는 일반적으로 形音意 삼요소가 필요하다. 중국어에서 形은 문자이고, 音은 음원이며, 意는 어법을 일반적으로 가리킨다. '중국어학의 이해'는 중국어의 현대, 근대, 고대의 언어 학적 차이와 중국어의 문자, 음운, 어법의 특징을 살펴 학습에 도움이 되도록 한다.DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 30% 30% 20% 20% 0% 0% 0% 0% 평가참고사항 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ 기타 : - 과제 수업방식별시간 1주 중국어의 언어학적 특징 이해 1. 어법의 특징, 2. 문자적 특징, 3. 음운학적 특징 강의 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 2주 중국어의 어법 이해 1. 고대언어와 현대언어의 차이, 2. 고 대언어-갑골문 금문의 소개 강의 3주 중국어의 어법 이해 1. 어법이란, 2. 어법의 단위, 3. 문장 의 성분 강의 4주 현대중국어의 품사 1. 중국어의 조사의 특징, 2. 중국어의 전치사의 특징 강의 5주 현대중국어의 문장성분 중국어의 보어의 특징(결과보어와 정도 보어의 구별 등) 강의 6주 고대 중국어의 어법적 특징 '도화원기(도연명)' 어법학적 특징 분 석(1) 강의 7주 고대 중국어의 어법적 특징 '도화원기(도연명)' 어법학적 특징 분 석(2) 강의 8주 중간고사 중간고사 시험 9주 중국어 문자학이란 1. 고대문자, 2. 간체자 강의 10주 중국 고대 문자의 이해 갑골문의 특징 강의 11주 갑골문의 이해 실례를 들어 갑골문의 특징 이해하기 강의 12주 고대문자를 통한 중국 고대 사회 이해 고대문자를 통한 중국 고대 사회 이해 강의 13주 금문의 이해 실례를 통한 중국 금문의 이해 강의 14주 금문을 통한 중국 고대 사회(주나라 시기)의 이해 중국 음운의 특징-성모와 운모의 차이, 반절법 이해, 고대 운서의 이해 강의 15주 기말고사 기말고사 시험"
  },
  {
    "file_name": "2.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/전북대학교_중어중문학과/2.pdf",
    "num_pages": 2,
    "content": "학점 분반 교과목 구분 교과목명 중국고사성어선독 학과/학년 중어중문 2 수업목표 본 강의는 수강생들이 고사성어를 해석해보고, 직접 써봄으로써 한문 독해 능력을 향상시키고, 고사성어와 관련된 역사적 고사를 알아봄으로써 인문학적 소양을 갖추는 데 그 목표가 있다. 아울러 소개하고 싶은 고사성어를 선별하여 이를 콘텐츠로 제작해봄으로써 인문 지식이 디지털 환 경에서 확산될 수 있도록 한다.DA 수업방식 (복수가능√) 강의 발표/토론 PBL 플립러닝 LMS활용 실험실습 기타 √ √ 수업운영방향 평가계획 (100%) 중간 기말 출석 과제물 안전교육 발표/토론 수업태도 기타 30% 0% 10% 30% 0% 30% 0% 0% 평가참고사항 평가방법 A(%) A+B(%) C이하(%) 총비율 0 0 0 100% 절대평가 기준 상대평가 비율 절대평가 - 강의 √ 기타 : - 과제 수업방식별시간 1주 오리엔테이션 강의 소개 및 수업 진행 방식, 평가 방 식에 대해 설명한다. 강의 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 2 / 2 주별 수업목표 수업내용 수업방식 주별 강의내용 자료, 과제 및 기타 참고사항 온라인 오프라인 수업방식별시간 2주 역사와 관련 있는 고사성어 알아보기 역사와 관련 있는 성어를 해석하고, 고 사를 이해한다. 강의 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 3주 배움과 관련 있는 고사성어 알아보기 배움과 관련 있는 성어를 해석하고, 고 사를 이해한다. 강의 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 4주 독서와 관련 있는 고사성어 알아보기 독서와 관련 있는 성어를 해석하고, 고 사를 이해한다. 강의 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 5주 스승과 관련 있는 고사성어 알아보기 스승과 관련 있는 성어를 해석하고, 고 사를 이해한다. 강의 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 6주 가족과 관련 있는 고사성어 알아보기 가족과 관련 있는 성어를 해석하고, 고 사를 이해한다. 강의 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 7주 우정과 관련 있는 고사성어 알아보기 우정과 관련 있는 성어를 해석하고, 고 사를 이해한다. 강의 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 8주 중 간 고 사 중간고사 시험 지필고사(오프라인) 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 9주 사랑과 관련 있는 고사성어 알아보기 사랑과 관련 있는 성어를 해석하고, 고 사를 이해한다. 강의 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 10주 사람과 관련 있는 고사성어 알아보기 사람과 관련 있는 성어를 해석하고, 고 사를 이해한다. 강의 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 11주 동물과 관련 있는 고사성어 알아보기 동물과 관련 있는 성어를 해석하고, 고 사를 이해한다. 강의 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 12주 말(언어)과 관련 있는 고사성어 알아보기 말(언어)과 관련 있는 성어를 해석하고 , 고사를 이해한다. 강의 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 13주 계절과 관련 있는 고사성어 알아보기 계절과 관련 있는 성어를 해석하고, 고 사를 이해한다. 강의 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 14주 [하루 5분] 고사성어 콘텐츠 제작하기 자신이 제작하고 싶은 고사성어를 발표 하고, 이를 콘텐츠로 제작한다. 발표 수업자료: 1) ppt 자료 2) 기타 시청각 자 료 15주 기 말 고 사 기말고사 시험 콘텐츠 제작하기 수업자료: 1) ppt 자료 2) 기타 시청각 자 료"
  },
  {
    "file_name": "9.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/9.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 전자회로 1 코드 ECE30051 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 3 분반 01 인정전공 컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공 학심 학점구성 총학점 이론 실험/실습 설계 기타() 3 3 0 0 0 수업주유형 강의 선수과목 필수 회로이론1 병수과목 전자회로 및 통신실습 권장 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 김영식 young@handong.edu 1329 NTH 404 목 16:00~18:00 TA성명 TA email 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 Able to explain the device characteristics of op-amp, diode, BJT, and MOSFET. 2 Able to design amplifiers and some logic gates using the active devices 3 Able to perform the circuit simulation with SPICE including the active components ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) This class will cover the characteristics and some application circuits of basic electronic devices including diode, simplified op amplifier, BJT, and FET transistors. And the basic design technique with the electronic devices will be studied. Some fundamental logic gate design topics will also covered to provide student the basic operation of the transistor level logic gates. Through this course, all students are expected to know the basic operations of each electronic device, and some application circuits. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 Handed out text in class 저자 출판사 출판년도 부교재 서명 Microelectronics Circuit 6'th ED 저자 Sedra/Smith 출판사 Oxford 출판년도 2012 기자재 ● 평가 출석관리 결석의 경우 0.5점 감점입니다. 지각 3회는 결석으로 처리합니다. 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 5 20 30 20 0 25 Honor Code 준수 및 평가방법 추가설명 평가 기준은 출결 5 퀴즈 20 중간 20 기말 30 과제 25 개인과제는 수업에서 제출하는 과제로 평가합니다. ● 수업 활동유형 강의 90% 실험 % 실습 10% 팀프로젝트 % 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 Audio amplifier design project Voltage gain >30dB Maximum output voltage > 5Vpp at 1K load THD(Total Harmonic distortion) < 5% ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-05 2024-03-08 Circuit 101 ( Review on basic circuit theory ) Signals ( Analog and digital ) 2 2024-03-12 2024-03-15 Frequency response / Bode Plot Basic op-amp circuit 3 2024-03-19 2024-03-22 Limitations of real op-amp Integration / Differntiation 4 2024-03-26 2024-03-29 Terminal characteristics of diodes Diode model and operating point analysis 5 2024-04-02 2024-04-05 Diode circuit analysis Rectifying and regulator Quiz1 6 2024-04-09 2024-04-12 BJT terminal characteristics DC analysis and large signal operation 7 2024-04-16 2024-04-19 Bias schemes and small signal analysis Single stage amplifier design 8 2024-04-23 2024-04-26 Frequency response of BJT amplifiers Midterm Midterm 9 2024-04-30 2024-05-03 MOSFET device structure and terminal characteristics DC analysis and large signal operation 10 2024-05-07 2024-05-10 Break Bias schemes and small signal analysis 11 2024-05-14 2024-05-17 Single stage amplifier of MOSFET Frequency response of MOS amplifier 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 12 2024-05-21 2024-05-24 Analog circuit transfer characteristics Digital signal and logic families 13 2024-05-28 2024-05-31 Basic inverter and device size scaling CMOS logic design and implementation Quiz2 14 2024-06-04 2024-06-07 Compound gate design Latches and Flip/Flop 15 2024-06-11 2024-06-14 Memory circuit SRAM/DRAM structures 16 2024-06-18 2024-06-21 Final exam Final 5"
  },
  {
    "file_name": "8.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/8.pdf",
    "num_pages": 6,
    "content": "강의계획서 교과목명 데이타베이스 코드 ECE30030 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 3 분반 01 인정전공 AI융합(33),/데이터사이언스(33),/컴퓨터공학(33),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공 학 학점구성 총학점 이론 실험/실습 설계 기타() 3 3 0 0 0 수업주유형 강의, Project 선수과목 필수 ECE20042 이산수학/ITP20002 Discrete Mathematics 병수과목 권장 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 홍참길 charmgil@handong.edu 1309 NTH 201 TBA TA성명 TA email 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 Students understand the concepts and underlying mechanisms of database management system 2 Students can represent database designs in modeling languages and analyze the designs with respect to given constraints 3 Students articulate the relational database language (structured query language) 4 Students can extract, transform, and load data from a database and analyze it using modern algorithms ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) This is an introductory course on Database Management Systems (DBMSs) that is powerful tool for storing and organizing large amounts of data efficiently, reliably, and safely. We will study the concepts and underlying mechanisms of DBMSs; discuss and design data models; and learn how to write and execute \"queries\" in structured query language, which is a standard language for manipulating data in databases. We will also briefly discuss the recent trends in data storage technologies and experience modern data analytic techniques (a.k.a. data science). 3. 과목 운영 및 과제물 ● 교재 주교재 서명 Database System Concepts, 7th edition 저자 Abraham Silberschatz, Henry F. Korth, S. Sudarshan 출판사 McGraw Hill 출판년도 2019 부교재 서명 Database Internals: A Deep Dive into How Distributed Data Systems Work 저자 Alex Petrov 출판사 O'Reilly Media 출판년도 2019 부교재 서명 Database Management Systems, 3rd edition 저자 Raghu Ramakrishnan, Johannes Gehrke 출판사 McGraw Hill 출판년도 2003 기자재 ● 평가 출석관리 1. 'F' grade will be given to students who have missed more than 1/4 of the classes or attempt to cheat their attendance. 2. If there is an unavoidable reason, the student is not considered absent only if the provided evidence shows that it complies with Article 34 of Academic Regulation. - https://www.handong.edu/dcp/editor/files/rule_25.pdf 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타 1(Participat ion) 기타2() 0 23 25 5 20 20 7 Honor Code 준수 및 평가방법 추가설명 1. 'F' grade will be given to students who attempt to cheat on exam/assignment/attendance; or miss a midterm or final exam. 2. HGU Honor code and CSEE Standard apply. http://csee.handong.edu/wp-content/uploads/2018/02/HGU-CSEE-Standard_English_v0.2.pdf 3. Assignment and grading policy (including penalty rules) will be re-announced in class. 4. If there is a reasonable reason for submitting your assignment late, it can be tolerated. All reasons must be submitted as signed documents no later than three days from the corresponding incident. 5. Scores can be corrected, but grades will never be negotiated. ● 수업 활동유형 강의 80% 실험 % 실습 % 팀프로젝트 20% 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 Team project on designing a database and optimizing the schemas and queries. ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-04 2024-03-07 Admin, Introduction DBMS, Relation data model Reading: Chapter 1 2 2024-03-11 2024-03-14 Relational algebra Installing a DBMS Reading: Chapter 2 3 2024-03-18 2024-03-21 Structured Query Language (DML) Reading: Chapter 3 4 2024-03-25 2024-03-28 Structured Query Language (DDL) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 5 2024-04-01 2024-04-04 Entity-Rleationship (ER) diagrams Reading: Chapters 6-7 6 2024-04-08 2024-04-11 Normalization theory 7 2024-04-15 2024-04-18 Advanced SQL, Constraints, Views Reading: Chapters 4-5 8 2024-04-22 2024-04-25 Midterm 9 2024-04-29 2024-05-02 Transactions Reading: Chapter 17 10 2024-05-06 2024-05-09 Database storages Reading: Chapters 12-13 11 2024-05-13 2024-05-16 Database Storages Reading: Chapters 12-13 12 2024-05-20 2024-05-23 Indexes Reading: Chapter 14 13 2024-05-27 2024-05-30 Indexes Reading: Chapter 14 14 2024-06-03 2024-06-06 Keys, Functions/Procedures, Triggers 15 2024-06-10 2024-06-13 Beyond relational data Reading: Chapters 10-11 16 2024-06-17 2024-06-20 Final Exam 5"
  },
  {
    "file_name": "16.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/16.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 IoT실습 코드 ECE40066 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 4 분반 01 인정전공 컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공 학심 학점구성 총학점 이론 실험/실습 설계 기타() 3 2 1 0 0 수업주유형 강의, Project, 실습 선수과목 필수 컴퓨터 네트워 병수과목 권장 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 고윤민 yunmin@handong.edu 1384 NTH 306 Mon TA성명 이세현 TA email 13579@handong.ac.kr 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 Understand the network protocols and issues for IoT systems from application layer to link layer. 2 Understand the link and mac layer in the computer networks. 3 Understand various concepts and implementation methods for network programming. 4 Implement the server and client program for IoT system. ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) This course aims to understand network protocols and issues for IoT systems. By top-down approach, we will study about major network protocols for IoT systems, such as MQTT, WebSocket, and WiFi. Especially, in this semester, we will learn about the concepts of link layer and mac layer, and then we will study about the WiFi. Furthermore, we will learn about the major methods for network programming including I/O multiplexing, multi-threading, serialization, PubSub, and container-based deployment. In this course, we will conduct various laboratories to strengthen our understanding of computer networks and IoT systems. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 저자 출판사 출판년도 부교재 서명 저자 출판사 출판년도 기자재 ● 평가 출석관리 0.5 point penalty is given for absence. (3 tardiness == 1 absence) If you are absent more than 1/4, you will get Fail. 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 5 15 50 30 Honor Code 준수 및 평가방법 추가설명 We must comply with the Handong Honor Code. Any kinds of cheatings will get 0 point. Do not copy your colleague's codes. ● 수업 활동유형 강의 50% 실험 % 실습 20% 팀프로젝트 30% 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 Midterm Project (개인별) 2 Final Proejct (팀) - 산학연 연계 PBL 과제 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-05 2024-03-08 Introduction & Computer Network Review 2 2024-03-12 2024-03-15 Link Layer 3 2024-03-19 2024-03-22 Link Layer 4 2024-03-26 2024-03-29 Wireless Networks & WiFi 5 2024-04-02 2024-04-05 Wireless Networks & WiFi 6 2024-04-09 2024-04-12 Wireless Networks and IoT Systems 7 2024-04-16 2024-04-19 Midterm Exam / Midterm Project 8 2024-04-23 2024-04-26 Midterm Project 9 2024-04-30 2024-05-03 Midterm Project 10 2024-05-07 2024-05-10 MQTT 11 2024-05-14 2024-05-17 Web Socket 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 12 2024-05-21 2024-05-24 Final Project 13 2024-05-28 2024-05-31 Final Project 14 2024-06-04 2024-06-07 Final Project 15 2024-06-11 2024-06-14 Final Project 16 2024-06-18 2024-06-21 Final Project Presentation 5"
  },
  {
    "file_name": "17.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/17.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 캡스톤디자인2 코드 ECE40079 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 4 분반 01 인정전공 컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공 학심 학점구성 총학점 이론 실험/실습 설계 기타() 4 0 0 4 0 수업주유형 Project 선수과목 필수 캡스톤디자인1 병수과목 권장 주관교수성명 조성배 주관교수 Email sungbaejo@handong.ed u 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 조성배 sungbaejo@handong.e du 1364 NTH 203 TA성명 방은찬 TA email 21700327@handong.ac. kr 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 주어진 설계 사양을 만족하는 제품을 제약조건을 반영하여 설계 및 구현할 수 있다. - 설계 및 구현 능력 2 다양한 방법을 사용하여 설계 결과를 분석,비교,평가할 수 있다. 3 설계에 필요한 원활한 팀워크와 의사소통을 할 수 있다. 4 공학제품의 사회적 영향력을 이해할 수 있다. ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) 1. 본 강좌는 여러 요소설계 강의와 이론 강의에서 배운 내용을 종합하여 실제 문제를 해결하는 제품을 설계하고 구현함으로써 자신 들의 지식을 종합하고 응용하는 것을 목적으로 한다. 이와 더불어, 실제 산업현장에서 연구 개발 및 제품 개발시에 부딪히게 될 의사 소통과 팀워크, 프로젝트 관리등을 할 수 있는 소프트스킬을 키워주는 것을 목표로 한다. 2. 1명의 전공지도교수의 지도하에 2인 이상의 학생들이 팀을 이루어 캡스톤 1 과목에서의 개념 설계를 구체화하고 상세설계 단계를 거쳐서 구현, 검증, 평가까지 수행하도록 한다. 3. 설계결과는 수업시간 발표 와 최종발표회를 통하여 구두로 발표되며, 문서로 상세한 설계 보고서를 제출해야 한다. 중간발표 시 각 팀별로 비디오로 5분 분량의 발표내용을 촬영하여 제출한다. 최종 발표는 포스터 발표 형식과 병행하여 학부전체의 축제로 진행되며 학부 설계 경진대회 형식으로 진행된다. 4. 매주 팀별로 설계 미팅이 있고 정기적인 전체 수업이 있다. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 저자 출판사 출판년도 부교재 서명 저자 출판사 출판년도 기자재 ● 평가 출석관리 - 전체수업은 필참 - 학부에서 개최되는 전문가 초청 특강 필참 - 팀별 진행 주간은 지도교수별로 모임 (주간보고서 및 회의록 작성 필수, 총 8회 이상, 이 중 2회는 산학멘토 참여) 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(과제) 기타2(발표) 10 70 10 10 Honor Code 준수 및 평가방법 추가설명 - 학기 중, 공인된 전공 역량 테스트에 반드시 1회 이상 응시해야 함 - TOPCIT, 정보처리기사 또는 전기기사 응시 - 미응시 시 감점 ● 수업 활동유형 강의 20% 실험 % 실습 % 팀프로젝트 60% 발표 20% 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-06 2024-03-08 오리엔테이션 2 2024-03-13 2024-03-15 팀별 문제정의 주간보고서1 3 2024-03-20 2024-03-22 배경연구1 주간보고서2 4 2024-03-27 2024-03-29 배경연구2 주간보고서3 5 2024-04-03 2024-04-05 예비설계 주간보고서4 6 2024-04-10 2024-04-12 상세설계 주간보고서5 7 2024-04-17 2024-04-19 구현 주간보고서6 8 2024-04-24 2024-04-26 구현 주간보고서7 9 2024-05-01 2024-05-03 최적화 주간보고서8 10 2024-05-08 2024-05-10 테스팅 11 2024-05-15 2024-05-17 발표준비 UCC 파일, 판넬제작용 PDF파일, 캡스톤 대회 책자 내용 ppt 발표자 료(국문) 12 2024-05-22 2024-05-24 캡스톤 페스티벌 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 13 2024-05-29 2024-05-31 문서화 진로활동보고서1 14 2024-06-05 2024-06-07 최종 보고서 내용 review 진로활동보고서2 15 2024-06-12 2024-06-14 학습성과측정 진로활동보고서3 최종보고서 요약본 제출 최종 설계보고서 제출 16 2024-06-19 2024-06-21 5"
  },
  {
    "file_name": "15.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/15.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 직업과 진로설계(전산전자) 코드 ECE30039 개설년도 2025 개설학기 1 개설학부 이수구분/영역 / 대상학년 3 분반 01 인정전공 컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공 학심 학점구성 총학점 이론 실험/실습 설계 기타() 1 1 0 0 0 수업주유형 강의, 토론 선수과목 필수 병수과목 권장 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 김광 kkim@handong.edu 1307 NTH 204 금 2,3 TA성명 TA email 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 전산전자공학부 4학년 진입학생들에게 진로설계의 의미와 중요성을 인식시키고, 전산전자분야에 필요한 진로 및 직업 역량 을 조사, 분석하여 자신에게 적용할 수 있는 전략을 수립하고 실질적인 진로와 직업선택을 준비할 수 있도록 돕는다 ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) 전산전자공학부 4학년 학생들을 대상으로 다음과 같은 내용을 강의 및 진행한다. - 2주차 수요일 1시 대면수업 진행 - 전산전자분야 업종별 직무 및 역량 소개, 조사 과제 수행 - 진로 선택의 기준과 조사 방법 소개 - 집중이수 1차: 취업준비의 실제 (이력서, 포트폴리오, 자기소개서 작성 등) - 집중이수 2차: 직업윤리와 기업가 정신 - 집중이수 3차: 모의면접 3. 과목 운영 및 과제물 ● 교재 주교재 서명 저자 출판사 출판년도 부교재 서명 저자 출판사 출판년도 기자재 ● 평가 출석관리 16시간의 수업에 대해 시간 단위 출결 관리 결석 1시간 당 -10점 결석이 총 3시간을 초과하면 F학점 부여함 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(수업 참여도) 기타2() 30 50 20 Honor Code 준수 및 평가방법 추가설명 PD : 90점 이상 Pass : 70점 이상 Fail : 70점 미만 출석 : 30점 만점 (집중이수 포함 결석 1시간 당 10점씩 감점) 과제 : 50점 1) 이력서 및 자소서 작성 2) 전공역량 테스트 응시 3) 기업 취업정보 조사 수업참여도 : 수업참여 리포트 및 발표 점수 20점 만점 ● 수업 활동유형 강의 20% 실험 % 실습 % 팀프로젝트 % 발표 % 토론 % 기타1(집중이수) 80% 기타2() % 기타3() % 총계 100 % 번호 내용 1 개인포트폴리오(자소서, 이력서) 작성 1차 제출 후, 상담을 통해 수정된 최종버전을 2차 제출 2 전공역량 테스트 응시 - TOPCIT, 정보처리기사, 전기기사 중 택1 3 각자 진로에 따른 기업(기관) 취업 정보 조사 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2025-03-05 2 2025-03-12 오리엔테이션, 사전 조사 3 2025-03-19 4 2025-03-26 토요일 집중이수 집중이수 1 : 취업준비의 실제 (이력서, 포트폴리오, 자기소개서 작성 등) 자기소개서 과제 5 2025-04-02 토요일 집중이수 집중이수 2 : 직업윤리와 기업가 정신 6 2025-04-09 7 2025-04-16 8 2025-04-23 9 2025-04-30 10 2025-05-07 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 11 2025-05-14 개인 진로상담 마감 자기소개서 최종본 과제 마감 12 2025-05-21 직무능력시험 응시 과제 마감 13 2025-05-28 토요일 집중이수 집중이수 3 : 모의면접 기업조사 과제 마감 14 2025-06-04 15 2025-06-11 16 2025-06-18 5"
  },
  {
    "file_name": "14.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/14.pdf",
    "num_pages": 6,
    "content": "강의계획서 교과목명 운영체제 코드 ECE30021 개설년도 2025 개설학기 1 개설학부 이수구분/영역 / 대상학년 3 분반 01 인정전공 컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공 학심 학점구성 총학점 이론 실험/실습 설계 기타() 3 3 0 0 0 수업주유형 강의 선수과목 필수 C Programming 병수과목 권장 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 김인중 ijkim@handong.edu 1385 NTH 302 Mon, Fri 09:00~10:00 TA성명 TA email 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 The students understand the basic knowledge of the mechanism and theories that are used to implement modern operating systems.. 2 Students can use advanced features of Linux, including system calls, APIs, and development tools, to build SW. ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) Introduction to the core concepts, principles, and related techniques that apply to various operating systems. The emphasis will be given to the ones about process and storage management. Students will do multiple programming assignments on the UNIX/Linux environment. The programming assignments would require advanced features of OS, such as multi-threaded programming, shared memory, and synchronization primitives. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 Operating System Concepts, 10th Edition 저자 Abraham Silberschatz, Peter Bear Galvin, and Greg Gagne 출판사 John Wiley & Sons Inc. 출판년도 2018 부교재 서명 C프로그래밍실습 강의 http://www.kocw.net/home/cview.do?cid= fb2cd7b6c98c8890 저자 김광 출판사 K-OCW 출판년도 2018 기자재 Linux server or cloud ● 평가 출석관리 - Each student should check her/his own attendance using Handong NFC App. - More than 6 times of absence will result in failure. - Three times of lateness will be counted by one absence. - Use of mobile phones in the class will be penalized. 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 5 30 30 15 20 Honor Code 준수 및 평가방법 추가설명 (Delay) Any submission later than its deadline will be penalized. - One day: 20% penalty - More than one day: rejection (Honesty) Any form of dishonesty will result in a failing grade (F). Refer to 'HGU CSEE Standard' including 'Honor Code Guideline.' Without explicit permission, violating the following rules is cheating. - Each student should do homework by herself/himself without any help from others or collaboration with others. - Doing homework with others is prohibited and will be considered cheating except for team projects. - Sharing homework or showing homework to others is cheating. - Referencing any solution written by others, including AI and any code from the Internet, is cheating. - Attendance tagging outside of the classroom or leaving the classroom after tagging is cheating. ● 수업 활동유형 강의 100% 실험 % 실습 % 팀프로젝트 % 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2025-03-03 2025-03-06 Introduction 2 2025-03-10 2025-03-13 Operating System structures 3 2025-03-17 2025-03-20 Operating System structures 4 2025-03-24 2025-03-27 Process 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 5 2025-03-31 2025-04-03 Process 6 2025-04-07 2025-04-10 Threads 7 2025-04-14 2025-04-17 Process synchronization 8 2025-04-21 2025-04-24 Midtem test 9 2025-04-28 2025-05-01 Process synchronization 10 2025-05-05 2025-05-08 CPU scheduling 11 2025-05-12 2025-05-15 CPU scheduling 12 2025-05-19 2025-05-22 Main memory 13 2025-05-26 2025-05-29 Main memory 14 2025-06-02 2025-06-05 Virtual memory 15 2025-06-09 2025-06-12 Virtual memory 16 2025-06-16 2025-06-19 Final test 5"
  },
  {
    "file_name": "10.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/10.pdf",
    "num_pages": 6,
    "content": "강의계획서 교과목명 마이크로프로세서응용 코드 ECE30070 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 3 분반 01 인정전공 컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공 학심 학점구성 총학점 이론 실험/실습 설계 기타() 3 1 1 1 0 수업주유형 강의, Project, 실험 선수과목 필수 C언어(C Programming), 논리설계(Logic Design) 병수과목 권장 컴퓨터구조(Computer Structure) 주관교수성명 이원형 주관교수 Email whlee@handong.edu 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 이원형 whlee@handong.edu 1388 NTH 202 TA성명 유준호 TA email juno980220@naver.com 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 Understanding the structure and operation of microprocessors 2 Able to program using C/C++ languages in a microprocessor system environment 3 Understanding the operation of peripherals around the microprocessor and able to control them 4 Able to utilize basic development tools (compiler/linker, debugger, etc.) ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) This course covers the applications and functionalities of modern microprocessor systems. We assume that the students have background knowledge in C programming and Digital Logic as prerequisites; and Computer Architecture as a recommanded course. This course includes an ARM microprocessor instruction set architectures, assembly language programming, bare metal machine programming in C, exception and interrupt handling mechanisms, general purpose input/outut device interfacng wirh microprocessor system, system development with real time operating system . The course places an emphasis on practical learning through experiments with ARM microprocessor-based board, and explores interfacing with various peripherals such as LED and push-button, LCD display panel, BLE communication with smartphone, communication via UART, SPI, I2C within a Real-Time Operating System (RTOS) environments. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 Lecture Slides 저자 출판사 출판년도 주교재 서명 ARM System Developer's Guide: Designing and Optimizing System Software 저자 Andrew N. Sloss, et al. 출판사 Morgan Kaufmann 출판년도 부교재 서명 Lecture Slides 저자 출판사 출판년도 기자재 nRF52840 Development Kit ● 평가 출석관리 1. 'F' grade will be given to students who have missed more than 1/4 of the class or attempt to cheat their attendance. 2. If there is an unavoidable reason, the student is not considered absent only if the provided evidence shows that it complies with Article 34 of Academic Regulation. - https://www.handong.edu/dcp/editor/files/rule_25.pdf 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 10 20 10 20 40 Honor Code 준수 및 평가방법 추가설명 1. 'F' grade will be given to students who attempt to cheat on exams/assignments/attendance. 2. HGU Honor code and CSEE Standard apply. http://csee.handong.edu/wp- content/uploads/2018/02/HGU-CSEE-Standard_English_v0.2.pdf 3. Assignment and grading standards (including penalty rules) will be re-announced in class. 4. Scores can be corrected, but grades will never be negotiated ● 수업 활동유형 강의 40% 실험 40% 실습 % 팀프로젝트 20% 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 PBL(Project-based Learning) Assignments (산학연 연계 PBL 과제) ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-05 2024-03-08 Course Introduction & ARM ISA 2 2024-03-12 2024-03-15 ARM ISA & ARM simulator(1) - Lab1 3 2024-03-19 2024-03-22 ARM ISA & ARM simulator(2) - Lab2 4 2024-03-26 2024-03-29 Understanding Experimental Kit - Lab3 5 2024-04-02 2024-04-05 Understanding GPIO (Button + LED) - Lab4 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 6 2024-04-09 2024-04-12 Understanding RAM Retention - Lab 5 7 2024-04-16 2024-04-19 Understanding BLE - Lab 6 8 2024-04-23 2024-04-26 Understanding UART communication - Lab7 9 2024-04-30 2024-05-03 Understanding SPI LCD - Lab 8 10 2024-05-07 2024-05-10 Efficient C Programming(1) - Lab 9 11 2024-05-14 2024-05-17 Midterm Exam 12 2024-05-21 2024-05-24 Project Proposal 13 2024-05-28 2024-05-31 Efficient C Programming(2) - Lab 10 14 2024-06-04 2024-06-07 Project Feedback 15 2024-06-11 2024-06-14 Project Presentation 16 2024-06-18 2024-06-21 Project Presentation Final Report 5"
  },
  {
    "file_name": "11.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/11.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 캡스톤디자인1 코드 ECE30079 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 3 분반 01 인정전공 컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공 학심 학점구성 총학점 이론 실험/실습 설계 기타() 2 0 0 2 0 수업주유형 Project 선수과목 필수 공학설계입문 병수과목 권장 학부사무실 통해 확인 주관교수성명 이원형 주관교수 Email whlee@handong.edu 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 이원형 NTH 202 TA성명 TA email 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 설계를 위한 요구사항 요소를 이해하고, 실제 문제해결상황에 적용할 수 있다. 2 도출한 요구사항을 바탕으로 체계적으로 설계를 구상할 수 있다. 3 다양한 설계 안을 비교 분석하고 평가할 수 있다. 4 오픈소스 역량 훈련을 기를 수 있다. (자세한 역량은 공지 섹션 참고) ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) 본 수업은 캡스톤 디자인 프로젝트를 구상하기 위한 문제 발견, 요구사항 분석, 설계 도출 및 평가를 총체적으로 실습함을 목표로 한 다. 특별히 본 수업에서는 구체적인 공학 설계 실력을 배양하기 위해, 실제 문제를 주제로 프로젝트를 수행하여 실용성 있는 프로젝트 구 상안 도출을 목표로 한다. (참고로 2023년 1학기까지 본 과목의 이름은 \"공학프로젝트기획\"이었음) 3. 과목 운영 및 과제물 ● 교재 주교재 서명 저자 출판사 출판년도 부교재 서명 저자 출판사 출판년도 기자재 ● 평가 출석관리 팀별로 교수님께서 체크 및 아래 Honor Code 준수 및 평가방법 추가설명 참고 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 10 90 Honor Code 준수 및 평가방법 추가설명 캡스톤 디자인1 수업에서 Pass를 받기 위해서는 다음 각 조건을 반드시 만족해야 합니다: - 팀별 진행 계획서 제출 - 팀별 미팅 8회 이상 및 일지 제출 (제출 방법 별도 안내) - CSEE 특강에 2-3회 이상 출석 및 감상문 제출 - 특허 캠프 출석 - 온라인 안전 교육 이수 - 캡스톤페스티벌 Poster 제출 및 참가 (관련 공지 예정 from 학부사무실) - 설계 기획 보고서에 지도교수님 승인 & 제출 - 학기 중 2회 이상 산업체 전문가 멘토링 & 멘토링 보고서 제출 * 위 일정은 변경될 수 있으며 첫 수업에서 공지되는 일정을 다시 확인하기 바랍니다. ● 수업 활동유형 강의 10% 실험 % 실습 % 팀프로젝트 90% 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 산학연 연계 PBL 과제 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-06 팀별 프로젝트 진행 2 2024-03-13 팀별 프로젝트 진행 3 2024-03-20 팀별 프로젝트 진행 4 2024-03-27 팀별 프로젝트 진행 5 2024-04-03 팀별 프로젝트 진행 6 2024-04-10 팀별 프로젝트 진행 7 2024-04-17 팀별 프로젝트 진행 8 2024-04-24 팀별 프로젝트 진행 9 2024-05-01 팀별 프로젝트 진행 10 2024-05-08 팀별 프로젝트 진행 11 2024-05-15 팀별 프로젝트 진행 12 2024-05-22 캡스톤 페스티벌 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 13 2024-05-29 팀별 프로젝트 진행 14 2024-06-05 팀별 프로젝트 진행 15 2024-06-12 팀별 프로젝트 진행 16 2024-06-19 팀별 프로젝트 진행 5"
  },
  {
    "file_name": "13.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/13.pdf",
    "num_pages": 6,
    "content": "강의계획서 교과목명 객체지향 설계패턴 코드 ECE30012 개설년도 2025 개설학기 1 개설학부 이수구분/영역 / 대상학년 3 분반 01 인정전공 컴퓨터공학(33),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공학심화(60), 학점구성 총학점 이론 실험/실습 설계 기타() 3 2 0 1 0 수업주유형 강의, Project 선수과목 필수 자바 프로그래밍 병수과목 권장 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 김기석 peterkim@handong.edu 1398 NTH 403 목 4,5교시 TA성명 TA email 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 The students can build applications and applets using advanced Java constructs. 2 The students can understand popular design patterns based on object-oriented 3 The students can design and implement a small application using OOP techniques ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) - The lecture covers theoretical aspects of widely used design patterns to improve software reusability and maintainability. - As a team, the students will build a software system to solve a design problem using the design patterns covered in this course. - The student team presents and demonstrates the internal designs as well as the functions of their product. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 Java 객체지향 디자인 패턴 저자 정인상, 채흥석 출판사 한빛미디어 출판년도 2017(3쇄) 부교재 서명 Object-Oriented Software Engineering Using UML, Patterns, and Java™ 저자 Bernd Bruegge & Allen H. Dutoit 출판사 Prentice Hall 출판년도 Third Edit 부교재 서명 Java Design Patterns 저자 출판사 Exelixis Media P.C 출판년도 2015 부교재 서명 Object-Oriented Software Development Using Java, 저자 Xiaoping Jia 출판사 Addison Wesley 출판년도 Second Edi 기자재 ● 평가 출석관리 - More than six times of absence will result in failure in this course. - Twice of lateness will be counted by one absence. - Any use of mobile phone or ringing in the class will be counted as single lateness (first time) or absence (second time or later). - Any behavior disturbs the class can be penalized. 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 10 25 25 0 35 5 Honor Code 준수 및 평가방법 추가설명 개인과제로 assign되는 프로그래밍 과제 제출시 타인의 코드를 일부라도 그대로 복사하여 사용하는 경우, 양 쪽 모두에게 미제출로 채점됨 ● 수업 활동유형 강의 60% 실험 % 실습 % 팀프로젝트 30% 발표 10% 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 -팀(3-4명)별 텀프로젝트를 수행함 - 텀프로젝트는 iterative development방식을 통하여 단계별로 개발결과를 제시함 - 단계별로 리팩토링 또는 디자인패턴의 적용을 시도함 - 디자인 패턴을 정확히, 그리고 다수 적용할때 좋은 평가를 받게 될 것임 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2025-03-04 2025-03-07 Object-Oriented Software Development 2 2025-03-11 2025-03-14 Object-Oriented Modeling Using UML\" 3 2025-03-18 2025-03-21 Object-Oriented Modeling Using UML\" 1st Project 4 2025-03-25 2025-03-28 Design by Abstraction 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 5 2025-04-01 2025-04-04 Refactoring Presentation of 1st Project 6 2025-04-08 2025-04-11 Refactoring 7 2025-04-15 2025-04-18 Example of iterative development 2nd Programming Assignment 8 2025-04-22 2025-04-25 Midterm Exam 9 2025-04-29 2025-05-02 Design pattern : Factory, Template Method 10 2025-05-06 2025-05-09 Design pattern : Iterator, Singleton, Strategy #1st iteration 프로젝트 발표 11 2025-05-13 2025-05-16 More Design Patterns 12 2025-05-20 2025-05-23 More Design Patterns 13 2025-05-27 2025-05-30 More Design Patterns #2nd iteration 프로젝트 발표 14 2025-06-03 2025-06-06 More Design Patterns 팀별 발표 15 2025-06-10 2025-06-13 More Design Patterns 팀별 발표 16 2025-06-17 2025-06-20 Final Exam. #final iteration 프로젝트 발표 5"
  },
  {
    "file_name": "12.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/12.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 모바일 앱 개발 코드 ECE30002 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 3 분반 01 인정전공 ICT융합(33),/컴퓨터공학(33),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공학심화(60), 학점구성 총학점 이론 실험/실습 설계 기타() 3 1 0 0 0 수업주유형 강의, Project, 실습 선수과목 필수 자바프로그래밍 병수과목 권장 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 조성배 sungbaejo@handong.e du 1364 NTH 203 WED 13:00~14:15 TA성명 정수아 TA email 22000672@handong.ac. kr 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 The students understand fundamental concepts of mobile programming. 2 The students can develop cross-platform mobile applications. 3 The students can effectively utilize development tools necessary for mobile programming. ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) Recent mobile devices provide not only their basic features, such as telephony and taking pictures, but also development platforms, like PC's, on which programmers can run their own applications. As mobile devices are getting popular, mobile application development skill is also being highlighted as an important skill that can provide many opportunities to majors in computer science. In order to meet the needs of the times, this subject covers an introduction to mobile environments as well as concepts and developing methods practically required to write mobile applications. Students should develop a cross-platform mobile application in this course. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 PPT 저자 출판사 출판년도 부교재 서명 Flutter Doc (https://flutter.io/docs/) 저자 출판사 출판년도 기자재 Laptop, Projector ● 평가 출석관리 If you miss more than 25% of the class, you will get F grade. If you appear class later than 15 minutes after class started you are regarded as being absent. 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 10 25 25 20 20 Honor Code 준수 및 평가방법 추가설명 * Delay - Any submission later than its deadline will be penalized. . One day: 20% penalty . More than one day: reject * Honor code guidelines - The cheating criteria of CSEE are described in \"HGU CSEE Standard\" and \"CSEE Honor Code Guidelines\". - Use of any program code not written by you will be regarded as cheating. (Even partial use is cheating.) - Sharing or showing a submission with others, showing your solution to others, or doing homework together are cheating and strictly prohibited. * Disturbance - Any unauthorized use of electronic devices in the class, except for attendance check, without explicit permission is not allowed. - Any behavior that disturbs the class can be penalized. ● 수업 활동유형 강의 50% 실험 % 실습 25% 팀프로젝트 25% 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 산학연 연계 PBL 과제 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-04 2024-03-07 Flutter 개요 & 설치 및 튜토리얼 2 2024-03-11 2024-03-14 Dart 소개 & Flutter Basic 3 2024-03-18 2024-03-21 Flutter Layouts & Interactivity 4 2024-03-25 2024-03-28 Flutter User Interface 5 2024-04-01 2024-04-04 Material design (Component basics, Layout, Structure) 6 2024-04-08 2024-04-11 Material design (Theming, Advanced Component) 7 2024-04-15 2024-04-18 State Management 8 2024-04-22 2024-04-25 중간고사 & Firebase 개요 9 2024-04-29 2024-05-02 Firebase for flutter 10 2024-05-06 2024-05-09 Firebase Package (Firestore) & Fireflutter plugin 11 2024-05-13 2024-05-16 Firebase Package (Storage, Auth) 12 2024-05-20 2024-05-23 기말고사 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 13 2024-05-27 2024-05-30 프로젝트 14 2024-06-03 2024-06-06 프로젝트 15 2024-06-10 2024-06-13 프로젝트 16 2024-06-17 2024-06-20 프로젝트 발표 5"
  },
  {
    "file_name": "20.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/20.pdf",
    "num_pages": 6,
    "content": "강의계획서 교과목명 Compiler Theory 코드 ITP40004 개설년도 2025 개설학기 1 개설학부 이수구분/영역 / 대상학년 4 분반 01 인정전공 컴퓨터공학(33),/Information Technology(33),/컴퓨터공학(40),/컴퓨터공학(45),/AI· 학점구성 총학점 이론 실험/실습 설계 기타() 3 3 0 0 0 수업주유형 강의 선수과목 필수 Java, C, DS, Programming Languages Theory 병수과목 권장 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 성금영 kysung@handong.edu 1371 NTH 308 Tue. and Thurs. 4:~ 5: TA성명 TA email 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 Senior-level and graduate students learn the theories and techniques for designing and implementing high-level programming language translators. 2 Students are supposed to understand formal language and automata theory. 3 Students learn how to use lex and yacc for implementing scanners and parsers. ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) Students learn automata theory and formal language, and the techniques for implementing front-end compiler techniques which deal with scanner, parser, semantic analyzer, and syntax directed translation. Emphasis will be given to the theoretical understanding and implementation of scanner and a variety of parsers -- LL(1), LR(0), SLR(1), LR(1), and LALR(1). Most projects are about implementing manual front-end compiler. Some projects will be given for exercising automatic scanner and parser generating tools such as Lex and Yacc, which are flex and bison in Linux. The tool, WINFLEXBISON, the Lex and Yacc in Windows will also be introduced. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 Compilers - Principles, Techniques, & Tools 저자 Aho, Lam, Sethi, and Ullman 출판사 Pearson Addison Wesleyny 출판년도 2007 부교재 서명 An Introduction to Formal Languages and Automata 저자 Peter Linz 출판사 Jones & Bartlett Learning 출판년도 2017 부교재 서명 Compiler Construction, Principles and Practice 저자 Kenneth C. Louden 출판사 PWS Publishing Company 출판년도 1997 기자재 ● 평가 출석관리 Four absences will result in the failure in this course. Attend every class to understand and follow the class material. 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 0 25 25 25 25 Honor Code 준수 및 평가방법 추가설명 Honest working is emphasized! Grading criteria and portion may be changed depending on the status of progress and understanding the material. ● 수업 활동유형 강의 90% 실험 % 실습 10% 팀프로젝트 % 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 top down parser 2 scanner construction 3 recursive descent parser 4 bottom up parser the use of Flex and Bison ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2025-03-04 2025-03-07 Syllabus Overview Introduction (1st and 2nd week) Overview of Compiler; Introduction to Front-end / Back-end, Analysis / Synthesis 2 2025-03-11 2025-03-14 Introduction (1st and 2nd week) Phases of Compiler; Definition on Front-end / Back-end, Analysis / Synthesis 3 2025-03-18 2025-03-21 Scanning Regular Expression Automata Theory - DFA, NFA, Lex a quiz on automata theory 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 4 2025-03-25 2025-03-28 Scanning Regular Expression Automata Theory - DFA, NFA, Lex 5 2025-04-01 2025-04-04 Scanning Regular Expression Automata Theory - DFA, NFA, Pumping Lemma scanner construction - project date may be changed 6 2025-04-08 2025-04-11 Scanning Regular Expression Automata Theory - DFA, NFA, Pumping Lemma 7 2025-04-15 2025-04-18 Introduction to Context-Free Grammars and Parsing Left/Right Associativity, Ambiguity, Top-Down/Bottm-Up Parsing Concepts top down parser- project date may be changed 8 2025-04-22 2025-04-25 (MId-Term Exam by Programming Assignment) Context-Free Grammars and Parsing syntax tree, parse tree, annotated parse tree, BNF, EBNF; 9 2025-04-29 2025-05-02 Context-Free Grammars and Parsing syntax tree, parse tree, annotated parse tree, BNF, EBNF; 10 2025-05-06 2025-05-09 Top Down Parsing Recursive-Descent, LL(1), First and Follow Sets; top down parser- project date may be changed 11 2025-05-13 2025-05-16 Top Down Parsing Recursive-Descent, LL(1), First and Follow Sets; 12 2025-05-20 2025-05-23 Top Down Parsing Recursive-Descent, LL(1), First and Follow Sets; 13 2025-05-27 2025-05-30 Bottom-Up Parsing LR(0), SLR(1), LR(1), LALR(1), 14 2025-06-03 2025-06-06 Bottom-Up Parsing LR(0), SLR(1), LR(1), LALR(1), Syntax Directed Translation bottom up parser- project date may be changed 15 2025-06-10 2025-06-13 Bottom-Up Parsing LR(0), SLR(1), LR(1), LALR(1), Syntax Directed Translation 16 2025-06-17 2025-06-20 Project Week 5"
  },
  {
    "file_name": "21.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/21.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 Software Engineering 코드 ITP40002 개설년도 2025 개설학기 1 개설학부 이수구분/영역 / 대상학년 4 분반 01 인정전공 ICT융합(33),/컴퓨터공학(33),/Information Technology(33),/컴퓨터공학(40),/컴퓨터 학점구성 총학점 이론 실험/실습 설계 기타() 3 3 0 0 0 수업주유형 강의, Project, 토론 선수과목 필수 Java Programming 병수과목 권장 Database 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 남재창 jcnam@handong.edu 1404 NTH 407 By appointment TA성명 TA email 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 Understand the fundamentals of software, software developments, and software engineering activities 2 Understand and practice modern software engineering methodologies 3 Attain core skills to use basic software engineering tools 4 Practice conducting a project as a team and communication skills ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) This course introduces students to the challenges and issues in software developments and various software engineering methodologies that have been proposed as scientific solutions to the problems. This course will cover key topics in software engineering including software process, requirements, and maintenance. In addition, this course has a high emphasis on understanding and practicing basic tools for engineering software. Student duties - Active participation - Exams - Group projects (Major portion) - HW tasks 3. 과목 운영 및 과제물 ● 교재 주교재 서명 Software Engineering, Tenth edition 저자 Ian Sommerville 출판사 Pearson 출판년도 부교재 서명 저자 출판사 출판년도 기자재 ● 평가 출석관리 Students who missed more than 1/4 classes will get F. Three tardy or early leave will be counted as one absent. 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 0 15 15 15 40 15 0 0 Honor Code 준수 및 평가방법 추가설명 Your absence can be approved only if it meets Act 8-34 of the HGU academic regulation && you submit a proof. (http://rule.handong.edu) See the Honor code and rules http://csee.handong.edu/%ED%95%99%EB%B6%80%EC%86%8C%EA%B0%9C/%ED%95%99%EB% B6%80-%EA%B7%9C%EC%A0%95%EC%A7%91/ There might be additional tasks for bonus points. We adopt absolute evaluation. (>=95: A+, >=90: A0, >=85: B+, >=80: B0, >=75: C+, >=70: C0, >=65: D+, >=60: D0, 60>: F) For the group project, we apply relative evaluation. The best team will get 35 and the last team will get 20. However, by conducting a peer review, the best member of the last team would get more than 30 and the poor member of the best team would get 20 as well. ● 수업 활동유형 강의 65% 실험 % 실습 % 팀프로젝트 25% 발표 5% 토론 5% 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 TBD ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 Week1-1 Week1-2 Introduction Professional Software Development / SE ethics Quiz01, HW1 2 Week2-1 Week2-2 Software Processes 3 Week3-1 Week3-2 Project Management Agile Software Development (1) Quiz02 4 Week4-1 Week4-2 Agile Software Development (2) Requirement Engineering 5 Week5-1 Week5-2 Project planning System Modeling 6 Week6-1 Week6-2 Architectural Design Design and Implementation Quiz03 7 Week7-1 Week7-2 Open Source Development and its tools (1) Open Source Development and its tools (2) 8 Week8-1 Week8-2 Midterm 9 Week9-1 Week9-2 Software Testing and Tools HW2 10 Week10-1 Week10-2 Software Evolution 11 Week11-1 Week11-2 Configuration Management 12 Week12-1 Week12-2 Quality Management (QM) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 13 Week13-1 Week13-2 QM technique: Software Quality Prediction Quiz04 14 Week14-1 Week14-2 QM technique: Automated Program Repair Dependable Systems 15 Week15-1 Week15-2 Final Group Project Presentation 16 Week16-1 Week16-2 Final Exam 5"
  },
  {
    "file_name": "19.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/19.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 딥러닝 개론 코드 ECE40035 개설년도 2025 개설학기 1 개설학부 이수구분/영역 / 대상학년 4 분반 01 인정전공 컴퓨터공학(33),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공학심화(60), 학점구성 총학점 이론 실험/실습 설계 기타() 2 2 0 0 0 수업주유형 강의, Project, 토론 선수과목 필수 병수과목 권장 Machine Learning 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 최희열 hchoi@handong.edu 1303 OH 312 by appointment TA성명 TA email 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 The students understand basic concepts and algorithms in deep learning ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) Recent advances in Artificial Intelligence have been achieved by breakthrough technologies in deep learning. This course covers the fundamental theories and practical applications of deep learning, although it focuses more on theories than applications. Note that this class is a graduate class and open to undergrad students. Students are expected to have basic understanding about machine learning. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 Deep Learning 저자 Goodfellow, Bengio, Courville 출판사 MIT Press 출판년도 2016 부교재 서명 저자 출판사 출판년도 기자재 ● 평가 출석관리 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1() 기타2(챕터 요약) 20 20 60 Honor Code 준수 및 평가방법 추가설명 See the syllabus in LMS. Please refer to 'HGU CSEE Standard' including 'Honor Code Guideline'. ● 수업 활동유형 강의 30% 실험 % 실습 % 팀프로젝트 % 발표 % 토론 70% 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2025-03-04 Deep Learning Intro 2 2025-03-11 Deep Learning Intro 3 2025-03-18 Chap6. Deep Feedforward Networks 4 2025-03-25 Chap7. Regularization 5 2025-04-01 Chap8. Optimization 6 2025-04-08 Chap9. CNNs 7 2025-04-15 Chap10. RNNs 8 2025-04-22 Chap11 and Chap12. Practical Methodology and Applications 9 2025-04-29 Chap13 and Chap14. Linear Factor Models and Autoencoders 10 2025-05-06 Chap15. Representation Learning 11 2025-05-13 Adversarial Example, Style transfer 12 2025-05-20 Understanding deep learning, Explainable AI 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 13 2025-05-27 Transformer, GNN 14 2025-06-03 GNN, VAE 15 2025-06-10 Project Presentation 1 16 2025-06-17 Project Presentation 2 5"
  },
  {
    "file_name": "18.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/18.pdf",
    "num_pages": 6,
    "content": "강의계획서 교과목명 특론1 코드 ECE40097 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 4 분반 01 인정전공 컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공 학심 학점구성 총학점 이론 실험/실습 설계 기타() 3 3 0 0 0 수업주유형 강의, Project, 토론, 실습 선수과목 필수 병수과목 권장 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 안민규 minkyuahn@handong.e du 1167 OH 311 by appointment TA성명 TA email 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 뇌 구조 및 신경 정보 전달 메커니즘을 이해한다. 2 뇌인지 기능 및 행동에 대한 기초 지식을 이해한다. 3 기계학습 및 인공지능 기법을 통한 인지추론, 의도확인 등의 기본적인 과정을 이해한다. 4 뇌-컴퓨터 인터페이스를 구축하기 위한 요소를 이해한다. ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) 뇌-컴퓨터 인터페이스는 신경 신호를 이용하여 외부 시스템을 작동 시키는 기술을 의미한다. 본 교과목에서는 이러한 기술을 구현하 기 위해 필요한 구성 요소 및 방법들을 알아본다. 뇌 구조 및 작동 메커니즘부터 신경 신호 측정과 기계학습/인공지능을 이용한 생각 분류 기술까지 포괄적으로 다룸으로써 뇌-컴퓨터 인터페이스 개발에 관한 기본적인 지식을 쌓는 것을 목표로 한다. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 저자 출판사 출판년도 부교재 서명 Brain-computer Interfaces Handbook Technological and Theoretical Advances (1st Edition) 저자 Chang S. Nam, Anton Nijholt, Fabien Lotte 출판사 CRC Press 출판년도 2018 부교재 서명 The Student's Guide to Cognitive Neuroscience 저자 Jamie Ward 출판사 Psychology Press 출판년도 2014 기자재 Labtop and Matlab ● 평가 출석관리 Handong Attendance Rule applies. Grade F will be given to the students who missed more than 1/4 classes. 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 20 20 60 Honor Code 준수 및 평가방법 추가설명 Please do your homework including programming by yourself. If any cheating (including copying from any source) is found, then you will get F. ● 수업 활동유형 강의 50% 실험 % 실습 20% 팀프로젝트 10% 발표 10% 토론 10% 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 - 뇌-컴퓨터 인터페이스 관련 논문 읽기 및 발표. - 뇌 신호에서 바이오마커를 추출하고 기계학습 기반 처리를 위한 기본적인 실습 과제 (matlab or python) - 목표 주제에 대한 자료 조사, 결론 도출 및 프로젝트 보고서 작성. ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-05 2024-03-08 Course overview and introduction 2 2024-03-12 2024-03-15 What is BCI? 3 2024-03-19 2024-03-22 Brain and EEG 4 2024-03-26 2024-03-29 Special Talk 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 5 2024-04-02 2024-04-05 Brain imaging 6 2024-04-09 2024-04-12 Preprocessing 7 2024-04-16 2024-04-19 EEG device (demoandLab) 8 2024-04-23 2024-04-26 Temporal Analysis 9 2024-04-30 2024-05-03 Spectral Analysis 10 2024-05-07 2024-05-10 * reserved 11 2024-05-14 2024-05-17 Spatial Analysis 12 2024-05-21 2024-05-24 Advanced EEG features 13 2024-05-28 2024-05-31 EEG classification 14 2024-06-04 2024-06-07 Deep Learning for EEG analysis 15 2024-06-11 2024-06-14 Project presentation 16 2024-06-18 2024-06-21 Final Exam 5"
  },
  {
    "file_name": "6.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/6.pdf",
    "num_pages": 6,
    "content": "강의계획서 교과목명 회로이론 코드 ECE20064 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 2 분반 01 인정전공 컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공 학심 학점구성 총학점 이론 실험/실습 설계 기타() 3 3 0 0 0 수업주유형 강의, 토론 선수과목 필수 병수과목 권장 Calculus 2 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 박영춘 ycpark@handong.edu 1933 NTH 402 Tuesday 17:20-18:00 TA성명 주명현 TA email 22000731@handong.ac. kr 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 Learn how to model mathematically the circuits with voltage/current sources and Op-Amps along with the basic passicve elements(RLC) and to analyze the characteristics of its behavior both in time domain and frequency domain. 2 Learn how to analyze the circuits with AC sources 3 nderstand the behaviors of the basic circuit elements and learn the analysis methods for the circuits composed of the basic elements ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) This is one of the basic courses in the electronic engineering, and aims to set up the basis of electric circuits. It provides an overview and basics of practical use of selected methods for the description, analysis and design of linear electric circuits. It also provides detailed instructions and information on the safety of work with electric devices. This course is prerequisite to Circuit theory 2, Electronic circuits and etc. The contents of this course are as follows: ●CircuitswithResistanceonly - Ohm'sLaw,KirchhoffsVoltage&CurrentLaws - AnalysisTechniquesI:NodalandLoopAnalysisTechniques - OperationalAmplifiers - AnalysisTechniquesII:Superposition,TheveninandNortonTheorems ●CircuitswithDynamicElements - Capacitance&Inductance,RCop-amps - First-orderTransientandSecond-orderTransientCircuits ●ACCircuits - Sinusoids,Complexfunctions,Phasors - ImpedanceandAdmittance - Analysistechniques 3. 과목 운영 및 과제물 ● 교재 주교재 서명 Basic Engineering Circuit Analysis, 저자 J. David Irwin, Robert M. Nelms 출판사 John Wiley and Sons 출판년도 부교재 서명 저자 출판사 출판년도 기자재 ● 평가 출석관리 Attendance is checked by NFC tagging plus by submitting question homework after watching the recorded lecture. (퀴즈 혹은 시험이 있는 날은 응시 여부로 출석을 판정합니다만 그래도 NFC 태깅해주세요) 지각 2회는 결석 1회로 간주합니다. Class grade is limited by attendance record. A+ possible upto 2 absence, A0 upto 3 absence, B+ upto 4 absence, and absence more than 6 is Fail. (결석 2회까지 A+, 3회까지 A0, 4회까지 B+이며 6회 이상은 F) 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 25 25 40 10 Honor Code 준수 및 평가방법 추가설명 본 강의는 flipped learning class로서 한주간 강의 내용을 동영상으로 스스로 공부하고 일주일에 한번 모여서 공부한 내용에 대해 질의/논의/응답하고 매주 퀴즈를 통해 확인하는 클래스입니다. 한주의 두번째 수업시간 은 필요한 학생들만 모여서 튜터세션을 할 예정입니다. 때문에 이런 방식의 클래스에 도전하고 꼭 해보고 싶 은 학생에게는 유용하나 스스로 공부하고 논의하는 방식에 익숙하지 않은 학생은 잘 맞지 않을 수 있으니 맞 는 학생들이 선택해 주기 바랍니다. Honor code는 반드시 준수해야 합니다. (Cheating시 F이고 징계 대상) 매주 수업중 short class quiz로 몇문제 퀴즈를 봅니다. (목적은 진도에 맞춰 내용을 이해하고 습득하도록 하는 것입니다.) 중간고사와 기말고사가 있고, 정식 Full 퀴즈가 2번 정도 있을 수 있습니다. ● 수업 활동유형 강의 50% 실험 % 실습 % 팀프로젝트 % 발표 % 토론 50% 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 해당 chapter 문제 풀이 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-05 2024-03-08 Introduction and basic concepts Ohm's law, Kirchhoff's laws Single-Loop, Node-Pair Circuits Chap. 1 Chap. 2.1-2.4 2 2024-03-12 2024-03-15 Circuits with Series-Parallel Combinations of Resistors Circuits with Dependent Sources Chap. 2.5- 2.10 3 2024-03-19 2024-03-22 Nodal Analysis Nodal/Loop Analysis Chap. 3.1-3.2 4 2024-03-26 2024-03-29 Loop Analysis/Application Example Op-Amp Circuits Chap. 3.3-4.3 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 5 2024-04-02 2024-04-05 Op-Amp Application Superposition Chap. 4.4-5.2 6 2024-04-09 2024-04-12 Thevenin and Norton Theorems Maximum Power Transfer Chap. 5.3-5.4 7 2024-04-16 2024-04-19 dc SPICE Analysis Capacitors and Inductors Chap. 5.5-5.7 8 2024-04-23 2024-04-26 Midterm Exam, Capacitor and Inductor Combinations RC Op-Amp Circuits Chap 6.1-3 9 2024-04-30 2024-05-03 RC Op-Amp Circuits First-Order Circuits Step by step_pulse Chap. 6.4-5 Chap. 7.1-2 10 2024-05-07 2024-05-10 Second-Order Circuits Design and Application Chap. 7.3-5 11 2024-05-14 2024-05-17 Sinusoidals Phasors Chap. 8.1-4 12 2024-05-21 2024-05-24 Impedance and Admittance Basic Analysis (2014-06-06 Fri) AC PSPICE Analysis Chap. 8.5-8 Chap. 8.9-11 13 2024-05-28 2024-05-31 Steady State Power Analysis Chap. 9 -1 14 2024-06-04 2024-06-07 Complex power Variable Frequency Network Performance Chap. 9-2, Chap 12 15 2024-06-11 2024-06-14 Resonant Circuits Filter Network Chap 12 16 2024-06-18 2024-06-21 Final Exam 5"
  },
  {
    "file_name": "7.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/7.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 알고리듬분석 코드 ECE30011 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 3 분반 01 인정전공 데이터사이언스(33),/컴퓨터공학(33),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공학심화(60), 학점구성 총학점 이론 실험/실습 설계 기타() 3 3 0 0 0 수업주유형 강의, 실습 선수과목 필수 데이터구조(Data Structure) 병수과목 권장 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 용환기 wyong@handong.edu 1375 NTH 307 목 6교시 TA성명 최어진 TA email 22100742@handong.ac. kr 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 The students understand various strategies. 2 The students convert algorithms covered in class using C programming language. 3 The student understand various algorithms in terms of time complexity. ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) Algorithm is a strategy for solving a problem with the assistance of a computer. To say that a problem is solvable algorithmically means, informally, that a computer program can be written that will produce the correct answer for any input if we let it run long enough and allow it as much as storage space as it needs. In this course, we will study various algorithms by analyzing them and discuss various algorithm design techniques. C will be used to develop and implement programming assignment. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 Introduction to Algorithms 저자 Thomas H. Cormen and Charles E. Leiserson 출판사 The MIT press 출판년도 2009 부교재 서명 저자 출판사 출판년도 기자재 ● 평가 출석관리 Handong attendance rule applies. If you miss the class more than 1/4 of class, you will get F grade. 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 25 25 20 30 Honor Code 준수 및 평가방법 추가설명 ● We honor Handong honor code and Handong attendance rule [1] written HW 1) In case that due date is on offline class - No late homework is allowed. Homework should be handed in before the class begins. Late homework will not be accepted. * The homework submitted after class (but before I leave the classroom) will be accepted with 10% deduction. * Once I leave the classroom, homework will not be accepted. - Remember Handong Honor Code!!! Plagiarism will not be tolerated!!! 2) In case that due date is on online class - There will be 10% deduction of points for each late minutes. [2] programming HW - There will be 10% deduction of points for each late days. [3] Exam There will be no make-up quiz/exam under normal circumstances. ● 수업 활동유형 강의 70% 실험 % 실습 30% 팀프로젝트 % 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-05 2024-03-08 Introduction / Analyzing & Designing Algorithms 2 2024-03-12 2024-03-15 Asymptotic Notation / Recursion & Induction 3 2024-03-19 2024-03-22 Exercise / Dynamic programming intro 4 2024-03-26 2024-03-29 MCM problem / LCS problem 5 2024-04-02 2024-04-05 Greedy algorithms / Quiz1 6 2024-04-09 2024-04-12 Quiz1 review / Huffman code 7 2024-04-16 2024-04-19 Knapsack problem / Graph (BFS/DFS: e-learning) 8 2024-04-23 2024-04-26 Midterm 9 2024-04-30 2024-05-03 Midterm review / Topological sort / Critical path / Biconnected 10 2024-05-07 2024-05-10 MST(e-learning) / Bellman Ford / DAG 11 2024-05-14 2024-05-17 Dijkstra / Floyd-Warshall algorithm / Rabin-Karp algorithm 12 2024-05-21 2024-05-24 KMP algorithm / Red-Black tree 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 13 2024-05-28 2024-05-31 Average case analysis / Quiz2 14 2024-06-04 2024-06-07 Quiz2 review / Linear time sorting 15 2024-06-11 2024-06-14 Order statistics / NP-completeness / Approximation algorithm 16 2024-06-18 2024-06-21 Final 5"
  },
  {
    "file_name": "5.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/5.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 기초회로 및 논리실습 코드 ECE20065 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 2 분반 01 인정전공 컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공 학심 학점구성 총학점 이론 실험/실습 설계 기타() 3 2 1 0 0 수업주유형 실험, 실습 선수과목 필수 병수과목 회로이론1, 논리설계 권장 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 김신웅 shinwoong@handong.e du 1372 NTH 406 화6, 목6 TA성명 TA email 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 전압, 전류, 전하에 대한 기본적인 이해와 이를 이용한 기초회로를 실습한다. 2 논리게이트를 활용하여 논리회로를 실습하고 간단한 논리시스템을 구현한다. 3 기초 및 논리회로 설계를 위해 필요한 장비의 사용법을 익힌다. 4 Verilog를 활용하여 간단한 논리 회로를 설계하고 이를 FPGA를 활용하여 구현할 수 있다. 5 Python을 활용하여 측정 보드 (EEboard)를 제어하고 데이터를 획득하여 분석할 수 있다. ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) 본 교과목은 회로이론1과 논리설계에서 학습하는 내용을 회로로 구현하고 계측기를 이용하여 측정 및 분석하는 실험/실습을 통해 기 초회로와 논리회로의 실무를 학습합니다. 또한 회로의 구현 측정에 사용하는 계측기의 특성과 사용법을 익히며, 계측기의 조작과 측 정 자동화를 위해 필요한 Python 프로그래밍 기법을 학습합니다. 기초전자공학 실험에서는 회로를 동작 시키는 전압, 전하, 전류의 물리량이 실제 논리회로와 저항 콘덴서에서 동작하는 방법을 실습을 통해 실재적인 경험을 제공합니다. 본 강의는 화요일은 이론강의(온라인), 목요일은 실습으로 운영됩니다. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 수업시간에 실습 관련 자료를 제공함 저자 출판사 출판년도 부교재 서명 저자 출판사 출판년도 기자재 ● 평가 출석관리 1. 매 실습 시간 반드시 출석하여야 하며, 결석시 출석 점수를 1점 감점한다. 2. 수업 시작 후 15분이내는 지각으로 처리하며, 15분 이후는 결석으로 처리한다. 3. 지각 3회는 결석 1회로 처리한다. 4. 결석 8회부터는 해당 교과목 fail이 된다. 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(기타 1) 기타2(기타 2) 10 15 15 60 Honor Code 준수 및 평가방법 추가설명 1. 각 평가 점수를 합산하여 총점 70점 이상인 경우 Pass 한다. 2. 평가방법 추가 설명 (1) 출석 10점 (2) 개인 과제 60점 -예비보고서 30점 (매주 화요일 자정까지 제출) -결과보고서 30점 (매주 토요일 자정까지 제출) (3) 중간고사 15점 (4) 기말고사 15점 3. 교과목 Pass 조건 -총점이 70점 이상 -모든 실험을 수행하는 경우에 한해서 Pass됨 (결석하더라도, 반드시 빠진 주차의 실험을 완료 해야 함) ● 수업 활동유형 강의 30% 실험 60% 실습 10% 팀프로젝트 % 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-05 2024-03-07 강의) 기본적인 물리량과 단위, Prefix소개 실습) EEboard 사용법 (전용 SW사용) 보고서 없음 2 2024-03-12 2024-03-14 강의) 저항 및 옴의 법칙 실습) EEboard 및 DMM 장비를 이용해 옴의 법칙 실습 예비보고서 및 결과보고서 3 2024-03-19 2024-03-21 강의) Logic gate 속성 실습) 기본 논리게이트 예비보고서 및 결과보고서 4 2024-03-26 2024-03-28 강의) 직렬, 병렬, 직렬-병렬 회로 이해 실습) EEboard 및 DMM 장비를 이용해 KVL, KCL 법칙 확인 예비보고서 및 결과보고서 5 2024-04-02 2024-04-04 강의) TinkerCad / Combination Logic / K-map 최적화 실습) K-map 최적화 실험 보고서 없음 6 2024-04-09 2024-04-11 강의) Combination Logic 시스템 설계 이론 실습) Vending Machine 실험 예비보고서 및 결과보고서 7 2024-04-16 2024-04-18 강의) 파형의 이해 및 함수발생기/오실로스코프 이해 실습) 함수발생기/오실로스코프 실험 예비보고서 및 결과보고서 8 2024-04-23 2024-04-25 중간고사 9 2024-04-30 2024-05-02 강의) Python을 이용한 EEBoard 제어 실습) 전압 source 제어하여 회로 네트워크 측정 보고서 없음 10 2024-05-07 2024-05-09 강의) 전력 전달 이론 실습) 최대 전력 전달 조건 실험 (Python) 예비보고서 및 결과보고서 11 2024-05-14 2024-05-16 강의) 등가 회로 및 중첩 이론 실습) 등가 회로 및 중첩 이론 실험 예비보고서 및 결과보고서 12 2024-05-21 2024-05-23 강의) RC회로 이론 실습) RC회로 실험 예비보고서 및 결과보고서 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 13 2024-05-28 2024-05-30 강의) Latch / Flip Flop 이론 실습) Latch / Flip Flop 실험 예비보고서 및 결과보고서 14 2024-06-04 2024-06-06 강의) Veriolog 이론 실습) 4-bit adder 설계 보고서 없음 15 2024-06-11 2024-06-13 강의) Stop watch 설계 실습) Stop watch 설계 (FPGA 동작 구현) 예비보고서 및 결과보고서 16 2024-06-18 2024-06-20 기말고사 5"
  },
  {
    "file_name": "4.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/4.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 논리설계 코드 ECE20057 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 2 분반 01 인정전공 컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공 학심 학점구성 총학점 이론 실험/실습 설계 기타() 3 3 0 0 0 수업주유형 강의 선수과목 필수 없음 병수과목 없음 권장 없음 주관교수성명 주관교수 Email 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 이강 yk@handong.edu 1387 NTH 408 화 10:30-12:00 TA성명 손지성 TA email sonjisung901@handong. ac.kr 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 The students should understand the fundamentals of digital logic concepts and Boolean algebra. 2 The students should be able to design digital circuit components in gate level such as multiplexers, adders, registers, and counters, and FSM. 3 The students should be able to analyze any given logic circuits and understand the behavior of the circuits 4 The students should be able to understand and apply the logic optimization techniques for combinational circuits and FSM ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) This is the fundamental course that is required to understand modern digital hardware design. This course is a core course for hardware design and it is the prerequisite for computer architecture and organization, digital system design, embedded processor application, microprocessor design, and integrated circuit design courses in upper levels. It covers Boolean Algebra, Primitive Gates, combinational circuit building block and its application to logic design, memory elements and its application to sequential circuit design, FSM(Finite State Machine) and its application to describe the behavior of sequential circuits. Combinational Logic Optimization techniques like Karnaugh Map approach is covered. Some timing issues such as setup time, hold time, and propagation delay will be addressed in the course. In addition, modern digital logic implementation platform such as CAD tools and programmable logic devices will be introduced to students. Students are required to demonstrate the ability to design and analyze simple logic circuits at the end of semester. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 Introduction to Logic Design 저자 Alan B. Marcovitz 출판사 McGraw Hill 출판년도 부교재 서명 저자 출판사 출판년도 기자재 ● 평가 출석관리 ( 출석관리 ) The course is provided online and off-line mix (online 50% with recorded video) If you miss the class, 10% of attendance credits will be reduced for each abscense. And you will get zero point on attendance if you miss the class more than 8 times (1/4 of total class hours) If you are late for more than 15 minutes from the start of class three times, you will be counted as one absence. If you get 0 points on attendabce, you will get F grade. 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(Lab report) 기타2(기타 2) 10 30 30 15 0 10 5 Honor Code 준수 및 평가방법 추가설명 ㅆhe following actions are considered as cheating -using any electronic devices during quizzes and test -telling(or asking) the problmes of quizzes and tests -using Chat-GPT for Homework. I have zero tolerance on cheating, so if you get caught, you will get F. The quiz credits ratio: on-line quiz: 5%, off-line quiz with paper: 10% ● 수업 활동유형 강의 80% 실험 10% 실습 10% 팀프로젝트 0% 발표 0% 토론 % 기타1() 0% 기타2() 0% 기타3() 0% 총계 100 % 번호 내용 1 2단계 논리 최적화 소프트웨어를 Tablular Method에 기반한 알고리즘으로 작성 구현하면 성적 상향 조정 (100점 만점에 10점 상향) - 14주차까지 소스코드와 프로그램 사용법 및 소스코드 설명 문서를 제출해야 함. - 사용하는 언어는 자바, C++, Python 등 무관함 2 스키매틱 그리기 및 논리시뮬레이션 과제 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-04 2024-03-07 Introduction to logic and digital design /Truth table, don't care conditions, number systems, codes 2 2024-03-11 2024-03-14 Boolean algebra, manipulation and simplification of algebraic functions/ Converting truth table to Boolean algebra, logic gates-AND,OR and NOT gates Quiz#1 3 2024-03-18 2024-03-21 Logic gates-NAND,NOR, and XOR gates, NAND-only circuit conversion, 2-level SOP or POS logic circuit minimization 4 2024-03-25 2024-03-28 Using Schematic Tool(CedarLogic), Minimization using The Karnaugh map Homework#1 5 2024-04-01 2024-04-04 Iterative systems, delay in combinational logic circuits, adders/ Subtractors, comparators 6 2024-04-08 2024-04-11 Binary decoders, binary encoders, priority encoders/ Multiplexers and demultiplexers, three-state gates, gate arrays Homework#2 7 2024-04-15 2024-04-18 Data path design using combinational building blocks 8 2024-04-22 2024-04-25 Lab Experiments(1) midterm exam 9 2024-04-29 2024-05-02 Lab Experiments (2) Lab report 10 2024-05-06 2024-05-09 Latches & Flip flop 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 11 2024-05-13 2024-05-16 Flip-Flop and register simulation 12 2024-05-20 2024-05-23 Analysis of sequential systems(Mealy machine, Moore machine) QUiz #2 13 2024-05-27 2024-05-30 Counters & registers design 14 2024-06-03 2024-06-06 FSM design and implementation Quiz #3 15 2024-06-10 2024-06-13 Controller design using FSM 16 2024-06-17 2024-06-20 Review/Final final exam 5"
  },
  {
    "file_name": "1.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/1.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 데이타구조 코드 ECE20010 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 2 분반 01 인정전공 AI융합(33),/데이터사이언스(33),/컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨터공학 (40 학점구성 총학점 이론 실험/실습 설계 기타() 3 2 1 0 0 수업주유형 강의, 실습 선수과목 필수 C프로그래밍 병수과목 권장 주관교수성명 김호준 주관교수 Email hjkim@handong.edu 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 김호준 hjkim@handong.edu 1373 NTH 304 TA성명 류정현 TA email poly0112@handong.ac.k r 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 The students understand widely used data structures and algorithms. 2 The students can use widely known data structures to build medium-size programs. 3 The students understand the concepts of algorithms and abstract data type. ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) In this course, basic concept of data structures and the algorithms to manipulate them are provided. The students are also provided with many chances to practice C++ programming skill. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 게시된 강의 자료 저자 출판사 출판년도 부교재 서명 Fundamentals of Data Structures in C++ 저자 Horowitz, Sahni, Mehta 출판사 Silicon Press 출판년도 2008 기자재 ● 평가 출석관리 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(실습) 기타2(기타 2) 5 27 28 20 10 10 Honor Code 준수 및 평가방법 추가설명 ● 수업 활동유형 강의 65% 실험 % 실습 35% 팀프로젝트 % 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-04 2024-03-07 Basic Concepts 2 2024-03-11 2024-03-14 Arrays and Structures 3 2024-03-18 2024-03-21 Introduction to C++ 4 2024-03-25 2024-03-28 Introduction to C++ 5 2024-04-01 2024-04-04 Stacks and queues 6 2024-04-08 2024-04-11 Linked Lists 7 2024-04-15 2024-04-18 Linked Lists, Trees 8 2024-04-22 2024-04-25 Trees Midterm Exam. 9 2024-04-29 2024-05-02 Trees 10 2024-05-06 2024-05-09 Trees 11 2024-05-13 2024-05-16 Graphs 12 2024-05-20 2024-05-23 Sorting 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 13 2024-05-27 2024-05-30 Sorting 14 2024-06-03 2024-06-06 Hashing 15 2024-06-10 2024-06-13 Efficient Binary Search Trees 16 2024-06-17 2024-06-20 Final Exam. 5"
  },
  {
    "file_name": "3.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/3.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 프로그래밍 스튜디오 코드 ECE20025 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 2 분반 01 인정전공 컴퓨터공학(33),/컴퓨터공학(40),/컴퓨터공학(45),/AI·컴퓨터공학심화(60), 학점구성 총학점 이론 실험/실습 설계 기타() 2 1 1 0 0 수업주유형 강의, 실습 선수과목 필수 C프로그래밍 병수과목 권장 주관교수성명 장소연 주관교수 Email jerry1004@handong.edu 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 장소연 NTH 205 목 5, 6 TA성명 TA email 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 컴퓨터공학 전공 진입생들에게 프로그래밍에 대한 숙련도를 높이기 위해 단계별 실습을 통한 문제해결 능력을 훈련한다. 2 데이터구조 및 알고리즘 등의 전공 교과목을 이해하는데 필요한 프로그래밍 능력을 갖추게 한다. 3 오픈소스 관리, 통합개발환경, Linux 사용법 등을 학습한다. ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) 본 교과목에서는 컴퓨터공학의 전공기초 수업인 Java, 데이터구조 학습에 따른 실습 교육을 위주로 프로그래밍 실력의 기본기를 갖춘 다. 이를 위해 전공 수업에서 다루는 여러 주제들을 바탕으로 기본적인 코딩능력 향상 및 버전관리, 기초적인 알고리즘 구현 방법, 그리고 객체지향 설계 프로그래밍에 대해 실습문제 해결을 통해 연습하게 된다. 이 수업은 C프로그래밍 교과목을 수강하고 컴퓨터공학 전공으로 진입하는 학생들을 위해 운영되는 스튜디오형 수업의 2단계 교과목 이다. 3시간 2학점 이론/실습수업으로 진행되며, 단계별로 제시되는 실습 미션, 연습문제, 라이브코딩테스트로 구성되며, 매 수업마다 자바와 데이터구조 실습에 대한 필요한 핵심내용을 설명한 후, 실전 문제를 해결하는 실습으로 진행한다. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 저자 출판사 출판년도 부교재 서명 저자 출판사 출판년도 기자재 ● 평가 출석관리 출석관리 -출석 : 4회 결석 부터 F학점(25%이상 결석시 F) -지각 *수업 시작시점으로부터 5분 이상 늦은 경우 지각 처리 *수업 시작시점으로부터 20분 이상 늦은 경우 결석 처리 *수업 종료시점에서 10분 이전에 퇴실한 경우 무단조퇴 처리 *2회 지각 또는 무단조퇴마다 1회 결석으로 처리 -온라인 수업 진행의 경우 출석 인정 기준 *Zoom 참석 시 Video ON 필수 (Video OFF 시간만큼 불참으로 간주하여 시간에 따라 지각, 무단조퇴 또는 결석으로 처리함) *Zoom 참석 기록 (반드시 handong.edu 메일계정으로 로그인한 후 참여할 것. 로그인 없이 들어온 경우 결 석 처리) - 출결체크용 LMS 수업동영상의 경우 LMS 상에서 자동 출석 검사 -공인출석 인정 기준 *결석일 24시간 이전에 허락받은 경우에 한해서, 결석 후 1주일 내에 공식 확인서류 제출 시 인정함. 사후 통 보 시 불인정함. 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타 1(Coding Test) 기타 2(Project) 10 20 20 20 30 ● 수업 활동유형 강의 25% 실험 % 실습 75% 팀프로젝트 % 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-05 2024-03-08 · Orientation · C programming review 2 2024-03-12 2024-03-15 · C console CRUD programming · make utility 3 2024-03-19 2024-03-22 · version control system (git) · git commands 4 2024-03-26 2024-03-29 · github basic · git & github 연동 5 2024-04-02 2024-04-05 · Java - Console Input & Output (Scanner, System.in, System.out) · C++ - Console Input & Output (iostream) 6 2024-04-09 2024-04-12 · Java - Condition · C++ - Array, Pointer 7 2024-04-16 2024-04-19 · Java - Iteration (array) · C++ - Classes 8 2024-04-23 2024-04-26 · Live coding test1(Java) · Live coding test2(C++) 9 2024-04-30 2024-05-03 · Java - String · C++ - Stack with array 10 2024-05-07 2024-05-10 · Java - Inheritance (Classes, Interfaces) · C++ - Stack with linked list 11 2024-05-14 2024-05-17 · Java - Overriding & Overloading · C++ - Queue with array 12 2024-05-21 2024-05-24 · Java - Interface · C++ - Queue with linked list 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 13 2024-05-28 2024-05-31 · Java - Collection (ArrayList) · C++ - Sorting 14 2024-06-04 2024-06-07 · Java - File I/O (Reader, Writer, FileStream) · C++ - Binary Tree 15 2024-06-11 2024-06-14 · Java - external library · C++ - STL 16 2024-06-18 2024-06-21 · Term project 5"
  },
  {
    "file_name": "2.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/한동대학교_전산전자공학부/2.pdf",
    "num_pages": 5,
    "content": "강의계획서 교과목명 자바프로그래밍언어 코드 ECE20016 개설년도 2024 개설학기 1 개설학부 이수구분/영역 / 대상학년 2 분반 01 인정전공 컴퓨터그래픽스 & 디자인,/ICT융합(33),/컴퓨터공학(33),/전자공학(33),/전자공학심화(60),/컴퓨 터공학 학점구성 총학점 이론 실험/실습 설계 기타() 3 3 0 0 0 수업주유형 강의, 실습 선수과목 필수 C 프로그래밍 병수과목 권장 주관교수성명 남재창 주관교수 Email jcnam@handong.edu 담당교수 성명 담당교수 Email 담당교수 전화 Office 위치 Office Hour 김기석 peterkim@handong.edu 1398 NTH 403 목 3,4 TA성명 나보림 TA email 22000216@handong.ac. kr 강의실 강의시간 1. 과목 기본 정보(Basic Course Information) 2. 학습목표 및 개요(Course Objectives) 번호 학습목표 1 자바프로그래밍을 통한 기본 어플리케이션 설계 구현능력을 키운다. 2 자바를 통해서 실제 프로그래밍의 능력을 제고한다. 3 자바프로그래밍 언어의 기본 언어구조를 익힌다. 4 자바프로그래밍을 통해 객체지향 프로그래밍의 기본 개념을 익힌다. ● 학습목표(Course Objective) 역량 학습성과 조회된 데이터가 없습니다. ● 연관 학습성과(Related Learning Outcomes) ● 강의개요(Course Description) This course is designed to teach how to write software in Java programming language. It is intended to provide students with practical programming experiences in Java. It covers the important programming paradigms of the structured programming, object-oriented programming, class design, abstraction, and software reuse. The lectures will be performed in a classroom environment rather than in a computer lab. However, students are expected to use their own computers or to access the lab in the department freely. Students may use Java on any platforms such as UNIX, Linux, and Windows operating systems. 3. 과목 운영 및 과제물 ● 교재 주교재 서명 JAVA : AN INTRODUCTION TO Problem Solving & PROGRAMMING 저자 Walter Savitch 출판사 prentice Hall 출판년도 eighth Edi 부교재 서명 저자 출판사 출판년도 기자재 ● 평가 출석관리 지각 2회는 결석 1회, 수업시간에 조는 등의 행위 : 지각 1회에 해당함 Attendance will be checked from time to time. There will be a penalty for a missing class or late class attendance. The class attendance will be highly recommended. One tardy and absence are allowed without an excuse without penalty. Another one tardy and absence with an excuse such as doctor’s appointment and job interview are allowed without penalty. Oversleeping, hangover, birthday, cold, or body ache would not be considered as an excuse.$ 학점산출 평가 도구 및 비중(%) 출석 중간시험 기말시험 퀴즈 팀프로젝트 개인과제 기타1(랩 ) 기타2(기타 2) 5 20 20 20 15 20 Honor Code 준수 및 평가방법 추가설명 개인과제로 assign되는 프로그래밍 과제 제출시 타인의 코드를 일부라도 그대로 복사하여 사용하는 경우, 양 쪽 모두에게 미제출로 채점됨 ● 수업 활동유형 강의 70% 실험 % 실습 30% 팀프로젝트 % 발표 % 토론 % 기타1() % 기타2() % 기타3() % 총계 100 % 번호 내용 1 ● 과제 및 프로젝트(Assignments and Projects) 4. 강의 일정 계획(Weekly Schedule) 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 1 2024-03-05 2024-03-08 Introduction to Java 2 2024-03-12 2024-03-15 Basic Computation 레포트#01 3 2024-03-19 2024-03-22 Flow of Control : Branching 레포트#02 4 2024-03-26 2024-03-29 Flow of Control : loop 레포트#03,퀴즈#1 5 2024-04-02 2024-04-05 Class and Methods 레포트#04 6 2024-04-09 2024-04-12 Objects and Methods 레포트#05 7 2024-04-16 2024-04-19 Arrays 레포트#06 8 2024-04-23 2024-04-26 Inheritance, Polymorphism and Interfaces 중간고사 중간고사 9 2024-04-30 2024-05-03 Exception 레포트#07 10 2024-05-07 2024-05-10 Streams 레포트#08 11 2024-05-14 2024-05-17 Recursion 레포트#09 12 2024-05-21 2024-05-24 Dynamic Data structure and Generics 퀴즈#2 레포트#10 주차 날짜 강의주제 및 범위 과제 결과물 및 평가 13 2024-05-28 2024-05-31 WIndow Interfaces Using Swing 레포트#11 14 2024-06-04 2024-06-07 More Swing 레포트#12 15 2024-06-11 2024-06-14 Threads 레포트#13 16 2024-06-18 2024-06-21 기말고사 기말고사 5"
  },
  {
    "file_name": "9.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/9.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 객체지향프로그래밍(Object Oriented Programming) 개설학년 2학년 전공능력 전공능력 대표성 객체지향프로그래밍은 객체지향 개념인 클래스(Class), 추상화(Abstraction), 상속 (Inheritance), 다형성(Polymorphism)등을 소개하고, 이를 지원하는 객체지향 언어 및 객체기반 인터넷(웹) 프로그래밍 기법을 학습한다. 객체지향 언어로는 최근 많이 사용 되는 C++,Java언어를 학습하게 되며 이를 통해 비객체지향 언어와의 본질적인 차이를 비교 이해함으로써 객체지향 언어의 구조, 설계/구현 기술을 익힌다. 아울러 이를 바탕 으로 한 객체기반 인터넷(웹)프로그래밍의 핵심인 쓰레드(Thread), 애플릿(Applet), 서 블릿(Servelet), CGI 프로그래밍 및 분산형 컴포넌트(Distributed components)를 활 용한 프로그래밍 기법을 다룬다. 지식응용 연관 전공능력 설계능력 연관 전공능력 자원활용 대표 전공능력 영향이해 의사전달 문제정의 직업윤리 분석실험 평생학습 협동능력 수업목표 주 수업내용 1 시작 통합개발환경(이쿨립스 포함) 설치 및 사용법 프로젝트 생성 온라인강의 Eclipse 2 Java 프로그래밍 기초 온라인강의 Eclipse 3 변수, 연산자, 수식 관련 문법 강의 및 실습 Eclipse 4 조건 및 반복문의 이해 강의 및 실습 Eclipse 5 클래스/객체 개념 필드/메소드의 이해 강의 및 실습 Eclipse 6 상속 인터페이스와 다형성 강의 및 실습 Eclipse 7 그래픽 사용자 인터페이스: 배치관리자 및 이벤트 처리 강의 및 실습 Eclipse 8 중간고사 시험 9 그래픽 사용자 인터페이스: 이벤트 처리 및 스윙 컴포넌트 강의 및 실습 Eclipse 10 예외 처리 강의 및 실습 Eclipse 11 제네릭과 콜렉션 1 강의 및 실습 Eclipse 12 보강주간 13 제네릭과 콜렉션 2 강의 및 실습 Eclipse 14 데이터베이스 프로그래밍 1 강의 및 실습 Eclipse 15 데이터베이스 프로그래밍 2 강의 및 실습 Eclipse 16 기말 고사 시험"
  },
  {
    "file_name": "8.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/8.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 이산수학(Discrete Mathematics) 개설학년 2학년 전공능력 전공능력 대표성 컴퓨터 공학에 공통적으로 적용되는 논리, 집합, 함수관계 그래프 등을 익히고 컴퓨터 공학 전반에 관한 적용 능력을 기른다. 지식응용 연관 전공능력 문제정의 대표 전공능력 자원활용 연관 전공능력 영향이해 의사전달 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 Overview Lecture Textbook 2 Logic I Lecture Textbook 3 Logic II Lecture Textbook 4 Sets Lecture Textbook 5 Integers Lecture Textbook 6 Induction and Recursion Lecture Textbook 7 Counting Lecture Textbook 8 Review and Evaluation Lecture, Exam Textbook 9 Discrete Probability Lecture Textbook 10 Functions Lecture Textbook 11 Relations Lecture Textbook 12 보강주간 13 Graphs Lecture Textbook 14 Trees Lecture Textbook 15 Review Lecture Textbook 16 Review and Final Exam Lecture,Exam Textbook"
  },
  {
    "file_name": "16.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/16.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 신호및시스템(Signals and Systems) 개설학년 3학년 전공능력 전공능력 대표성 이 교과목의 목적은 연속시 및 이산시 선형시스템을 설계하고 해석하는데 필요한 분석 기법들을 계발하는 것이다. 이 교과목의 주 내용은 콘볼류션, 변환 그리고 표본화 이 론 등이다. 구체적으로 보면, 연속시 시스템에 관련하여, 신호와 시스템의 분류, 콘볼류 션, 미분방정식, 푸리에 급수, 푸리에 변환, 쌍방향 라플라스 변환, 그리고 선형회로를 중심으로 연속시 선형시스템의 설계 및 분석 등을 학습한다. 또한 연속시 신호의 이산 시 처리, 차분방정식, 쌍방향 Z변환등 기초적인 이산시 시스템 관련 내용들을 학습한 다. 지식응용 대표 전공능력 설계능력 연관 전공능력 영향이해 의사전달 문제정의 직업윤리 자원활용 분석실험 평생학습 협동능력 수업목표 주 수업내용 1 Introduction Lecture 2 Signals and Systems Lecture 3 Convolution Lecture 4 Linear, Time-Invariant Systems Lecture 5 Continuous-Time Fourier Series Lecture 6 Continuous-Time Fourier Transform Lecture 7 Discrete-time Fourier Series Discrete-time Fourier Transform Lecture 8 Midterm Examination Examination 9 Fourier Transform Properties Lecture 10 Filtering Lecture 11 Sampling and Interpolation 12 보강주간 Lecture 13 The Laplace Transform Lecture 14 The z-Transform Lecture 15 Feedback and Review Lecture 16 Final Examination Examination"
  },
  {
    "file_name": "17.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/17.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 운영체제(Introduction to Operating Systems) 개설학년 3학년 전공능력 전공능력 대표성 운영체제의 설계와 구현 방법을 익힌다. 운영체제는 메모리, 파일, 프로세서, 입출력 장 치, 네트워크 장치 등의 컴퓨터 자원을 관리하여 다수의 프로세스들이 서로 통신하며 안전하고 효율적으로 교착상태에 이르지 않고 작업할 수 있도록 하며 이와 관련된 기본 적 문제들을 다룬다. 지식응용 연관 전공능력 설계능력 대표 전공능력 문제정의 연관 전공능력 자원활용 연관 전공능력 영향이해 의사전달 직업윤리 분석실험 평생학습 협동능력 수업목표 주 수업내용 1 운영체제의 시작과 발전 대면 강의 명품 운영체제 황기태 저 2 컴퓨터 시스템과 운영체제 대면 강의 명품 운영체제 황기태 저 3 프로세스와 프로세스 관리 대면 강의 명품 운영체제 황기태 저 4 스레드와 멀티스레딩 대면 강의 명품 운영체제 황기태 저 5 CPU 스케줄링 대면 강의 명품 운영체제 황기태 저 6 스레드 동기화 대면 강의 명품 운영체제 황기태 저 7 교착상태 대면 강의 명품 운영체제 황기태 저 8 중간 고사 대면 강의 명품 운영체제 황기태 저 9 메모리 관리 대면 강의 명품 운영체제 황기태 저 10 페이징 메모리 관리 대면 강의 명품 운영체제 황기태 저 11 가상 메모리 대면 강의 명품 운영체제 황기태 저 12 보강주간 13 파일 시스템 관리 대면 강의 명품 운영체제 황기태 저 14 대용량 저장 장치 관리 대면 강의 명품 운영체제 황기태 저 15 강의 요약 대면 강의 명품 운영체제 황기태 저 16 기말 고사 대면 강의 명품 운영체제 황기태 저"
  },
  {
    "file_name": "29.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/29.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 전기기기(Electric Machine) 개설학년 4학년 전공능력 전공능력 대표성 최근 빠르게 발전하는 자율 주행 기술과 전기 자동차 기술은 가까운 미래에 4차 산업혁 명이라 불릴 정도로 우리 생활상을 급변 시킬 것으로 예상되고 있다. 이러한 자율 주행 자동차의 구동에 있어 핵심 부품인 모터는 전기 에너지를 기계적 에너지로 변환 시켜 주며 이는 대표적인 전기기기이다. 이처럼 전기 에너지를 기계적 에너지로 또는 기계적 에너지를 전기에너지로 변환 시켜 주는 시스템을 전기기기라 하며 여기에는 직류 모 터, 교류 모터, 변압기 등이 포함 된다. 본 교과에서는 이러한 전기기기의 에너지 변환 원리 및 간단한 직류기와 교류모터의 동작 원리를 알아보고, 전기 자동차, 전기 철도 등 운송 시스템에 사용되는 최신 전기기기의 기술 동향에 대해서 소개한다. 지식응용 연관 전공능력 분석실험 연관 전공능력 설계능력 연관 전공능력 문제정의 대표 전공능력 자원활용 연관 전공능력 평생학습 연관 전공능력 영향이해 의사전달 직업윤리 협동능력 수업목표 주 수업내용 1 Introduction 2 직류 전동기의 기본 원리 3 직류 전동기의 토크 제어 1 4 직류 전동기의 토크 제어 2 5 직류 전동기의 토크 제어 3 6 BLDC 전동기 7 Project 8 중간고사 9 교류 전동기의 회전 원리 1 10 교류 전동기의 회전 원리 2 11 교류 전동기의 회전 원리 3 12 보강주간 13 교류 전동기의 회전 원리 4 14 교류 전동기의 모델링 1 15 교류 전동기의 모델링 2 16 기말고사"
  },
  {
    "file_name": "15.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/15.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 반도체소자(Semiconductor Devices) 개설학년 3학년 전공능력 전공능력 대표성 다양한 반도체 소자들이 가지는 전기적 특성에 대한 이해를 위해, 고체전자물리에 대한 배경 지식을 간략히 복습한 뒤, PN-Junction Diode, Metal-Semiconductor (MS) Diode, Bipolar Junction Transistor (BJT), Metal-Oxide-Semiconductor Field Effect Transistor (MOSFET)와 같은 다양한 반도체 소자들의 동작원리 및 응용에 대해 학습한 다. 지식응용 대표 전공능력 자원활용 연관 전공능력 영향이해 의사전달 문제정의 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 반도체 내의 전자와 정공 강의 현대반도체소 자공학 2 반도체 내의 전자와 정공 강의 현대반도체소 자공학 과제 1 3 전자 및 정공의 운동과 재결합 강의 현대반도체소 자공학 과제 2 4 PN 접합 강의 현대반도체소 자공학 5 PN 접합 강의 현대반도체소 자공학 6 PN 접합 강의 현대반도체소 자공학 과제 3 7 MOS 커패시터 강의 현대반도체소 자공학 8 중간고사 9 MOS 커패시터 강의 현대반도체소 자공학 과제 4 10 MOS 트랜지스터 강의 현대반도체소 자공학 11 MOS 트랜지스터 강의 현대반도체소 자공학 과제 5 12 보강주간 13 집적회로에서의 MOSFET 강의 현대반도체소 자공학 14 집적회로에서의 MOSFET 강의 현대반도체소 자공학 과제 6 15 바이폴라 트랜지스터 강의 현대반도체소 자공학 과제 7 16 기말고사"
  },
  {
    "file_name": "14.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/14.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 전자장2(Electromagnetic Fields Ⅱ) 개설학년 3학년 전공능력 전공능력 대표성 본 강좌에서는 시간에 따른 전류 또는 전압의 변화가 있는 경우인 시변전자장에 중점을 두어 강의한다. 이는 광공학 및 초고주파공학에 필요한 기초 과목으로 전파 현상에 대 한 개념을 정립하고 기본 소자에 대한 내용 및 응용을 공부한다. 이를 위하여 Faraday 법칙과 Maxwell-Ampere 법칙 및 전류연속방정식, Constitutive relation으로부터 전 파방정식을 도출하고 이 방정식을 바탕으로 평면파, 도파관, 안테나 및 전송선로에 대 한 전파성질을 집중적으로 다룬다. 평면파에서는 경계면에서의 반사 및 투과 성질을 다 루고 도파관 문제에서는 구형 도파관에서의 전파의 도파성질을 취급한다. 안테나는 안 테나의 특성을 설명하여주는 제 파라메터에 대한 개념을 정리한다. 전송선문제는 분포 정수회로의 전파특성을 주로 공부하고 스미스차트의 이해 및 응용을 취급한다. 지식응용 대표 전공능력 자원활용 연관 전공능력 영향이해 의사전달 문제정의 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 Introduction to time varying electromagnetics. 강의 2 Time varying fields- Faraday's law Time varying Maxwell's Equations Potential functions Boundary conditions 강의 3 Wave equations and solutionsTime harmonic fields 강의 4 Plane wave in time domain 강의 과제물 또는 Quiz 5 Plane wave in frequency domain 강의 6 Plane waves in media Poyinting theorem 강의 7 Plane wave incidence at a plane boundary 강의 8 중간시험 강의 9 Transmission line theory-Transmission line equations and their solutions 강의 10 Wave characteristics on finite transmission lines. Transients on transmission lines. 강의 11 Smith Charts - 기본 원리 강의 12 보강주간 13 Smith Charts - 응용 강의 과제물 또는 Quiz 14 Parallel plate waveguides 강의 15 Rectangular waveguides 강의 16 기말시험 강의"
  },
  {
    "file_name": "28.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/28.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 형식언어및컴파일러(Formal Languages and Compilers) 개설학년 4학년 전공능력 전공능력 대표성 유한오토마타, 푸시다운오토마타, 정규언어, 비문맥언어, 튜링머신 등의 컴파일러 기 초이론을 학습하며, 컴파일러의 구조와 컴파일러의 주요 구성요소인 어휘 분석, 구문 분석, 의미 분석, 코드생성, 최적화 등의 각 단계의 역할과 원리를 다룬다. 또한 컴파일 러 자동 생성도구를 활용하여 소규모 컴파일러를 구현하는 기술을 습득한다. 지식응용 대표 전공능력 자원활용 연관 전공능력 영향이해 의사전달 문제정의 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 Introduction Lecture Textbook 2 Lexical Analysis I Lecture Textbook 3 Lexical Analysis II Lecture Textbook 4 Context-free Grammars Lecture Textbook 5 Top-down Parsing I Lecture Textbook 6 Top-down Parsing II Lecture Textbook 7 Bottom-up Parsing Lecture Textbook 8 Review and Evaluation Questions and Answers, Test Textbook 9 Abstract Syntax Trees Lecture Textbook 10 Semantic Analysis I Lecture Textbook 11 Semantic Analysis II Lecture Textbook 12 보강주간 13 Assembly Trees Lecture Textbook 14 Code Generation Lecture Textbook 15 Memory Management Lecture Textbook 16 Review and Final exam Questions and Answers, Test Textbook"
  },
  {
    "file_name": "10.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/10.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 마이크로프로세서(Microprocessors) 개설학년 2학년 전공능력 전공능력 대표성 마이크로프로세서 설계에 필요한 논리설계와 디지털시스템 설계 기술을 익히고 이를 응용할 수 있는 능력을 기른다. 지식응용 연관 전공능력 설계능력 연관 전공능력 문제정의 대표 전공능력 자원활용 연관 전공능력 영향이해 의사전달 직업윤리 분석실험 평생학습 협동능력 수업목표 주 수업내용 1 Introduction and Digital Circuits Lecture. Discussion Textbook 2 Combinational Logic Circuits I Lecture. Discussion Textbook 3 Combinational Logic Circuits II Lecture. Discussion Textbook 4 Combinational Logic Design III Lecture. Discussion Textbook 5 Sequential Circuits Lecture. Discussion Textbook 6 Registers and Register Transfers I Lecture. Discussion Textbook 7 Registers and Register Transfers II Lecture. Discussion Textbook 8 Review and Midterm Examination, Discussion Textbook 9 Memory Basics Lecture. Discussion Textbook 10 Computer Design Basics I Lecture. Discussion Textbook 11 Computer Design Basics II Lecture. Discussion Textbook 12 보강주간 13 Instruction Set Architecture I Lecture. Discussion Textbook 14 Instruction Set Architecture II Lecture. Discussion Textbook 15 RISC and CISC Examination Textbook 16 Review and Final Examination, Discussion Textbook"
  },
  {
    "file_name": "11.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/11.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 전자장1(Electromagnetic Fields Ⅰ) 개설학년 2학년 전공능력 전공능력 대표성 전자공학의 근본 학문인 전자기학은 다른 전자공학 과목을 공부하는 데에 필수적인 과 목이다. 본 강좌에서는 정적 상태인 정전장과 정자장을 공부한다. 정전장 분야에서는 전하, 전계의 세기, 전위, 전속밀도 등 제 물리량과, 이들을 지배하는 쿨롱법칙, 가우스 법칙 등 제 법칙에 대한 개념을 정립하고 이들을 계산하는 방법에 대하여 살펴본다. 정 자장 분야에서는 전류, 자계의 세기, 벡터포텐셜, 자속밀도 등 제 물리량을 포함하여 비 오사바트 법칙 및 암페어 법칙 등 지배방정식에 대하여 공부한다. 또한 도체, 유전체, 자성체 등의 물질에 대한 구분과 각 물질 내에서의 제 물리량 상호관계에 대하여 알아 본다. 저항, 정전용량 및 자기용량에 대한 개념 및 응용에 대하여 알아본다. 지식응용 대표 전공능력 자원활용 연관 전공능력 영향이해 의사전달 문제정의 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 Introduction & Vector Algebra Lecture with PPT 2 Coordinate Systems and Transformation Lecture with PPT 3 Vector Calculus Lecture with PPT 4 Electrostatic Fields Lecture with PPT 5 Electrostatic Fields Lecture with PPT 6 Electric Fields in Material Space Lecture with PPT 7 Electric Fields in Material Space Lecture with PPT 8 Midterm Exam. Exam. 9 Electrostatic Boundary Value Problems Lecture with PPT 10 Electrostatic Boundary Value Problems Lecture with PPT 11 Magnetic Fields Lecture with PPT 12 보강주간 13 Magnetic Forces, Materials, and Devices Lecture with PPT 14 Maxwell's Equations Lecture with PPT 15 Special Topics Lecture with PPT 16 Final Exam. Exam."
  },
  {
    "file_name": "13.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/13.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 전자회로1(Electronic Circuits I) 개설학년 3학년 전공능력 전공능력 대표성 다이오드, 바이폴라 트랜지스터 및 FET에 대한 동작 특성을 살펴보며 능동 소자에 대한 이해를 도모하고 기본적인 전자회로의 설계 능력을 배양한다. 다양한 다이오드 회로를 통해 정류 회로 및 파형 변형 회로의 동작을 살펴본다. 트랜지스터 증폭기 회로를 분석 함으로써 바이어스 회로 및 소신호 등가 회로에 대해 학습한다. 지식응용 연관 전공능력 문제정의 연관 전공능력 자원활용 대표 전공능력 영향이해 의사전달 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 * 강의 개요 소개 * CH2 Operational Amplifiers - Op Amp 기본 회로 분석 1 이론 2 * CH2 Operational Amplifiers - Op Amp 기본 회로 분석 2 이론 과제 1 3 * CH2 Operational Amplifiers 2 - Op Amp 기본 회로 분석 3 이론 과제 2 4 * CH3 Diodes 1 이론 5 * CH3 Diodes 2 이론 과제 3 6 * CH3 Diodes 3 이론 7 * CH 5 MOS Field-Effect Transistors 1 이론 과제 4 8 * 중간 시험 중간 시험 9 * CH 5 MOS Field-Effect Transistors 2 이론 과제 5 10 * CH 5 MOS Field-Effect Transistors 3 이론 11 * CH6 Transistor Amplifiers 1 이론 과제 6 12 보강주간 13 * CH6 Transistor Amplifiers 2 이론 과제 7 14 * CH6 Transistor Amplifiers 3 이론 15 * CH 4 Bipolar Junction Transistors 이론 과제 8 16 * 기말 시험 기말 시험"
  },
  {
    "file_name": "12.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/12.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 고체전자물리(Solid-State Physical Electronics) 개설학년 2학년 전공능력 전공능력 대표성 PN-Junction Diode, Metal-Semiconductor (MS) Diode, Bipolar Junction Transistor (BJT), Metal-Oxide-Semiconductor Field Effect Transistor (MOSFET), Semiconductor Lasers, Photo-Detector와 같은 다양한 반도체 소자들의 동작원리를 이해하기 위해 필요한 기초적인 고체전자물리에 대해 학습한다. 특히, 반도체 소자에 사용되는 다양한 반도체 재료의 물성에 대한 학습, 그리고 반도체 소자의 동작원리를 이해하는 데에 필요한 Bonding-Model 및 Energy Band Diagram, Doping, Drift/ Diffusion, Generation/ Recombination 등 기초적인 물리 현상에 대해 학습한다. 지식응용 대표 전공능력 자원활용 연관 전공능력 영향이해 의사전달 문제정의 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 Crystal Properties and growth of semiconductors Lecture with PPTs 2 Crystal Properties and growth of semiconductors Lecture with PPTs 3 Atoms and Electronics Lecture with PPTs 4 Atoms and Electronics Lecture with PPTs 5 Energy Bands in Semiconductors Lecture with PPTs 6 Charge Carriers in Semiconductors Lecture with PPTs 7 Charge Carriers in Semiconductors Lecture with PPTs 8 Charge Carriers in Semiconductor 9 Excess Carriers in Semiconductors Lecture with PPTs 10 Diffusion of Carriers Lecture with PPTs 11 Diffusion of Carriers Lecture with PPTs 12 보강주간 13 p-n Junction in equilibrium condictions Lecture with PPTs 14 Biased p-n junction Lecture with PPTs 15 Metal-semiconductor junction Lecture with PPTs 16 Final-term Exam"
  },
  {
    "file_name": "23.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/23.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 광전자공학(Optical Eletronics) 개설학년 4학년 전공능력 전공능력 대표성 광전자공학(Optical Electronics)는 광(Optics)과 전자공학(Electronics)의 합성어로서 빛과 전자와의 관계를 알아보고, 현재 광전자 기술의 원리를 이해하고 그 응용 분야를 탐구하는 강의입니다. 본 강의는 국내 유관 첨단기술 개발 현황을 파악하기 위하여 산 업체 전문가 초청강연, COEX Word IT Show 단체 관람, 한국과학기술연구원 역사관 (KISTORIUM) 단체 방문 등의 특별 프로그램을 포함하여 진행됩니다. 지식응용 대표 전공능력 자원활용 연관 전공능력 영향이해 의사전달 문제정의 직업윤리 분석실험 설계능력 평생학습 협동능력"
  },
  {
    "file_name": "22.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/22.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 집적회로설계(Introduction to Integrated Circuit Design) 개설학년 4학년 전공능력 전공능력 대표성 집적회로 설계에 관한 기본적인 이론 및 설계 기법을 강의한다. CMOS 트랜지스터 소 자 특성 및 제작 방법에 대하여 배운다. 인버터 회로를 통해 CMOS 트랜지스터 회로에 대한 분석을 수행하며 CMOS 트랜지스터를 사용한 다양한 조합 회로 및 순차 회로의 설계에 대하여 배운다. Simulation 과 Layout 실습 과정을 통해 집적회로 설계 기법을 다룬다. 지식응용 연관 전공능력 설계능력 대표 전공능력 문제정의 연관 전공능력 자원활용 연관 전공능력 영향이해 의사전달 직업윤리 분석실험 평생학습 협동능력 수업목표 주 수업내용 1 * 강의 개요 소개 * MOFET 소자의 동작 - 기본 동작 원리 이론 2 * MOFET 소자의 동작 - 기본 동작 원리 * CMOS 소자 및 구조 이론 과제 1 3 * CMOS 소자 및 구조 * MOFET 소자의 동작 - 2차 효과 및 구현 이론 4 * MOFET 소자의 동작 - 2차 효과 및 구현 이론 과제 2 5 * 인버터 회로 분석 - 정적 특성 이론 6 * 인버터 회로 분석 - 동적 특성 * CMOS 인버터 회로 분석 이론 과제 3 7 * CMOS 인버터 성능 분석 이론 과제 4 8 * 중간 시험 중간 시험 9 * 기본 로직 회로 설계 이론 과제 5 10 * 조합 회로 설계 1 이론 11 * 조삽 회로 설계 2 이론 과제 6 12 보강주간 13 * 순차 회로 설계 1 이론 과제 7 14 * 순차 회로 설계 2 이론 15 * 시스템 설계 분석 이론 과제 8 16 기말 시험 시험"
  },
  {
    "file_name": "20.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/20.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 딥러닝기초(Introduction to Deep Learning) 개설학년 3학년 전공능력 전공능력 대표성 최근 차세대 통신, 자연어 처리, 컴퓨터 비젼, 신호처리 등 다양한 분야에서 딥러닝 기 법이 활용되고 있다. 이에 고급 선형대수, 고급 확률 이론, 최적화 기법 머신러닝 등 딥 러닝 설계에 필수적인 기본 이론들을 이해하고 이를 적용한 응용 분야들을 학습해야 할 필요성이 대두되었다. 이 과목에서는 딥러닝 기술을 위한 기본 이론에 관하여 강의 한 다. 지식응용 대표 전공능력 문제정의 연관 전공능력 자원활용 연관 전공능력 영향이해 의사전달 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 Class Overview / Introduction to machine learning & deep learning Lecture 2 Linear Algebra (1) Lecture 3 Linear Algebra (2) Lecture 4 Analytic Geometric Lecture 5 Matrix Decompositions Lecture 6 Vector Calculus (1) Lecture 7 Vector Calculus (2) Lecture 8 Midterm Exam Test 9 Probability and Distributions (1) Lecture 10 Probability and Distributions (2) Lecture 11 Continuous Optimization Lecture 12 보강주간 13 Machine Learning (1) Lecture 14 Machine Learnig (2) Lecture 15 Deep Learning Lecture 16 Final Exam Test"
  },
  {
    "file_name": "21.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/21.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 전자전기컴퓨터공학종합설계(Electrical and Computer Engineering Capstone Design) 개설학년 4학년 전공능력 전공능력 대표성 전공지식을 종합하고, 여기에 기초소양에서 습득한 경제적, 사회적, 환경적 윤리적 제 한요건 등을 고려한 종합적 작품을 설계한다. 창의적 주제를 선정해야 하며, 작품의 계 획, 제안서의 작성, 작품의 기초/상세 설계, 제작 과정 등의 체계적 방법 및 효과적인 팀 워크를 경함함으로써, 사회에 진출하여 이를 효과적으로 적용하는데 목적이 있다. 지식응용 연관 전공능력 분석실험 연관 전공능력 설계능력 대표 전공능력 문제정의 연관 전공능력 자원활용 연관 전공능력 협동능력 연관 전공능력 의사전달 연관 전공능력 평생학습 연관 전공능력 영향이해 연관 전공능력 직업윤리 연관 전공능력 수업목표 주 수업내용 1 교과목 소개 및 연구주제 소개 강의 2 제어공학/로봇공학 관련 세미나 3 제어공학/로봇공학 관련 세미나 4 제어공학/로봇공학 관련 세미나 5 제어공학/로봇공학 관련 세미나 6 조별 진행사항 점검 7 조별 진행사항 점검 8 중간 발표 9 조별 진행사항 점검 10 조별 진행사항 점검 11 조별 진행사항 점검 12 보강주간 13 조별 진행사항 점검 14 조별 진행사항 점검 15 조별 진행사항 점검 16 최종 발표"
  },
  {
    "file_name": "25.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/25.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 디지털제어(Digital Control) 개설학년 4학년 전공능력 전공능력 대표성 이산시간 시스템(Discrete Time System)의 해석 및 제어기 설계방법을 배운다. Sampled Data System 의 해석, 상태변수 모델링, 시간영역 및 주파수영역에서의 해 석, Root-Locus. Bode-Plot, Nyquist Plot, Bilinear 변환, 불연속시간 PLD 컨트롤러, 불 연속시간극배치, 상태추정기, 상태되먹임 제어기, LQR, Kalman Filter 등을 배운다. Matlab 등의 프로그램을 이용한 해석 및 설계방법을 공부한다. 지식응용 연관 전공능력 문제정의 연관 전공능력 자원활용 대표 전공능력 영향이해 의사전달 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 주 수업내용 11 [Chapter 8: Part B] 8.8. Integration and Differentiation Filters 8.9. PID Controllers 8.10. PID Controller Design 8.11. Design by Root Locus [Chapter 9: Part A] 9.1. Introduction 9.2. Pole Assignment 9.7. Systems with Inputs 강의 HW#2 마감, HW#3 출 제 12 보강주간 13 [Chapter 11: Part A] 11.1. Introduction 11.2. The Quadratic Cost Fuction 11.3. The Principle of Optimality 11.4. Linear Quadratic Optimal Control 11.5. The Minimum Principle 11.6. Steady-state Optimal Control 강의 14 [Chapter 9: Part B] 9.3. State Estimation 9.6. Controllability and Observability [Chapter 11: Part B] 11.7. Optimal State Estimation - Kalman Filters 11.8. Least-squares Minimization 강의 15 [Chapter 10] 10.1. Introduction 10.2. Identification of Static Systems 10.3. Identification of Dynamic Systems 10.4. Black-box Identification 10.5. Least-squares System Identification 강의 16 Final Exam (No Class) Final Exam (Offline), HW#3 마감"
  },
  {
    "file_name": "19.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/19.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 자기주도연구Ⅰ(Undergraduate research programme Ⅰ) 개설학년 3, 4학년 집중수업구분 성적 평가 평가방법 절대평가 □ 출석 (0%) □ 학생포트폴리오 (0%) □ 참여도 (0%) □ 수시과제 (0%) □ 수시시험 (0%) □ 중간과제 (0%) □ 중간시험 (0%) □ 기말과제 (0%) □ 기말시험 (0%) ▣ 기타 (100%) 수업유형 ▣일반 ▣PBL □외국어 □융복합 □서비스러닝 □블렌디드러닝 강의유형 대면(오프라인) 100 % 비대면(온라인) 0 % 시험유형 중간고사 대면□ 비대면□ 없음▣ 기타( 퀴즈, 수시고사 등) 대면▣ 비대면▣ 기말고사 대면□ 비대면□ 없음▣ ▣강의 ▣발표 ▣토론 □실험 □실습 □실기 ▣설계 □견학 □프로젝트 □이러닝(e-learning) 표절금지규정 ‘표절’이란 타인의 글을 적절한 인용 및 참고문헌 표기 없이 자기가 쓴 것처럼 행사하는 것으로서 도덕적 양심을 저버리는 잘못된 행위입니다. 표절한 보고서를 제출하거나 표절한 자료를 사용하여 발표한 경우 정도에 따라 감점 처리하며, 심할 경우 0점으로 처리합니다. ※ 장애학생은 원활한 학업수행을 위해 장애학생지원센터(02-6490-6273)의 도움을 받아 필요한 사항에 대해 담당교수와 협의·조정할 수 있습니다. 교과목 설명 전공능력 미설정 교과목 : 학업설계상담, 단과대학 현장실습, 학생 미래설계학기교과목, 계약학과 수업목표 주 수업내용 1 2 3 4 5 6 7 8 9 10 11 12 보강주간 13 14 15 16"
  },
  {
    "file_name": "18.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/18.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 통신공학(Communication Engineering) 개설학년 3학년 전공능력 전공능력 대표성 이 과목의 목적은 전송 채널의 특성을 이해하고, 전통적인 아날로그 통신 방식과 이의 성능을 분석하는 방법론을 습득하는 것이다. 푸리에 변환, 불규칙 신호이론 필터링 등 기초적인 통신 신호, 스펙트럼 분석을 검토한 다음, 진폭 변조/복조, 주파수 변조/복조, 위상 변조/복조 방법을 학습하고, 잡음 하에서 아날로그 통신 시스템의 성능을 분석한 다. 또한, 다중화 기법, 샘플링 이론, 펄스 아날로그 변조 기술 등을 다룬다. 지식응용 대표 전공능력 문제정의 연관 전공능력 자원활용 연관 전공능력 영향이해 의사전달 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 주파수 대역, 통신시스템의 자원 2 1. 신호 및 시스템의 기초 3 1. 신호 및 시스템의 기초 4 2. DSB, AM 5 2. SSB, VSB 6 3. FM, PLL 7 3. Superheterodyne 수신기 8 midterm 9 4. 확률변수 10 4. 확률변수 11 5. random process 12 보강주간 13 5. random process 14 6. SNR 15 6. SNR in quantization 16 기말고사"
  },
  {
    "file_name": "24.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/24.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 융합반도체기술(Semiconductor Technology: Process, Device, and Circuit) 개설학년 4학년 전공능력 전공능력 대표성 본 교과목은 반도체 소자 분야를 중심으로 반도체 공정 및 회로 설계 등 전기전자공학 전반을 이해시키고, 나아가 물리화학/에너지공학 분야의 주요 연구 주제인 태양전지를 포함한 신재생 에너지 발전 분야에 사용되는 반도체 기술을 배운다. 지식응용 연관 전공능력 분석실험 연관 전공능력 문제정의 연관 전공능력 자원활용 대표 전공능력 의사전달 연관 전공능력 영향이해 직업윤리 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 Semiconductor Fundamentals 강의 강의노트 PART 1 Ch. 01~ Ch. 02 요약 (과제 1) 2 MOSFET Device 강의 강의노트 3 MOSFET Device 강의 강의노트 PART 2 Ch. 01 요약 (과제 2) 4 Device Fabrication Technology 강의 강의노트 PART 3 Ch. 01~04 요약 (과제 3) 5 DRAM 강의 강의노트 6 DRAM 강의 강의노트 7 DRAM 강의 강의노트 8 중간고사 시험 9 NAND Flash Memory 강의 강의노트 10 NAND Flash Memory 강의 강의노트 11 NAND Flash Memory 강의 강의노트 PART 2 Ch. 02 요약 (과제 4) 12 보강주간 13 New Memory 강의 강의노트 PART 2 Ch. 03 요약 (과제 5) 14 Non-Memory Semiconductor 강의 강의노트 PART 2 Ch. 04 요약 (과제 6) 15 Packaging Technology 강의 강의노트 PART 2 Ch. 05 요약 (과제 7) 16 기말고사 시험"
  },
  {
    "file_name": "30.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/30.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 데이터통신(Data Communications) 개설학년 4학년 전공능력 전공능력 대표성 본 과목의 목적은 인터넷 등을 통하여 데이터를 전송하는데 필요한 통신 방식에 대하여 학습한다. 먼저, ISO/OSI 표준모델에 대하여 학습하여 계층화된 프로토콜의 중요성을 인지하고, ISO/OSI 표준 모델의 물리계층과 데이터링크 계층에 관련된 내용들을 중점 적으로 학습한다. 통신망의 성능모델, 통신망 설계, 프로토콜, Virtual 회로 및 Datagram, Routing, Flow 및 Congestion 제어, 그리고 근거리, 위성, 지상 통신망 등 을 위한 다중 접속 프로토콜을 다룬다. 지식응용 연관 전공능력 문제정의 대표 전공능력 자원활용 연관 전공능력 영향이해 의사전달 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 Introduction to networks, protocols, and standards 2 Basic concepts on line configuration and topology 3 Various signals and encodings 4 Interfaces and modems 5 Transmission media 6 Multiplexing 7 Error detection and correction 8 Error detection and correction 9 Data link control 10 Data link protocols 11 Local Area Networks 12 보강주간 13 Wireless LAN 14 Sonsor networks 15 TCP/IP introductions 16 기말시험"
  },
  {
    "file_name": "26.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/26.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 집적회로설계(Introduction to Integrated Circuit Design) 개설학년 4학년 전공능력 전공능력 대표성 집적회로 설계에 관한 기본적인 이론 및 설계 기법을 강의한다. CMOS 트랜지스터 소 자 특성 및 제작 방법에 대하여 배운다. 인버터 회로를 통해 CMOS 트랜지스터 회로에 대한 분석을 수행하며 CMOS 트랜지스터를 사용한 다양한 조합 회로 및 순차 회로의 설계에 대하여 배운다. Simulation 과 Layout 실습 과정을 통해 집적회로 설계 기법을 다룬다. 지식응용 연관 전공능력 설계능력 대표 전공능력 문제정의 연관 전공능력 자원활용 연관 전공능력 영향이해 의사전달 직업윤리 분석실험 평생학습 협동능력 수업목표 주 수업내용 1 * 강의 개요 소개 * MOFET 소자의 동작 - 기본 동작 원리 이론 2 * MOFET 소자의 동작 - 기본 동작 원리 * CMOS 소자 및 구조 이론 과제 1 3 * CMOS 소자 및 구조 * MOFET 소자의 동작 - 2차 효과 및 구현 이론 4 * MOFET 소자의 동작 - 2차 효과 및 구현 이론 과제 2 5 * 인버터 회로 분석 - 정적 특성 이론 6 * 인버터 회로 분석 - 동적 특성 * CMOS 인버터 회로 분석 이론 과제 3 7 * CMOS 인버터 성능 분석 이론 과제 4 8 * 중간 시험 중간 시험 9 * 기본 로직 회로 설계 이론 과제 5 10 * 조합 회로 설계 1 이론 11 * 조삽 회로 설계 2 이론 과제 6 12 보강주간 13 * 순차 회로 설계 1 이론 과제 7 14 * 순차 회로 설계 2 이론 15 * 시스템 설계 분석 이론 과제 8 16 기말 시험 시험"
  },
  {
    "file_name": "27.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/27.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 통신종합설계(Communications Capstone Design) 개설학년 4학년 전공능력 전공능력 대표성 이 과목은 통신에 관한 종합설계 과목으로서 1~3학년 동안 배운 전공지식을 바탕으로 산업체가 필요로 하는 과제를 학생들이 스스로 기획?설계?제작함으로서 창의성과 실 무능력, 팀워크, 리더쉽을 배양하는 과목이다. 지식응용 연관 전공능력 분석실험 연관 전공능력 설계능력 대표 전공능력 문제정의 연관 전공능력 자원활용 연관 전공능력 협동능력 연관 전공능력 의사전달 연관 전공능력 평생학습 연관 전공능력 영향이해 연관 전공능력 직업윤리 연관 전공능력 수업목표 주 수업내용 1 과목 개요 2 이동통신 시스템 개요 3 5G. LTE, Bluetooth, WiFI 4 프로젝트 계획 수립 5 프로젝트 진행 6 프로젝트 진행 7 프로젝트 중간 접검 8 프로젝트 진행 9 프로젝트 진행 10 프로젝트 중간 접검 11 프로젝트 진행 12 보강주간 13 프로젝트 진행 14 프로젝트 중간 접검 15 프로젝트 진행 16 프로젝트 최종평가"
  },
  {
    "file_name": "6.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/6.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 공학수학Ⅰ(Engineering MathematicsⅠ) 개설학년 2학년 전공능력 전공능력 대표성 전자전기컴퓨터공학을 전공하는 학생들에게 회로이론, 제어, 신호처리, 통신, 전자장, 컴퓨터 등 전자전기컴퓨터공학 제 영역의 문제들을 수학적으로 해석하는 방법을 소개 한다. 구체적으로 미분방적식의 여러 가지 해법, 라플라스 변환, 선형대수(대수방정식 의 해, 역행렬, 벡터공간, 선형변환, 행렬, 특성치과 특성 벡터), 벡터 계산 등을 다룬다. 지식응용 대표 전공능력 자원활용 연관 전공능력 영향이해 의사전달 문제정의 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 Matrices and elementary row operations Lecture 2 Determinant, minors, matrix inversion Lecture 3 Solution of inhomogeneous linear equations, inverse matrix Lecture Quiz 4 Eigenvalue problems Lecture 5 Quadratic forms, spectral theorem Lecture Quiz 6 First order ordinary differential equations Lecture 7 Second-order ordinary differential equations with constant coefficients Lecture 8 inhomogeneous differential equations with variation of parameters Lecture Quiz 9 Laplace transformations: fundamentals Lecture 10 Operational properties of Laplace transforms Lecture 11 Partial Differential Equations Lecture 12 보강주간 13 Partial Differential Equations Lecturer Quiz 14 Linear second-order partial differential equations in two variables Lecture 15 Linear second-order partial differential equations in two variables Lecture 16 Some properties of elliptic and parabolic equations Lecture Final"
  },
  {
    "file_name": "7.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/7.pdf",
    "num_pages": 3,
    "content": "교과목명(영문명) 전자전기컴퓨터설계실험Ⅰ (Electrical&Computer Design LaboratoryⅠ) 개설학년 2학년 전공능력 전공능력 대표성 전기전자회로의 기본 이론을 실험을 통하여 학습한다. 전류계, 전압계, 오실로스코프 및 함수발생기의 사용법을 익히고, RLC 회로 및 디지털논리 회로의 설계와 실험을 행한다. 4차산업시대의 근간인 소프트 웨어 능력 배양을 위해 PSPICE 및 MATLAB 의 사용법을 익히고, RLC 회로 및 디지털논리 회로의 시뮬레이션 을 행한다. 분석실험 대표 전공능력 설계능력 연관 전공능력 문제정의 연관 전공능력 협동능력 연관 전공능력 의사전달 연관 전공능력 영향이해 직업윤리 지식응용 자원활용 평생학습 수업목표 주 수업내용 주 수업내용 13 설계 프로젝트 제목 및 진행일정, 개발 내용에 관한 발표를 power point 를 통해 각 조별로 진행한다. power point 로 각 조별로 계 획서 발표 설계프로젝트 진행 보고 서 14 설계프로젝트 실행 및 1차 중간 진행상황 보고 및 발표 평가 power point 로 각 조별로 계 획서 발표 설계프로젝트 진행 보고 서 15 설계프로젝트 실행 및 2차 중간 진행상황 보고 및 발표 평가 power point 로 각 조별로 계 획서 발표 설계프로젝트 진행 보고 서 16 설계프로젝트 실행 및 최종 발표 및 평가 power point 로 각 조별로 결 과보고서 발표 설계프로젝트 결과 보고 서"
  },
  {
    "file_name": "5.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/5.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 전기회로1(Electric Circuits 1) 개설학년 2학년 전공능력 전공능력 대표성 회로이론은 기본적인 수동소자 회로에 대한 분석 방법을 강의한다. 저항으로 이루어진 회로를 통하여 회로 분석의 법칙 및 제반 정리에 대하여 배운다. 기본적인 RLC 회로를 통해 회로의 정상 상태 및 과도 상태를 해석한다. 주파수 변환 및 미적분식을 이용하여 선형 회로의 주파수 및 시간 특성에 대하여 배운다. Op Amp를 사용한 회로의 이론 및 응용에 대하여 다루며 복잡한 구조를 갖는 회로의 합성에 대한 기본적인 이론을 학습한 다. 본 전기회로1은 기존의 전기회로 과목이 폐지되고 대체되는 과목이다. 지식응용 대표 전공능력 분석실험 설계능력 문제정의 연관 전공능력 자원활용 연관 전공능력 협동능력 의사전달 평생학습 영향이해 직업윤리 수업목표 주 수업내용 1 1 Basic Concepts 2 Resistive Circuits Powerpoint, 예제풀이 과제 : 선정된 연습문제 2 3 Nodal and Loop Analysis Techniques Powerpoint, 예제풀이 과제 : 선정된 연습문제 3 3 Nodal and Loop Analysis Techniques Powerpoint, 예제풀이 과제 : 선정된 연습문제 4 4 Operational Amplifiers Powerpoint, 예제풀이 과제 : 선정된 연습문제 5 5 Additional Analysis Techniques Powerpoint, 예제풀이 과제 : 선정된 연습문제 6 6 Capacitance and Inductance Powerpoint, 예제풀이 과제 : 선정된 연습문제 7 7 First- and Second-Order Transient Circuits Powerpoint, 예제풀이 과제 : 선정된 연습문제 8 8 AC Steady-State Analysis Powerpoint, 예제풀이 과제 : 선정된 연습문제 9 8 AC Steady-State Analysis Powerpoint, 예제풀이 과제 : 선정된 연습문제 10 9 Steady-State Power Analysis Powerpoint, 예제풀이 과제 : 선정된 연습문제 11 9 Steady-State Power Analysis Powerpoint, 예제풀이 과제 : 선정된 연습문제 12 보강주간 13 10 Magnetically Coupled Networks Powerpoint, 예제풀이 과제 : 선정된 연습문제 14 11 Polyphase Circuits Powerpoint, 예제풀이 과제 : 선정된 연습문제 15 12 Variable-Frequency Network Performance Powerpoint 예 제풀이 과제 : 선정된 연습문제 16 기말시험"
  },
  {
    "file_name": "4.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/4.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 선형대수학(Linear Algebra) 개설학년 1학년 전공능력 전공능력 대표성 선형대수학은 선형 대수와 행렬의 기본 개념을 다루고 이의 공학적 응용에 대해 학습한 다. 지식응용 연관 전공능력 문제정의 대표 전공능력 자원활용 연관 전공능력 영향이해 의사전달 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 Introduction to Course 강의 주교재, 부교재 2 Pre-course: Basic Definition of Matrix and Vector Pre-course: Basic Operations of Matrix and Vector 1.1절 : Systems of Linear Systems 1.2절 : Row Reduction and Echelon Forms 강의 주교재, 부교재 3 1.3절 : Vector Equations 1.4절 : The Matrix Equation 1.5절 : Solution Sets of Linear Systems 1.7절 : Linear Independence 강의 주교재, 부교재 4 1.8절 : Introduction to Linear Transformation 1.9절 : The Matrix of a Linear Transformation 2.1절 : Matrix Operations 강의 주교재, 부교재 5 2.2절 : The Inverse of a Matrix 2.3절 : Characterizations of Invertible Matrices 2.4절 : Partitioned Matrices 2.5절 : Matrix Factorizations 강의 주교재, 부교재 6 2.8절 : Subspaces of R^n 2.9절 : Dimension and Rank 3.1절 : Introduction to Determinants 3.2절 : Properties of Determinants 강의 주교재, 부교재 7 3.3절 : Cramer’s Rules, Volume, and Linear Transformation 4.1절 : Vector Spaces and Subspaces 4.2절 : Null Spaces, Column Spaces, Row Spaces, and Linear Transformations 강의 주교재, 부교재 8 중간시험 - - 9 4.3절 : Linearly Independent Sets; Bases 4.4절 : Coordinate Systems 4.5절 : The Dimension of a Vector Space 4.6절 : Change of Basis 강의 주교재, 부교재 10 5.1절 : Eigenvectors and Eigenvalues 5.2절 : The Characteristic Equation 5.3절 : Diagonalization 5.4절 : Eigenvectors and Linear Transformations 강의 주교재, 부교재 11 5.5절 : Complex Eigenvalues 5.6절 : Discrete Dynamical Systems 6.1절 : Inner Product, Length, and Orthogonality 6.2절 : Orthogonal Sets 강의 주교재, 부교재 12 보강주간 13 6.3절 : Orthogonal Projection 6.4절 : The Gram-Schmidt Process 6.5절 : Least-Squares Problems 6.7절 : Inner Product Spaces 강의 주교재, 부교재 14 7.1절 : Diagonalization of Symmetric Matrices 7.2절 : Quadratic Forms 7.4절 : The Singular Value Decomposition 강의 주교재, 부교재 15 강의 요약 강의 주교재, 부교재 16 기말시험 - -"
  },
  {
    "file_name": "1.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/1.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) C프로그래밍(CProgramming) 개설학년 1학년 전공능력 전공능력 대표성 C 언어를 이용한 기본 프로그래밍 기술을 익힌다. 선택문, 조건문, 반복문, 함수, 자료 입출력 등의 기본 제어구조와 배열, 문자열, 리스트, 표 등의 초보적인 자료구조를 익히 고 이를 이용한 바람직한 프로그램 설계와 구현, 시험, 디버깅 과정을 소개한다. 지식응용 대표 전공능력 설계능력 연관 전공능력 자원활용 연관 전공능력 영향이해 의사전달 문제정의 직업윤리 분석실험 평생학습 협동능력 수업목표 주 수업내용 1 프르그래미의 개념 강의및 실습 두근두근 C언 어 수업, scratch 2 프로그래밍 작성과정 강의및 실습 두근두근 C언 어 수업, scratch 3 C 프로그램 구성 요소 강의및 실습 두근두근 C언 어 수업, scratch 4 변수와 자료형 강의및 실습 두근두근 C언 어 수업, scratch 5 수식과 연산자 강의및 실습 두근두근 C언 어 수업, scratch 6 조건문 강의및 실습 두근두근 C언 어 수업, scratch 7 반복문 강의및 실습 두근두근 C언 어 수업, scratch 8 함수 강의및 실습 두근두근 C언 어 수업, scratch 9 함수와 변수 강의및 실습 두근두근 C언 어 수업, scratch 10 배열 강의및 실습 두근두근 C언 어 수업, scratch 11 포인터 강의및 실습 두근두근 C언 어 수업, scratch 12 보강주간 13 문자와 문바열 강의및 실습 두근두근 C언 어 수업, scratch 14 구조체 강의및 실습 두근두근 C언 어 수업, scratch 15 포이넡 활용 강의및 실습 두근두근 C언 어 수업, scratch 16 기말고사"
  },
  {
    "file_name": "3.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/3.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 디지털논리설계(Introduction to Digital Logic Design) 개설학년 1학년 전공능력 전공능력 대표성 기본적인 디지털 논리 회로에 대한 이론을 강의한다. 디지털 회로 시스템에 대한 기본 적인 이해를 바탕으로 다양한 논리 게이트 회로를 설계한다. 조합 회로 및 순차 회로에 대하여 학습함으로써 논리 연산 회로 및 유한 상태 기기 시스템의 설계에 관한 내용들 을 다룬다. 지식응용 대표 전공능력 문제정의 연관 전공능력 자원활용 연관 전공능력 영향이해 의사전달 직업윤리 분석실험 설계능력 평생학습 협동능력 수업목표 주 수업내용 1 Introduction Lecture 2 Digital systems Lecture 3 Boolean algebra Lecture 4 Gate minimization Lecture 5 Combinational logic 1 Lecture 6 Combinational logic 2 Lecture 7 Verilog 1 Lecture 8 중간시험 Examination 9 Sequential logic 1 Lecture 10 Sequential logic 2 Lecture 11 Sequential logic 3 Lecture 12 Sequential logic 4 Lecture 13 Verilog 2 Lecture 14 Programmable logic Lecture 15 Wrap-up Lecture 16 기말시험 Examination"
  },
  {
    "file_name": "2.pdf",
    "file_path": "/Users/justin/Desktop/특강/BigData_Camp_LLM_2025/project/course/서울시립대학교_전자전기컴퓨터공학부/2.pdf",
    "num_pages": 2,
    "content": "교과목명(영문명) 학업설계상담Ⅰ(STUDY-PLANNING COUNSELING Ⅰ) 개설학년 1학년 집중수업구분 성적 평가 평가방법 절대평가 □ 출석 (0%) □ 학생포트폴리오 (0%) □ 참여도 (0%) □ 수시과제 (0%) □ 수시시험 (0%) □ 중간과제 (0%) □ 중간시험 (0%) □ 기말과제 (0%) □ 기말시험 (0%) □ 기타 (0%) 수업유형 □일반 □PBL □외국어 □융복합 □서비스러닝 □블렌디드러닝 강의유형 대면(오프라인) 100 % 비대면(온라인) 0 % 시험유형 중간고사 대면□ 비대면□ 없음▣ 기타( 퀴즈, 수시고사 등) 대면□비대면□ 기말고사 대면□ 비대면□ 없음▣ □강의 □발표 □토론 □실험 □실습 □실기 □설계 □견학 □프로젝트 □이러닝(e-learning) 표절금지규정 ‘표절’이란 타인의 글을 적절한 인용 및 참고문헌 표기 없이 자기가 쓴 것처럼 행사하는 것으로서 도덕적 양심을 저버리는 잘못된 행위입니다. 표절한 보고서를 제출하거나 표절한 자료를 사용하여 발표한 경우 정도에 따라 감점 처리하며, 심할 경우 0점으로 처리합니다. ※ 장애학생은 원활한 학업수행을 위해 장애학생지원센터(02-6490-6273)의 도움을 받아 필요한 사항에 대해 담당교수와 협의·조정할 수 있습니다. 교과목 설명 전공능력 미설정 교과목 : 학업설계상담, 단과대학 현장실습, 학생 미래설계학기교과목, 계약학과 수업목표 주 수업내용 1 상담 2 상담 3 상담 4 상담 5 상담 6 상담 7 상담 8 상담 9 상담 10 상담 11 상담 12 보강주간 13 상담 14 상담 15 상담 16"
  }
]